notes/intro_db.org
#+STARTUP: content
#+TODO: TODO IN-PROGRESS DONE

[[https://lagunita.stanford.edu/courses/DB/2014/SelfPaced/about][Database]] on Lagunita

* DONE [[https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/][SQL]] mini-course
  CLOSED: [2017-06-02 Fri 13:07] DEADLINE: <2017-06-03 Sat 20:00>
  :PROPERTIES:
  :VISIBILITY: FOLDED
  :END:
** DONE Lecture videos
   CLOSED: [2017-05-31 Wed 09:53]
*** DONE The Join family of Operators
    CLOSED: [2017-05-30 Tue 16:19]
