notes/intro_db.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-24 Sun 21:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Intro to DB</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lei Zhao" />
<link type="text/css" href="../styles/syntax-highlight.css" rel="stylesheet"/>
<link type="text/css" href="../styles/layout.css" rel="stylesheet"/>
</head>
<body>
<div id="content">
<h1 class="title">Intro to DB</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfd2f58f">1. <span class="done DONE">DONE</span> SQL mini-course</a>
<ul>
<li><a href="#orgd8f0530">1.1. <span class="done DONE">DONE</span> Lecture videos</a>
<ul>
<li><a href="#org42d5f69">1.1.1. <span class="done DONE">DONE</span> The Join family of Operators</a></li>
<li><a href="#org58bfd7c">1.1.2. <span class="done DONE">DONE</span> Aggregation</a></li>
<li><a href="#org5dd8c9d">1.1.3. <span class="done DONE">DONE</span> NULL values</a></li>
<li><a href="#org64b824c">1.1.4. <span class="done DONE">DONE</span> Data Modification Statements</a></li>
</ul>
</li>
<li><a href="#org0b876f5">1.2. <span class="done DONE">DONE</span> Exercises</a>
<ul>
<li><a href="#org492c735">1.2.1. <span class="done DONE">DONE</span> Movie-Rating Query Core</a></li>
<li><a href="#org0a9bb92">1.2.2. <span class="done DONE">DONE</span> Movie-Rating Query Extras</a></li>
<li><a href="#org9762b6b">1.2.3. <span class="done DONE">DONE</span> Social-Network Query Core</a></li>
<li><a href="#org437dfab">1.2.4. <span class="done DONE">DONE</span> Social-Network Query Extras</a></li>
<li><a href="#orgd046bbe">1.2.5. <span class="done DONE">DONE</span> Movie-Rating Modification</a></li>
<li><a href="#org6753299">1.2.6. <span class="done DONE">DONE</span> Social-Network Modification</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb382ec8">2. <span class="done DONE">DONE</span> XPath and XQuery mini-course</a>
<ul>
<li><a href="#orgcee6e23">2.1. <span class="done DONE">DONE</span> Lecture videos</a>
<ul>
<li><a href="#orga1aef34">2.1.1. <span class="done DONE">DONE</span> XPath Introduction</a></li>
<li><a href="#org2fb9b89">2.1.2. <span class="done DONE">DONE</span> XPath Demo</a></li>
<li><a href="#org0b555f3">2.1.3. <span class="done DONE">DONE</span> XQuery Introduction</a></li>
<li><a href="#org40fe4b7">2.1.4. <span class="done DONE">DONE</span> XQuery Demo</a></li>
</ul>
</li>
<li><a href="#org7516b91">2.2. <span class="done DONE">DONE</span> Exercises</a>
<ul>
<li><a href="#orgf3708e2">2.2.1. <span class="done DONE">DONE</span> Course-Catalog XPath and XQuery Exercises</a></li>
<li><a href="#org97ee342">2.2.2. <span class="done DONE">DONE</span> Course-Catalog XPath and XQuery Exercises Extras</a></li>
<li><a href="#org352102f">2.2.3. <span class="done DONE">DONE</span> World-Countries XPath and XQuery Exercises</a></li>
<li><a href="#org8c8cc24">2.2.4. <span class="done DONE">DONE</span> World-Countries XPath and XQuery Exercises Extras</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7d42edd">3. <span class="done DONE">DONE</span> XSLT mini-course</a>
<ul>
<li><a href="#orgfe254ab">3.1. <span class="done DONE">DONE</span> Lecture videos</a></li>
<li><a href="#org4cde76c">3.2. <span class="done DONE">DONE</span> Exercises</a>
<ul>
<li><a href="#org25a75fe">3.2.1. <span class="done DONE">DONE</span> Course-Catalog XSLT</a></li>
<li><a href="#org1be131f">3.2.2. <span class="done DONE">DONE</span> Course-Catalog XSLT Extras</a></li>
<li><a href="#org780b9bd">3.2.3. <span class="done DONE">DONE</span> World-Countries XSLT</a></li>
<li><a href="#orgebe2682">3.2.4. <span class="done DONE">DONE</span> World-Countries XSLT Extras</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org622db22">4. <span class="done DONE">DONE</span> Relational Design Theory mini-course</a>
<ul>
<li><a href="#org5d0317d">4.1. <span class="done DONE">DONE</span> Lecture videos</a>
<ul>
<li><a href="#orge6a4fac">4.1.1. <span class="done DONE">DONE</span> Overview</a></li>
<li><a href="#orga2368fd">4.1.2. <span class="done DONE">DONE</span> Functional Dependencies</a></li>
<li><a href="#org06acf8c">4.1.3. <span class="done DONE">DONE</span> Boyce-Codd Normal Form</a></li>
<li><a href="#org4169027">4.1.4. <span class="done DONE">DONE</span> Multivalued Dependencies and 4th Normal Form</a></li>
<li><a href="#org78a54f0">4.1.5. <span class="done DONE">DONE</span> Shortcomings of BCNF/4NF</a></li>
</ul>
</li>
<li><a href="#orga7779c2">4.2. <span class="done DONE">DONE</span> Exercises</a></li>
</ul>
</li>
<li><a href="#orgccfc649">5. <span class="done DONE">DONE</span> Unified Modeling Language mini-course</a>
<ul>
<li><a href="#orge5ff558">5.1. <span class="done DONE">DONE</span> Lecture Videos</a>
<ul>
<li><a href="#orgf45479a">5.1.1. <span class="done DONE">DONE</span> UML Data Modeling</a></li>
<li><a href="#org53b0a5c">5.1.2. <span class="done DONE">DONE</span> UML to Relations</a></li>
</ul>
</li>
<li><a href="#orgc883a97">5.2. <span class="done DONE">DONE</span> Exercises</a></li>
</ul>
</li>
<li><a href="#orga9a75d5">6. <span class="done DONE">DONE</span> Indexes and Transactions mini-course</a>
<ul>
<li><a href="#orgd8737a6">6.1. <span class="done DONE">DONE</span> Lecture Videos</a>
<ul>
<li><a href="#org54d8103">6.1.1. <span class="done DONE">DONE</span> Indexes</a></li>
<li><a href="#orgddc7a7a">6.1.2. <span class="done DONE">DONE</span> Introduction to Transactions</a></li>
<li><a href="#orgc7211a9">6.1.3. <span class="done DONE">DONE</span> Transaction Properties</a></li>
<li><a href="#org3dc65fc">6.1.4. <span class="done DONE">DONE</span> Isolation Levels</a></li>
</ul>
</li>
<li><a href="#orgaeb9f3c">6.2. <span class="done DONE">DONE</span> Exercises</a>
<ul>
<li><a href="#org54081d1">6.2.1. <span class="done DONE">DONE</span> Index Quiz</a></li>
<li><a href="#orgc446251">6.2.2. <span class="done DONE">DONE</span> Transaction Quiz</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcaf5b6f">7. <span class="done DONE">DONE</span> Constraints and Triggers mini-course</a>
<ul>
<li><a href="#org033ce25">7.1. <span class="done DONE">DONE</span> Lecture Videos</a>
<ul>
<li><a href="#org8880985">7.1.1. <span class="done DONE">DONE</span> Motivation and Overview</a></li>
<li><a href="#orgd71a2fb">7.1.2. <span class="done DONE">DONE</span> Constraints of Several Types</a></li>
<li><a href="#orgab1d028">7.1.3. <span class="done DONE">DONE</span> Referential Integrity</a></li>
<li><a href="#org5bdb333">7.1.4. <span class="done DONE">DONE</span> Triggers Introduction</a></li>
<li><a href="#orgabf08b4">7.1.5. <span class="done DONE">DONE</span> Triggers Demo</a></li>
</ul>
</li>
<li><a href="#org6d894d3">7.2. <span class="done DONE">DONE</span> Exercises</a>
<ul>
<li><a href="#orgd8f1633">7.2.1. <span class="done DONE">DONE</span> Constraints and Triggers</a></li>
<li><a href="#org2e0422b">7.2.2. <span class="done DONE">DONE</span> SQL Social-Network Triggers</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://lagunita.stanford.edu/courses/DB/2014/SelfPaced/about">Database</a> on Lagunita<br />
</p>

<div id="outline-container-orgfd2f58f" class="outline-2">
<h2 id="orgfd2f58f"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> <a href="https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/">SQL</a> mini-course</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd8f0530" class="outline-3">
<h3 id="orgd8f0530"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> Lecture videos</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org42d5f69" class="outline-4">
<h4 id="org42d5f69"><span class="section-number-4">1.1.1</span> <span class="done DONE">DONE</span> The Join family of Operators</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
</div>
