notes/intro_db.org
*** DONE Aggregation
     CLOSED: [2017-05-30 Tue 20:37]
#+BEGIN_SRC sql
select avg(GPA)
from Student;

select min(GPA)
from Student, Apply
where Student.sID = Apply.sID and major = 'CS';

select avg(GPA)
from Student
where sID in (select sID from Apply where major = 'CS');

select count(*)
from College
where enrollment > 15000;

select count(*)
from (select distinct sID from Apply where cName = 'Cornell');

select count(distinct sID)
from Apply
where cName = 'Cornell';

select (select avg(GPA) from Student
        where sID in (select sID from Apply where major = 'CS')) -
       (select avg(GPA) from Student
        where sID not in (select sID from Apply where major = 'CS'));

select cName, count(*)
from Apply
group by cName;

select state, sum(enrollment)
from College
group by state;

select cName, major, max(mx - mn)
from (select cName, major, min(GPA) as mn, max(GPA) as mx
      from Student join Apply using(sID)
      group by cName, major) M;

select sID, sName, count(distinct cName)
from Student join Apply using(sID)
group by sID;

select sID, sName, count(cName)
from Student join
     (select distinct sID, cName
      from Apply) using(sID)
group by sID;

select sID, sName, count(distinct cName)
from Student left join Apply using(sID)
group by sID;

select sID, sName, count(distinct cName)
from Student join Apply using(sID)
group by sID
union
select sID, sName, 0
from Student
where sID not in (select sID from Apply);

select cName
from Apply
group by cName
having count(*) < 5;

select cName
from (select distinct cName from Apply) S
where (select count(*) from Apply where cName = S.cName) < 5;


select cName
from Apply
group by cName
having count(distinct sID) < 5;

select major
from Student join Apply using(sID)
group by major
having max(GPA) < (select avg(GPA) from Student);
#+END_SRC

*** DONE NULL values
     CLOSED: [2017-05-30 Tue 21:23]
#+BEGIN_SRC sql
select sID, sName, GPA
from Student
where GPA <= 3.5 or GPA > 3.5 or GPA is null;

select sID, sName, GPA, sizeHS
from Student
where GPA <= 3.5 or sizeHS < 1600 or sizeHS >= 1600;

select count(*)
from Student
where GPA is not null;
#+END_SRC
SQL uses three-valued logic ([[https://en.wikipedia.org/wiki/Three-valued_logic][3VL]]).

