notes/intro_db.html
<div id="outline-container-org58bfd7c" class="outline-4">
<h4 id="org58bfd7c"><span class="section-number-4">1.1.2</span> <span class="done DONE">DONE</span> Aggregation</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-builtin">avg</span>(GPA)
<span class="org-keyword">from</span> Student;

<span class="org-keyword">select</span> <span class="org-builtin">min</span>(GPA)
<span class="org-keyword">from</span> Student, Apply
<span class="org-keyword">where</span> Student.sID = Apply.sID <span class="org-keyword">and</span> major = <span class="org-string">'CS'</span>;

<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(GPA)
<span class="org-keyword">from</span> Student
<span class="org-keyword">where</span> sID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID <span class="org-keyword">from</span> Apply <span class="org-keyword">where</span> major = <span class="org-string">'CS'</span>);

<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*)
<span class="org-keyword">from</span> College
<span class="org-keyword">where</span> enrollment &gt; 15000;

<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*)
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> sID <span class="org-keyword">from</span> Apply <span class="org-keyword">where</span> cName = <span class="org-string">'Cornell'</span>);

<span class="org-keyword">select</span> <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> sID)
<span class="org-keyword">from</span> Apply
<span class="org-keyword">where</span> cName = <span class="org-string">'Cornell'</span>;

<span class="org-keyword">select</span> (<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(GPA) <span class="org-keyword">from</span> Student
        <span class="org-keyword">where</span> sID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID <span class="org-keyword">from</span> Apply <span class="org-keyword">where</span> major = <span class="org-string">'CS'</span>)) -
       (<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(GPA) <span class="org-keyword">from</span> Student
        <span class="org-keyword">where</span> sID <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID <span class="org-keyword">from</span> Apply <span class="org-keyword">where</span> major = <span class="org-string">'CS'</span>));

<span class="org-keyword">select</span> cName, <span class="org-builtin">count</span>(*)
<span class="org-keyword">from</span> Apply
<span class="org-keyword">group</span> <span class="org-keyword">by</span> cName;

<span class="org-keyword">select</span> <span class="org-keyword">state</span>, <span class="org-builtin">sum</span>(enrollment)
<span class="org-keyword">from</span> College
<span class="org-keyword">group</span> <span class="org-keyword">by</span> <span class="org-keyword">state</span>;

<span class="org-keyword">select</span> cName, major, <span class="org-builtin">max</span>(mx - mn)
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> cName, major, <span class="org-builtin">min</span>(GPA) <span class="org-keyword">as</span> mn, <span class="org-builtin">max</span>(GPA) <span class="org-keyword">as</span> mx
      <span class="org-keyword">from</span> Student <span class="org-keyword">join</span> Apply <span class="org-keyword">using</span>(sID)
      <span class="org-keyword">group</span> <span class="org-keyword">by</span> cName, major) <span class="org-keyword">M</span>;

<span class="org-keyword">select</span> sID, sName, <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> cName)
<span class="org-keyword">from</span> Student <span class="org-keyword">join</span> Apply <span class="org-keyword">using</span>(sID)
<span class="org-keyword">group</span> <span class="org-keyword">by</span> sID;

<span class="org-keyword">select</span> sID, sName, <span class="org-builtin">count</span>(cName)
<span class="org-keyword">from</span> Student <span class="org-keyword">join</span>
     (<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> sID, cName
      <span class="org-keyword">from</span> Apply) <span class="org-keyword">using</span>(sID)
<span class="org-keyword">group</span> <span class="org-keyword">by</span> sID;

<span class="org-keyword">select</span> sID, sName, <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> cName)
<span class="org-keyword">from</span> Student <span class="org-keyword">left</span> <span class="org-keyword">join</span> Apply <span class="org-keyword">using</span>(sID)
<span class="org-keyword">group</span> <span class="org-keyword">by</span> sID;

<span class="org-keyword">select</span> sID, sName, <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> cName)
<span class="org-keyword">from</span> Student <span class="org-keyword">join</span> Apply <span class="org-keyword">using</span>(sID)
<span class="org-keyword">group</span> <span class="org-keyword">by</span> sID
<span class="org-keyword">union</span>
<span class="org-keyword">select</span> sID, sName, 0
<span class="org-keyword">from</span> Student
<span class="org-keyword">where</span> sID <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID <span class="org-keyword">from</span> Apply);

<span class="org-keyword">select</span> cName
<span class="org-keyword">from</span> Apply
<span class="org-keyword">group</span> <span class="org-keyword">by</span> cName
<span class="org-keyword">having</span> <span class="org-builtin">count</span>(*) &lt; 5;

<span class="org-keyword">select</span> cName
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> cName <span class="org-keyword">from</span> Apply) S
<span class="org-keyword">where</span> (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">from</span> Apply <span class="org-keyword">where</span> cName = S.cName) &lt; 5;


<span class="org-keyword">select</span> cName
<span class="org-keyword">from</span> Apply
<span class="org-keyword">group</span> <span class="org-keyword">by</span> cName
<span class="org-keyword">having</span> <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> sID) &lt; 5;

<span class="org-keyword">select</span> major
<span class="org-keyword">from</span> Student <span class="org-keyword">join</span> Apply <span class="org-keyword">using</span>(sID)
<span class="org-keyword">group</span> <span class="org-keyword">by</span> major
<span class="org-keyword">having</span> <span class="org-builtin">max</span>(GPA) &lt; (<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(GPA) <span class="org-keyword">from</span> Student);
</pre>
</div>
</div>
</div>

<div id="outline-container-org5dd8c9d" class="outline-4">
<h4 id="org5dd8c9d"><span class="section-number-4">1.1.3</span> <span class="done DONE">DONE</span> NULL values</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> sID, sName, GPA
<span class="org-keyword">from</span> Student
<span class="org-keyword">where</span> GPA &lt;= 3.5 <span class="org-keyword">or</span> GPA &gt; 3.5 <span class="org-keyword">or</span> GPA <span class="org-keyword">is</span> <span class="org-keyword">null</span>;

<span class="org-keyword">select</span> sID, sName, GPA, sizeHS
<span class="org-keyword">from</span> Student
<span class="org-keyword">where</span> GPA &lt;= 3.5 <span class="org-keyword">or</span> sizeHS &lt; 1600 <span class="org-keyword">or</span> sizeHS &gt;= 1600;

<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*)
<span class="org-keyword">from</span> Student
<span class="org-keyword">where</span> GPA <span class="org-keyword">is</span> <span class="org-keyword">not</span> <span class="org-keyword">null</span>;
</pre>
</div>
<p>
SQL uses three-valued logic (<a href="https://en.wikipedia.org/wiki/Three-valued_logic">3VL</a>).<br />
</p>
</div>
</div>
