notes/intro_db.org
*** DONE Data Modification Statements
     CLOSED: [2017-05-30 Tue 23:36]
#+BEGIN_SRC sql
insert into College
values ('Carnegie Mellon', 'PA', 11500);

insert into Apply
select sID, 'Carnegie Mellon', 'CS', null
from Student
where sID not in (select sID from Apply);

insert into Apply
select distinct sID, 'Carnegie Mellon', 'EE', 'Y'
from Apply
where cName <> 'Carnegie Mellon' and
      major = 'EE' and
      decision = 'N';

delete from Student
where sID in (select sID
              from Apply
              group by sID
              having count(distinct major) > 2);

delete from Apply
where sID in (select sID
              from Apply
              group by sID
              having count(distinct major) > 2);

delete from College
where cName not in (select cName
                    from Apply
                    where major = 'CS');

update Apply
set major = 'economics',
    decision = 'Y'
where cName = 'Carnegie Mellon' and
      sID in (select sID from Student where GPA < 3.6);

update Apply
set major = 'CSE'
where major = 'EE' and
      sID in (select sID
              from Student
              where GPA = (select max(GPA)
                           from Apply join Student using(sID)
                           where major = 'EE'));

select * from Apply
where major = 'EE' and
      sID in (select sID
              from Student
              where GPA >= all (select GPA
                                from Student join Apply using(sID)
                                where major = 'EE'));

update Student
set GPA = (select max(GPA) from Student),
    sizeHS = (select min(sizeHS) from Student);

update Apply
set decision = 'Y';
#+END_SRC

** DONE Exercises
   CLOSED: [2017-06-02 Fri 13:06]
