notes/intro_db.html

<div id="outline-container-org64b824c" class="outline-4">
<h4 id="org64b824c"><span class="section-number-4">1.1.4</span> <span class="done DONE">DONE</span> Data Modification Statements</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> College
<span class="org-keyword">values</span> (<span class="org-string">'Carnegie Mellon'</span>, <span class="org-string">'PA'</span>, 11500);

<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply
<span class="org-keyword">select</span> sID, <span class="org-string">'Carnegie Mellon'</span>, <span class="org-string">'CS'</span>, <span class="org-keyword">null</span>
<span class="org-keyword">from</span> Student
<span class="org-keyword">where</span> sID <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID <span class="org-keyword">from</span> Apply);

<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply
<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> sID, <span class="org-string">'Carnegie Mellon'</span>, <span class="org-string">'EE'</span>, <span class="org-string">'Y'</span>
<span class="org-keyword">from</span> Apply
<span class="org-keyword">where</span> cName &lt;&gt; <span class="org-string">'Carnegie Mellon'</span> <span class="org-keyword">and</span>
      major = <span class="org-string">'EE'</span> <span class="org-keyword">and</span>
      decision = <span class="org-string">'N'</span>;

<span class="org-keyword">delete</span> <span class="org-keyword">from</span> Student
<span class="org-keyword">where</span> sID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID
              <span class="org-keyword">from</span> Apply
              <span class="org-keyword">group</span> <span class="org-keyword">by</span> sID
              <span class="org-keyword">having</span> <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> major) &gt; 2);

<span class="org-keyword">delete</span> <span class="org-keyword">from</span> Apply
<span class="org-keyword">where</span> sID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID
              <span class="org-keyword">from</span> Apply
              <span class="org-keyword">group</span> <span class="org-keyword">by</span> sID
              <span class="org-keyword">having</span> <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> major) &gt; 2);

<span class="org-keyword">delete</span> <span class="org-keyword">from</span> College
<span class="org-keyword">where</span> cName <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> cName
                    <span class="org-keyword">from</span> Apply
                    <span class="org-keyword">where</span> major = <span class="org-string">'CS'</span>);

<span class="org-keyword">update</span> Apply
<span class="org-keyword">set</span> major = <span class="org-string">'economics'</span>,
    decision = <span class="org-string">'Y'</span>
<span class="org-keyword">where</span> cName = <span class="org-string">'Carnegie Mellon'</span> <span class="org-keyword">and</span>
      sID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> GPA &lt; 3.6);

<span class="org-keyword">update</span> Apply
<span class="org-keyword">set</span> major = <span class="org-string">'CSE'</span>
<span class="org-keyword">where</span> major = <span class="org-string">'EE'</span> <span class="org-keyword">and</span>
      sID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID
              <span class="org-keyword">from</span> Student
              <span class="org-keyword">where</span> GPA = (<span class="org-keyword">select</span> <span class="org-builtin">max</span>(GPA)
                           <span class="org-keyword">from</span> Apply <span class="org-keyword">join</span> Student <span class="org-keyword">using</span>(sID)
                           <span class="org-keyword">where</span> major = <span class="org-string">'EE'</span>));

<span class="org-keyword">select</span> * <span class="org-keyword">from</span> Apply
<span class="org-keyword">where</span> major = <span class="org-string">'EE'</span> <span class="org-keyword">and</span>
      sID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID
              <span class="org-keyword">from</span> Student
              <span class="org-keyword">where</span> GPA &gt;= <span class="org-keyword">all</span> (<span class="org-keyword">select</span> GPA
                                <span class="org-keyword">from</span> Student <span class="org-keyword">join</span> Apply <span class="org-keyword">using</span>(sID)
                                <span class="org-keyword">where</span> major = <span class="org-string">'EE'</span>));

<span class="org-keyword">update</span> Student
<span class="org-keyword">set</span> GPA = (<span class="org-keyword">select</span> <span class="org-builtin">max</span>(GPA) <span class="org-keyword">from</span> Student),
    sizeHS = (<span class="org-keyword">select</span> <span class="org-builtin">min</span>(sizeHS) <span class="org-keyword">from</span> Student);

<span class="org-keyword">update</span> Apply
<span class="org-keyword">set</span> decision = <span class="org-string">'Y'</span>;
</pre>
</div>
</div>
</div>
</div>
