notes/intro_db.org
*** DONE Movie-Rating Query [[https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_movie_query_core/][Core]]
     CLOSED: [2017-05-31 Wed 14:45]
Find the titles of all movies directed by Steven Spielberg.

#+BEGIN_SRC sql
select title
from Movie
where director = 'Steven Spielberg';
#+END_SRC

Find all years that have a movie that received a rating of 4 or 5, and
sort them in increasing order.

#+BEGIN_SRC sql
select year
from Movie
where mID in (select mID
              from Rating
              where stars >= 4)
order by year;
#+END_SRC

Find the titles of all movies that have no ratings.

#+BEGIN_SRC sql
select title
from Movie
where mID not in (select mID from Rating);
#+END_SRC

Some reviewers didn't provide a date with their rating.  Find the
names of all reviewers who have ratings with a NULL value for the
date.

#+BEGIN_SRC sql
select name
from Reviewer
where rID in (select rID from Rating
              where ratingDate is null);
#+END_SRC

Write a query to return the ratings data in a more readable format:
reviewer name, movie title, stars, and ratingDate.  Also, sort the
data, first by reviewer name, then by movie title, and lastly by
number of stars.

#+BEGIN_SRC sql
select name, title, stars, ratingDate
from Reviewer join Rating using(rID) join Movie using(mID)
order by name, title, stars;
#+END_SRC

For all cases where the same reviewer rated the same movie twice and
gave it a higher rating the second time, return the reviewer's name
and the title of the movie.

#+BEGIN_SRC sql
select name, title
from (select rID, mID
      from Rating R1 join Rating R2 using(rID, mID)
      where R1.stars > R2.stars and
            R1.ratingDate > R2.ratingDate and
            (select count(*) from Rating
             where rID = R1.rID and mID = R1.mID) = 2)
      join Reviewer using(rID)
      join Movie using(mID);
#+END_SRC

For each movie that has at least one rating, find the highest number
of stars that movie received.  Return the movie title and number of
stars.  Sort by movie title.

#+BEGIN_SRC sql
select title, max(stars)
from Rating join Movie using(mID)
group by mID
order by title;
#+END_SRC

For each movie, return the title and the 'rating spread', that is, the
difference between highest and lowest ratings given to that movie.
Sort by rating spread from highest to lowest, then by movie title.

#+BEGIN_SRC sql
select title, spread
from (select mID, max(stars) - min(stars) as spread
      from Rating
      group by mID)
      join Movie using(mID)
order by spread desc, title;
#+END_SRC

Find the difference between the average rating of movies released
before 1980 and the average rating of movies released after 1980.
(Make sure to calculate the average rating for each movie, then the
average of those averages for movies before 1980 and movies after.
Don't just calculate the overall average rating before and after
1980.)

#+BEGIN_SRC sql
select
(select avg(avgStars)
 from (select mID, avg(stars) as avgStars
       from Rating
       group by mID) join Movie using(mID)
 where year < 1980) -
(select avg(avgStars)
 from (select mID, avg(stars) as avgStars
       from Rating
       group by mID) join Movie using(mID)
 where year >= 1980);
#+END_SRC
