notes/intro_db.html

<div id="outline-container-org0b876f5" class="outline-3">
<h3 id="org0b876f5"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> Exercises</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org492c735" class="outline-4">
<h4 id="org492c735"><span class="section-number-4">1.2.1</span> <span class="done DONE">DONE</span> Movie-Rating Query <a href="https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_movie_query_core/">Core</a></h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Find the titles of all movies directed by Steven Spielberg.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> title
<span class="org-keyword">from</span> Movie
<span class="org-keyword">where</span> director = <span class="org-string">'Steven Spielberg'</span>;
</pre>
</div>

<p>
Find all years that have a movie that received a rating of 4 or 5, and<br />
sort them in increasing order.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">year</span>
<span class="org-keyword">from</span> Movie
<span class="org-keyword">where</span> mID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> mID
              <span class="org-keyword">from</span> Rating
              <span class="org-keyword">where</span> stars &gt;= 4)
<span class="org-keyword">order</span> <span class="org-keyword">by</span> <span class="org-keyword">year</span>;
</pre>
</div>

<p>
Find the titles of all movies that have no ratings.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> title
<span class="org-keyword">from</span> Movie
<span class="org-keyword">where</span> mID <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> mID <span class="org-keyword">from</span> Rating);
</pre>
</div>

<p>
Some reviewers didn't provide a date with their rating.  Find the<br />
names of all reviewers who have ratings with a NULL value for the<br />
date.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>
<span class="org-keyword">from</span> Reviewer
<span class="org-keyword">where</span> rID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> rID <span class="org-keyword">from</span> Rating
              <span class="org-keyword">where</span> ratingDate <span class="org-keyword">is</span> <span class="org-keyword">null</span>);
</pre>
</div>

<p>
Write a query to return the ratings data in a more readable format:<br />
reviewer name, movie title, stars, and ratingDate.  Also, sort the<br />
data, first by reviewer name, then by movie title, and lastly by<br />
number of stars.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>, title, stars, ratingDate
<span class="org-keyword">from</span> Reviewer <span class="org-keyword">join</span> Rating <span class="org-keyword">using</span>(rID) <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(mID)
<span class="org-keyword">order</span> <span class="org-keyword">by</span> <span class="org-keyword">name</span>, title, stars;
</pre>
</div>

<p>
For all cases where the same reviewer rated the same movie twice and<br />
gave it a higher rating the second time, return the reviewer's name<br />
and the title of the movie.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>, title
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> rID, mID
      <span class="org-keyword">from</span> Rating R1 <span class="org-keyword">join</span> Rating R2 <span class="org-keyword">using</span>(rID, mID)
      <span class="org-keyword">where</span> R1.stars &gt; R2.stars <span class="org-keyword">and</span>
            R1.ratingDate &gt; R2.ratingDate <span class="org-keyword">and</span>
            (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">from</span> Rating
             <span class="org-keyword">where</span> rID = R1.rID <span class="org-keyword">and</span> mID = R1.mID) = 2)
      <span class="org-keyword">join</span> Reviewer <span class="org-keyword">using</span>(rID)
      <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(mID);
</pre>
</div>

<p>
For each movie that has at least one rating, find the highest number<br />
of stars that movie received.  Return the movie title and number of<br />
stars.  Sort by movie title.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> title, <span class="org-builtin">max</span>(stars)
<span class="org-keyword">from</span> Rating <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(mID)
<span class="org-keyword">group</span> <span class="org-keyword">by</span> mID
<span class="org-keyword">order</span> <span class="org-keyword">by</span> title;
</pre>
</div>

<p>
For each movie, return the title and the 'rating spread', that is, the<br />
difference between highest and lowest ratings given to that movie.<br />
Sort by rating spread from highest to lowest, then by movie title.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> title, spread
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> mID, <span class="org-builtin">max</span>(stars) - <span class="org-builtin">min</span>(stars) <span class="org-keyword">as</span> spread
      <span class="org-keyword">from</span> Rating
      <span class="org-keyword">group</span> <span class="org-keyword">by</span> mID)
      <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(mID)
<span class="org-keyword">order</span> <span class="org-keyword">by</span> spread <span class="org-keyword">desc</span>, title;
</pre>
</div>

<p>
Find the difference between the average rating of movies released<br />
before 1980 and the average rating of movies released after 1980.<br />
(Make sure to calculate the average rating for each movie, then the<br />
average of those averages for movies before 1980 and movies after.<br />
Don't just calculate the overall average rating before and after<br />
1980.)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span>
(<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(avgStars)
 <span class="org-keyword">from</span> (<span class="org-keyword">select</span> mID, <span class="org-builtin">avg</span>(stars) <span class="org-keyword">as</span> avgStars
       <span class="org-keyword">from</span> Rating
       <span class="org-keyword">group</span> <span class="org-keyword">by</span> mID) <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(mID)
 <span class="org-keyword">where</span> <span class="org-keyword">year</span> &lt; 1980) -
(<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(avgStars)
 <span class="org-keyword">from</span> (<span class="org-keyword">select</span> mID, <span class="org-builtin">avg</span>(stars) <span class="org-keyword">as</span> avgStars
       <span class="org-keyword">from</span> Rating
       <span class="org-keyword">group</span> <span class="org-keyword">by</span> mID) <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(mID)
 <span class="org-keyword">where</span> <span class="org-keyword">year</span> &gt;= 1980);
</pre>
</div>
</div>
</div>
