notes/intro_db.org
*** DONE Movie-Rating Query [[https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_movie_query_extra/][Extras]]
     CLOSED: [2017-06-01 Thu 11:38]
Find the names of all reviewers who rated Gone with the Wind.

#+BEGIN_SRC sql
select name
from Reviewer
where rID in (select rID from Rating
              where mID = (select mID from Movie
                           where title = 'Gone with the Wind'));
#+END_SRC

For any rating where the reviewer is the same as the director of the
movie, return the reviewer name, movie title, and number of stars.

#+BEGIN_SRC sql
select distinct name, title, stars
from Rating join Reviewer using(rID) join Movie using(mID)
where director = name;
#+END_SRC

Return all reviewer names and movie names together in a single list,
alphabetized.  (Sorting by the first name of the reviewer and first
word in the title is fine; no need for special processing on last
names or removing "The".)

#+BEGIN_SRC sql
select name
from (select name
      from Reviewer
      union
      select title as name
      from Movie)
order by name;
#+END_SRC

Find the titles of all movies not reviewed by Chris Jackson.

#+BEGIN_SRC sql
select title
from Movie
where mID not in (select mID from Rating
                  where rID in (select rID from Reviewer
                                where name = 'Chris Jackson'));
#+END_SRC

For all pairs of reviewers such that both reviewers gave a rating to
the same movie, return the names of both reviewers.  Eliminate
duplicates, don't pair reviewers with themselves, and include each
pair only once.  For each pair, return the names in the pair in
alphabetical order.

#+BEGIN_SRC sql
select distinct R1.name, R2.name
from (Rating join Reviewer using(rID)) R1 join
     (Rating join Reviewer using(rID)) R2
on R1.mID = R2.mID and
   R1.rID <> R2.rID and
   R1.name <= R2.name;
#+END_SRC

For each rating that is the lowest (fewest stars) currently in the
database, return the reviewer name, movie title, and number of stars.

#+BEGIN_SRC sql
select name, title, stars
from Rating R1 join Reviewer R2 join Movie M
on R1.rID = R2.rID and
   R1.mID = m.mID and
   stars = (select min(stars) from Rating);
#+END_SRC

List movie titles and average ratings, from highest-rated to
lowest-rated.  If two or more movies have the same average rating,
list them in alphabetical order.

#+BEGIN_SRC sql
select title, avgStars
from (select mID, avg(stars) as avgStars
      from Rating
      group by mID) join Movie using(mID)
order by avgStars desc, title;
#+END_SRC

Find the names of all reviewers who have contributed three or more
ratings.  (As an extra challenge, try writing the query without HAVING
or without COUNT.)

#+BEGIN_SRC sql
select name
from Reviewer
where rID in (select rID
              from Rating
              group by rID
              having count(*) >= 3);

select name
from (select rID
      from Rating
      group by rID
      having count(*) >= 3)
     join Reviewer using(rID);

select name
from Rating join Reviewer using(rID)
group by rID
having count(*) >= 3;

select name
from Reviewer
where rID in (select rID
              from Rating R
              where rID in (select rID
                            from Rating S
                            where rID = R.rID and
                                  (mID <> R.mID or
                                   stars <> R.stars) and
                                  rID in (select rID
                                          from Rating
                                          where rID = R.rID and
                                                (mID <> R.mID or
                                                 stars <> R.stars) and
                                                (mID <> S.mID or
                                                 stars <> S.stars))));
#+END_SRC

Some directors directed more than one movie.  For all such directors,
return the titles of all movies directed by them, along with the
director name.  Sort by director name, then movie title.  (As an extra
challenge, try writing the query both with and without COUNT.)

#+BEGIN_SRC sql
select title, director
from Movie
where director in (select director
                   from Movie
                   group by director
                   having count(*) > 1)
order by director, title;

select title, director
from Movie R
where director in (select director
                   from Movie
                   where director = R.director and
                         mID <> R.mID)
order by director, title;
#+END_SRC

Find the movie(s) with the highest average rating. Return the movie
title(s) and average rating.  (Hint: This query is more difficult to
write in SQLite than other systems; you might think of it as finding
the highest average rating and then choosing the movie(s) with that
average rating.)

#+BEGIN_SRC sql
select title, (select avg(stars) from Rating where mID = R.mID) as avgStars
from Movie R
where avgStars = (select max((select avg(stars) from Rating where mID = S.mID))
                  from Movie S);
#+END_SRC

Find the movie(s) with the lowest average rating.  Return the movie
title(s) and average rating.  (Hint: This query may be more difficult
to write in SQLite than other systems; you might think of it as
finding the lowest average rating and then choosing the movie(s) with
that average rating.)

#+BEGIN_SRC sql
select title, (select avg(stars) from Rating where mID = R.mID) as avgStars
from Movie R
where avgStars = (select min((select avg(stars) from Rating where mID = S.mID))
                  from Movie S);
#+END_SRC

For each director, return the director's name together with the
title(s) of the movie(s) they directed that received the highest
rating among all of their movies, and the value of that rating.
Ignore movies whose director is NULL.

#+BEGIN_SRC sql
select distinct director, title, maxStars
from (select director,
             (select max(stars)
              from Rating join Movie using(mID)
              where director = D.director) as maxStars
      from (select distinct director from Movie
            where director is not null) D)
      join Movie using(director) join Rating using(mID)
where stars = maxStars;
#+END_SRC

