notes/intro_db.html
<div id="outline-container-org0a9bb92" class="outline-4">
<h4 id="org0a9bb92"><span class="section-number-4">1.2.2</span> <span class="done DONE">DONE</span> Movie-Rating Query <a href="https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_movie_query_extra/">Extras</a></h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Find the names of all reviewers who rated Gone with the Wind.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>
<span class="org-keyword">from</span> Reviewer
<span class="org-keyword">where</span> rID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> rID <span class="org-keyword">from</span> Rating
              <span class="org-keyword">where</span> mID = (<span class="org-keyword">select</span> mID <span class="org-keyword">from</span> Movie
                           <span class="org-keyword">where</span> title = <span class="org-string">'Gone with the Wind'</span>));
</pre>
</div>

<p>
For any rating where the reviewer is the same as the director of the<br />
movie, return the reviewer name, movie title, and number of stars.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">distinct</span> <span class="org-keyword">name</span>, title, stars
<span class="org-keyword">from</span> Rating <span class="org-keyword">join</span> Reviewer <span class="org-keyword">using</span>(rID) <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(mID)
<span class="org-keyword">where</span> director = <span class="org-keyword">name</span>;
</pre>
</div>

<p>
Return all reviewer names and movie names together in a single list,<br />
alphabetized.  (Sorting by the first name of the reviewer and first<br />
word in the title is fine; no need for special processing on last<br />
names or removing "The".)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> <span class="org-keyword">name</span>
      <span class="org-keyword">from</span> Reviewer
      <span class="org-keyword">union</span>
      <span class="org-keyword">select</span> title <span class="org-keyword">as</span> <span class="org-keyword">name</span>
      <span class="org-keyword">from</span> Movie)
<span class="org-keyword">order</span> <span class="org-keyword">by</span> <span class="org-keyword">name</span>;
</pre>
</div>

<p>
Find the titles of all movies not reviewed by Chris Jackson.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> title
<span class="org-keyword">from</span> Movie
<span class="org-keyword">where</span> mID <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> mID <span class="org-keyword">from</span> Rating
                  <span class="org-keyword">where</span> rID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> rID <span class="org-keyword">from</span> Reviewer
                                <span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Chris Jackson'</span>));
</pre>
</div>

<p>
For all pairs of reviewers such that both reviewers gave a rating to<br />
the same movie, return the names of both reviewers.  Eliminate<br />
duplicates, don't pair reviewers with themselves, and include each<br />
pair only once.  For each pair, return the names in the pair in<br />
alphabetical order.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">distinct</span> R1.<span class="org-keyword">name</span>, R2.<span class="org-keyword">name</span>
<span class="org-keyword">from</span> (Rating <span class="org-keyword">join</span> Reviewer <span class="org-keyword">using</span>(rID)) R1 <span class="org-keyword">join</span>
     (Rating <span class="org-keyword">join</span> Reviewer <span class="org-keyword">using</span>(rID)) R2
<span class="org-keyword">on</span> R1.mID = R2.mID <span class="org-keyword">and</span>
   R1.rID &lt;&gt; R2.rID <span class="org-keyword">and</span>
   R1.<span class="org-keyword">name</span> &lt;= R2.<span class="org-keyword">name</span>;
</pre>
</div>

<p>
For each rating that is the lowest (fewest stars) currently in the<br />
database, return the reviewer name, movie title, and number of stars.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>, title, stars
<span class="org-keyword">from</span> Rating R1 <span class="org-keyword">join</span> Reviewer R2 <span class="org-keyword">join</span> Movie <span class="org-keyword">M</span>
<span class="org-keyword">on</span> R1.rID = R2.rID <span class="org-keyword">and</span>
   R1.mID = <span class="org-keyword">m</span>.mID <span class="org-keyword">and</span>
   stars = (<span class="org-keyword">select</span> <span class="org-builtin">min</span>(stars) <span class="org-keyword">from</span> Rating);
</pre>
</div>

<p>
List movie titles and average ratings, from highest-rated to<br />
lowest-rated.  If two or more movies have the same average rating,<br />
list them in alphabetical order.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> title, avgStars
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> mID, <span class="org-builtin">avg</span>(stars) <span class="org-keyword">as</span> avgStars
      <span class="org-keyword">from</span> Rating
      <span class="org-keyword">group</span> <span class="org-keyword">by</span> mID) <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(mID)
<span class="org-keyword">order</span> <span class="org-keyword">by</span> avgStars <span class="org-keyword">desc</span>, title;
</pre>
</div>

<p>
Find the names of all reviewers who have contributed three or more<br />
ratings.  (As an extra challenge, try writing the query without HAVING<br />
or without COUNT.)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>
<span class="org-keyword">from</span> Reviewer
<span class="org-keyword">where</span> rID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> rID
              <span class="org-keyword">from</span> Rating
              <span class="org-keyword">group</span> <span class="org-keyword">by</span> rID
              <span class="org-keyword">having</span> <span class="org-builtin">count</span>(*) &gt;= 3);

<span class="org-keyword">select</span> <span class="org-keyword">name</span>
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> rID
      <span class="org-keyword">from</span> Rating
      <span class="org-keyword">group</span> <span class="org-keyword">by</span> rID
      <span class="org-keyword">having</span> <span class="org-builtin">count</span>(*) &gt;= 3)
     <span class="org-keyword">join</span> Reviewer <span class="org-keyword">using</span>(rID);

<span class="org-keyword">select</span> <span class="org-keyword">name</span>
<span class="org-keyword">from</span> Rating <span class="org-keyword">join</span> Reviewer <span class="org-keyword">using</span>(rID)
<span class="org-keyword">group</span> <span class="org-keyword">by</span> rID
<span class="org-keyword">having</span> <span class="org-builtin">count</span>(*) &gt;= 3;

<span class="org-keyword">select</span> <span class="org-keyword">name</span>
<span class="org-keyword">from</span> Reviewer
<span class="org-keyword">where</span> rID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> rID
              <span class="org-keyword">from</span> Rating R
              <span class="org-keyword">where</span> rID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> rID
                            <span class="org-keyword">from</span> Rating S
                            <span class="org-keyword">where</span> rID = R.rID <span class="org-keyword">and</span>
                                  (mID &lt;&gt; R.mID <span class="org-keyword">or</span>
                                   stars &lt;&gt; R.stars) <span class="org-keyword">and</span>
                                  rID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> rID
                                          <span class="org-keyword">from</span> Rating
                                          <span class="org-keyword">where</span> rID = R.rID <span class="org-keyword">and</span>
                                                (mID &lt;&gt; R.mID <span class="org-keyword">or</span>
                                                 stars &lt;&gt; R.stars) <span class="org-keyword">and</span>
                                                (mID &lt;&gt; S.mID <span class="org-keyword">or</span>
                                                 stars &lt;&gt; S.stars))));
</pre>
</div>

<p>
Some directors directed more than one movie.  For all such directors,<br />
return the titles of all movies directed by them, along with the<br />
director name.  Sort by director name, then movie title.  (As an extra<br />
challenge, try writing the query both with and without COUNT.)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> title, director
<span class="org-keyword">from</span> Movie
<span class="org-keyword">where</span> director <span class="org-keyword">in</span> (<span class="org-keyword">select</span> director
                   <span class="org-keyword">from</span> Movie
                   <span class="org-keyword">group</span> <span class="org-keyword">by</span> director
                   <span class="org-keyword">having</span> <span class="org-builtin">count</span>(*) &gt; 1)
<span class="org-keyword">order</span> <span class="org-keyword">by</span> director, title;

<span class="org-keyword">select</span> title, director
<span class="org-keyword">from</span> Movie R
<span class="org-keyword">where</span> director <span class="org-keyword">in</span> (<span class="org-keyword">select</span> director
                   <span class="org-keyword">from</span> Movie
                   <span class="org-keyword">where</span> director = R.director <span class="org-keyword">and</span>
                         mID &lt;&gt; R.mID)
<span class="org-keyword">order</span> <span class="org-keyword">by</span> director, title;
</pre>
</div>

<p>
Find the movie(s) with the highest average rating. Return the movie<br />
title(s) and average rating.  (Hint: This query is more difficult to<br />
write in SQLite than other systems; you might think of it as finding<br />
the highest average rating and then choosing the movie(s) with that<br />
average rating.)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> title, (<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(stars) <span class="org-keyword">from</span> Rating <span class="org-keyword">where</span> mID = R.mID) <span class="org-keyword">as</span> avgStars
<span class="org-keyword">from</span> Movie R
<span class="org-keyword">where</span> avgStars = (<span class="org-keyword">select</span> <span class="org-builtin">max</span>((<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(stars) <span class="org-keyword">from</span> Rating <span class="org-keyword">where</span> mID = S.mID))
                  <span class="org-keyword">from</span> Movie S);
</pre>
</div>

<p>
Find the movie(s) with the lowest average rating.  Return the movie<br />
title(s) and average rating.  (Hint: This query may be more difficult<br />
to write in SQLite than other systems; you might think of it as<br />
finding the lowest average rating and then choosing the movie(s) with<br />
that average rating.)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> title, (<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(stars) <span class="org-keyword">from</span> Rating <span class="org-keyword">where</span> mID = R.mID) <span class="org-keyword">as</span> avgStars
<span class="org-keyword">from</span> Movie R
<span class="org-keyword">where</span> avgStars = (<span class="org-keyword">select</span> <span class="org-builtin">min</span>((<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(stars) <span class="org-keyword">from</span> Rating <span class="org-keyword">where</span> mID = S.mID))
                  <span class="org-keyword">from</span> Movie S);
</pre>
</div>

<p>
For each director, return the director's name together with the<br />
title(s) of the movie(s) they directed that received the highest<br />
rating among all of their movies, and the value of that rating.<br />
Ignore movies whose director is NULL.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">distinct</span> director, title, maxStars
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> director,
             (<span class="org-keyword">select</span> <span class="org-builtin">max</span>(stars)
              <span class="org-keyword">from</span> Rating <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(mID)
              <span class="org-keyword">where</span> director = D.director) <span class="org-keyword">as</span> maxStars
      <span class="org-keyword">from</span> (<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> director <span class="org-keyword">from</span> Movie
            <span class="org-keyword">where</span> director <span class="org-keyword">is</span> <span class="org-keyword">not</span> <span class="org-keyword">null</span>) D)
      <span class="org-keyword">join</span> Movie <span class="org-keyword">using</span>(director) <span class="org-keyword">join</span> Rating <span class="org-keyword">using</span>(mID)
<span class="org-keyword">where</span> stars = maxStars;
</pre>
</div>
</div>
</div>
