notes/intro_db.org
*** DONE Social-Network Query [[https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_social_query_core/][Core]]
     CLOSED: [2017-06-02 Fri 00:51]
Find the names of all students who are friends with someone named
Gabriel.

#+BEGIN_SRC sql
select name
from Highschooler
where ID in (select ID1
             from Friend
             where ID1 = ID and
                   ID2 in (select ID
                           from Highschooler
                           where name = 'Gabriel'));
#+END_SRC

For every student who likes someone 2 or more grades younger than
themselves, return that student's name and grade, and the name and
grade of the student they like.

#+BEGIN_SRC sql
select (select name from Highschooler where ID = ID1),
       (select grade from Highschooler where ID = ID1),
       (select name from Highschooler where ID = ID2),
       (select grade from Highschooler where ID = ID2)
from Likes
where (select grade from Highschooler where ID = ID1) -
      (select grade from Highschooler where ID = ID2) >= 2;
#+END_SRC

For every pair of students who both like each other, return the name
and grade of both students.  Include each pair only once, with the two
names in alphabetical order.

#+BEGIN_SRC sql
select *
from Likes
where ID1 < ID2
intersect
select ID2, ID1
from Likes;

select (select name from Highschooler where ID = R.ID1),
       (select grade from Highschooler where ID = R.ID1),
       (select name from Highschooler where ID = R.ID2),
       (select grade from Highschooler where ID = R.ID2)
from Likes R
where (select name from Highschooler where ID = R.ID1) <
      (select name from Highschooler where ID = R.ID2) and
      ID2 in (select ID1 from Likes
              where ID1 = R.ID2 and ID2 = R.ID1);
#+END_SRC

Find all students who do not appear in the Likes table (as a student
who likes or is liked) and return their names and grades.  Sort by
grade, then by name within each grade.

#+BEGIN_SRC sql
select name, grade
from Highschooler
where ID not in (select ID1 from Likes) and
      ID not in (select ID2 from Likes)
order by grade, name;
#+END_SRC

For every situation where student A likes student B, but we have no
information about whom B likes (that is, B does not appear as an ID1
in the Likes table), return A and B's names and grades.

#+BEGIN_SRC sql
select (select name from Highschooler where ID = ID1),
       (select grade from Highschooler where ID = ID1),
       (select name from Highschooler where ID = ID2),
       (select grade from Highschooler where ID = ID2)
from Likes
where ID2 not in (select ID1 from Likes);
#+END_SRC

Find names and grades of students who only have friends in the same
grade. Return the result sorted by grade, then by name within each
grade.

#+BEGIN_SRC sql
select name, grade
from Highschooler
where ID not in (select ID1
                 from Friend
                 where (select grade from Highschooler where ID = ID1) <>
                       (select grade from Highschooler where ID = ID2))
order by grade, name;
#+END_SRC

For each student A who likes a student B where the two are not
friends, find if they have a friend C in common (who can introduce
them!).  For all such trios, return the name and grade of A, B, and C.

#+BEGIN_SRC sql
select (select name from Highschooler where ID = T.ID1),
       (select grade from Highschooler where ID = T.ID1),
       (select name from Highschooler where ID = T.ID2),
       (select grade from Highschooler where ID = T.ID2),
       name, grade
from (select * from Likes
      except
      select * from Friend) T
     join Highschooler
on ID in (select ID2 from Friend where ID1 = T.ID1) and
   ID in (select ID2 from Friend where ID1 = T.ID2);
#+END_SRC

Find the difference between the number of students in the school and
the number of different first names.

#+BEGIN_SRC sql
select count(ID) - count(distinct name)
from Highschooler;
#+END_SRC

Find the name and grade of all students who are liked by more than one
other student.

#+BEGIN_SRC sql
select name2, grade2
from (select ID1, name1, grade1, ID2, name as name2, grade as grade2
      from (select ID1, name as name1, grade as grade1, ID2
            from Likes join Highschooler H on ID1 = H.ID)
                 join Highschooler H on ID2 = H.ID)
group by ID2
having count(*) > 1;
#+END_SRC

