notes/intro_db.html

<div id="outline-container-org9762b6b" class="outline-4">
<h4 id="org9762b6b"><span class="section-number-4">1.2.3</span> <span class="done DONE">DONE</span> Social-Network Query <a href="https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_social_query_core/">Core</a></h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Find the names of all students who are friends with someone named<br />
Gabriel.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>
<span class="org-keyword">from</span> Highschooler
<span class="org-keyword">where</span> ID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID1
             <span class="org-keyword">from</span> Friend
             <span class="org-keyword">where</span> ID1 = ID <span class="org-keyword">and</span>
                   ID2 <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID
                           <span class="org-keyword">from</span> Highschooler
                           <span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Gabriel'</span>));
</pre>
</div>

<p>
For every student who likes someone 2 or more grades younger than<br />
themselves, return that student's name and grade, and the name and<br />
grade of the student they like.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID1),
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID1),
       (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID2),
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID2)
<span class="org-keyword">from</span> Likes
<span class="org-keyword">where</span> (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID1) -
      (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID2) &gt;= 2;
</pre>
</div>

<p>
For every pair of students who both like each other, return the name<br />
and grade of both students.  Include each pair only once, with the two<br />
names in alphabetical order.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> *
<span class="org-keyword">from</span> Likes
<span class="org-keyword">where</span> ID1 &lt; ID2
<span class="org-keyword">intersect</span>
<span class="org-keyword">select</span> ID2, ID1
<span class="org-keyword">from</span> Likes;

<span class="org-keyword">select</span> (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = R.ID1),
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = R.ID1),
       (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = R.ID2),
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = R.ID2)
<span class="org-keyword">from</span> Likes R
<span class="org-keyword">where</span> (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = R.ID1) &lt;
      (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = R.ID2) <span class="org-keyword">and</span>
      ID2 <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID1 <span class="org-keyword">from</span> Likes
              <span class="org-keyword">where</span> ID1 = R.ID2 <span class="org-keyword">and</span> ID2 = R.ID1);
</pre>
</div>

<p>
Find all students who do not appear in the Likes table (as a student<br />
who likes or is liked) and return their names and grades.  Sort by<br />
grade, then by name within each grade.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>, grade
<span class="org-keyword">from</span> Highschooler
<span class="org-keyword">where</span> ID <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID1 <span class="org-keyword">from</span> Likes) <span class="org-keyword">and</span>
      ID <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID2 <span class="org-keyword">from</span> Likes)
<span class="org-keyword">order</span> <span class="org-keyword">by</span> grade, <span class="org-keyword">name</span>;
</pre>
</div>

<p>
For every situation where student A likes student B, but we have no<br />
information about whom B likes (that is, B does not appear as an ID1<br />
in the Likes table), return A and B's names and grades.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID1),
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID1),
       (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID2),
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID2)
<span class="org-keyword">from</span> Likes
<span class="org-keyword">where</span> ID2 <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID1 <span class="org-keyword">from</span> Likes);
</pre>
</div>

<p>
Find names and grades of students who only have friends in the same<br />
grade. Return the result sorted by grade, then by name within each<br />
grade.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>, grade
<span class="org-keyword">from</span> Highschooler
<span class="org-keyword">where</span> ID <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID1
                 <span class="org-keyword">from</span> Friend
                 <span class="org-keyword">where</span> (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID1) &lt;&gt;
                       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID2))
<span class="org-keyword">order</span> <span class="org-keyword">by</span> grade, <span class="org-keyword">name</span>;
</pre>
</div>

<p>
For each student A who likes a student B where the two are not<br />
friends, find if they have a friend C in common (who can introduce<br />
them!).  For all such trios, return the name and grade of A, B, and C.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = T.ID1),
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = T.ID1),
       (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = T.ID2),
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = T.ID2),
       <span class="org-keyword">name</span>, grade
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> Likes
      <span class="org-keyword">except</span>
      <span class="org-keyword">select</span> * <span class="org-keyword">from</span> Friend) T
     <span class="org-keyword">join</span> Highschooler
<span class="org-keyword">on</span> ID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID2 <span class="org-keyword">from</span> Friend <span class="org-keyword">where</span> ID1 = T.ID1) <span class="org-keyword">and</span>
   ID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID2 <span class="org-keyword">from</span> Friend <span class="org-keyword">where</span> ID1 = T.ID2);
</pre>
</div>

<p>
Find the difference between the number of students in the school and<br />
the number of different first names.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-builtin">count</span>(ID) - <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> <span class="org-keyword">name</span>)
<span class="org-keyword">from</span> Highschooler;
</pre>
</div>

<p>
Find the name and grade of all students who are liked by more than one<br />
other student.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> name2, grade2
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> ID1, name1, grade1, ID2, <span class="org-keyword">name</span> <span class="org-keyword">as</span> name2, grade <span class="org-keyword">as</span> grade2
      <span class="org-keyword">from</span> (<span class="org-keyword">select</span> ID1, <span class="org-keyword">name</span> <span class="org-keyword">as</span> name1, grade <span class="org-keyword">as</span> grade1, ID2
            <span class="org-keyword">from</span> Likes <span class="org-keyword">join</span> Highschooler H <span class="org-keyword">on</span> ID1 = H.ID)
                 <span class="org-keyword">join</span> Highschooler H <span class="org-keyword">on</span> ID2 = H.ID)
<span class="org-keyword">group</span> <span class="org-keyword">by</span> ID2
<span class="org-keyword">having</span> <span class="org-builtin">count</span>(*) &gt; 1;
</pre>
</div>
</div>
</div>
