notes/intro_db.org
*** DONE Social-Network Query [[https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_social_query_extra/][Extras]]
     CLOSED: [2017-06-02 Fri 13:05]
For every situation where student A likes student B, but student B
likes a different student C, return the names and grades of A, B, and
C.

#+BEGIN_SRC sql
select H1.name, H1.grade,
       H2.name, H2.grade,
       H3.name, H3.grade
from Likes R join Likes S
     on R.ID2 = S.ID1 and
        S.ID2 <> R.ID1
     join Highschooler H1
     on R.ID1 = H1.ID
     join Highschooler H2
     on R.ID2 = H2.ID
     join Highschooler H3
     on S.ID2 = H3.ID;
#+END_SRC

Find those students for whom all of their friends are in different
grades from themselves.  Return the students' names and grades.

#+BEGIN_SRC sql
select name, grade
from Highschooler R
where not exists
      (select * from Friend
       where ID1 = R.ID and
       (select grade from Highschooler
        where ID = ID2 and
              grade = R.grade));
#+END_SRC

What is the average number of friends per student? (Your result should
be just one number.)

#+BEGIN_SRC sql
select avg(num)
from (select count(*) as num
      from Friend
      group by ID1);
#+END_SRC

The above code doesn't consider the situation where there exists a
student who has no friend.  The following code handle that situation
correctly.

#+BEGIN_SRC sql
select avg(num)
from (select (select count(*) from Friend
              where ID1 = ID) as num
      from Highschooler);
#+END_SRC

Find the number of students who are either friends with Cassandra or
are friends of friends of Cassandra.  Do not count Cassandra, even
though technically she is a friend of a friend.

#+BEGIN_SRC sql
select count(*)
from Highschooler
where name <> 'Cassandra' and
      exists (select * from Friend R
              where R.ID1 = ID and
                    (R.ID2 in (select ID from Highschooler
                               where name = 'Cassandra') or
                     R.ID2 in (select ID1 from Friend
                               where ID1 = R.ID2 and
                                     ID2 in (select ID from Highschooler
                                             where name = 'Cassandra'))));

select count(*)
from (select ID1, ID2, ID3
      from (select L1.ID1, L1.ID2, L2.ID2 as ID3
            from Friend L1 join Friend L2
            on L1.ID2 = L2.ID1 and
               L2.ID2 <> L1.ID1))
     join Highschooler R on ID1 = R.ID
     join Highschooler S on ID2 = S.ID
     join Highschooler T on ID3 = T.ID
where S.name = 'Cassandra' or T.name = 'Cassandra';
#+END_SRC

Find the name and grade of the student(s) with the greatest number of
friends.

#+BEGIN_SRC sql
select (select name from Highschooler where ID = ID1),
       (select grade from Highschooler where ID = ID1)
from Friend
group by ID1
having count(*) = (select max(num)
                   from (select count(*) as num
                         from Friend
                         group by ID1));
#+END_SRC

*** DONE Movie-Rating [[https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_movie_mod/][Modification]]
     CLOSED: [2017-06-02 Fri 01:20]
Add the reviewer Roger Ebert to your database, with an rID of 209.

#+BEGIN_SRC sql
insert into Reviewer values (209, 'Roger Ebert');
#+END_SRC

Insert 5-star ratings by James Cameron for all movies in the database.
Leave the review date as NULL.

#+BEGIN_SRC sql
insert into Rating
select (select rID from Reviewer where name = 'James Cameron'),
       mID, 5, null
from Movie;
#+END_SRC

For all movies that have an average rating of 4 stars or higher, add
25 to the release year.  (Update the existing tuples; don't insert new
tuples.)

#+BEGIN_SRC sql
update Movie
set year = year + 25
where (select avg(stars) from Rating where mID = Movie.mID) >= 4;
#+END_SRC

Remove all ratings where the movie's year is before 1970 or after
2000, and the rating is fewer than 4 stars.

#+BEGIN_SRC sql
delete from Rating
where stars < 4 and
      ((select year from Movie where mID = Rating.mID) < 1970 or
       (select year from Movie where mID = Rating.mID) > 2000)
#+END_SRC

