notes/intro_db.html

<div id="outline-container-org437dfab" class="outline-4">
<h4 id="org437dfab"><span class="section-number-4">1.2.4</span> <span class="done DONE">DONE</span> Social-Network Query <a href="https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_social_query_extra/">Extras</a></h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
For every situation where student A likes student B, but student B<br />
likes a different student C, return the names and grades of A, B, and<br />
C.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> H1.<span class="org-keyword">name</span>, H1.grade,
       H2.<span class="org-keyword">name</span>, H2.grade,
       H3.<span class="org-keyword">name</span>, H3.grade
<span class="org-keyword">from</span> Likes R <span class="org-keyword">join</span> Likes S
     <span class="org-keyword">on</span> R.ID2 = S.ID1 <span class="org-keyword">and</span>
        S.ID2 &lt;&gt; R.ID1
     <span class="org-keyword">join</span> Highschooler H1
     <span class="org-keyword">on</span> R.ID1 = H1.ID
     <span class="org-keyword">join</span> Highschooler H2
     <span class="org-keyword">on</span> R.ID2 = H2.ID
     <span class="org-keyword">join</span> Highschooler H3
     <span class="org-keyword">on</span> S.ID2 = H3.ID;
</pre>
</div>

<p>
Find those students for whom all of their friends are in different<br />
grades from themselves.  Return the students' names and grades.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-keyword">name</span>, grade
<span class="org-keyword">from</span> Highschooler R
<span class="org-keyword">where</span> <span class="org-keyword">not</span> <span class="org-keyword">exists</span>
      (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> Friend
       <span class="org-keyword">where</span> ID1 = R.ID <span class="org-keyword">and</span>
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler
        <span class="org-keyword">where</span> ID = ID2 <span class="org-keyword">and</span>
              grade = R.grade));
</pre>
</div>

<p>
What is the average number of friends per student? (Your result should<br />
be just one number.)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-builtin">avg</span>(num)
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">as</span> num
      <span class="org-keyword">from</span> Friend
      <span class="org-keyword">group</span> <span class="org-keyword">by</span> ID1);
</pre>
</div>

<p>
The above code doesn't consider the situation where there exists a<br />
student who has no friend.  The following code handle that situation<br />
correctly.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-builtin">avg</span>(num)
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">from</span> Friend
              <span class="org-keyword">where</span> ID1 = ID) <span class="org-keyword">as</span> num
      <span class="org-keyword">from</span> Highschooler);
</pre>
</div>

<p>
Find the number of students who are either friends with Cassandra or<br />
are friends of friends of Cassandra.  Do not count Cassandra, even<br />
though technically she is a friend of a friend.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> <span class="org-builtin">count</span>(*)
<span class="org-keyword">from</span> Highschooler
<span class="org-keyword">where</span> <span class="org-keyword">name</span> &lt;&gt; <span class="org-string">'Cassandra'</span> <span class="org-keyword">and</span>
      <span class="org-keyword">exists</span> (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> Friend R
              <span class="org-keyword">where</span> R.ID1 = ID <span class="org-keyword">and</span>
                    (R.ID2 <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID <span class="org-keyword">from</span> Highschooler
                               <span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Cassandra'</span>) <span class="org-keyword">or</span>
                     R.ID2 <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID1 <span class="org-keyword">from</span> Friend
                               <span class="org-keyword">where</span> ID1 = R.ID2 <span class="org-keyword">and</span>
                                     ID2 <span class="org-keyword">in</span> (<span class="org-keyword">select</span> ID <span class="org-keyword">from</span> Highschooler
                                             <span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'Cassandra'</span>))));

<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*)
<span class="org-keyword">from</span> (<span class="org-keyword">select</span> ID1, ID2, ID3
      <span class="org-keyword">from</span> (<span class="org-keyword">select</span> L1.ID1, L1.ID2, L2.ID2 <span class="org-keyword">as</span> ID3
            <span class="org-keyword">from</span> Friend L1 <span class="org-keyword">join</span> Friend L2
            <span class="org-keyword">on</span> L1.ID2 = L2.ID1 <span class="org-keyword">and</span>
               L2.ID2 &lt;&gt; L1.ID1))
     <span class="org-keyword">join</span> Highschooler R <span class="org-keyword">on</span> ID1 = R.ID
     <span class="org-keyword">join</span> Highschooler S <span class="org-keyword">on</span> ID2 = S.ID
     <span class="org-keyword">join</span> Highschooler T <span class="org-keyword">on</span> ID3 = T.ID
<span class="org-keyword">where</span> S.<span class="org-keyword">name</span> = <span class="org-string">'Cassandra'</span> <span class="org-keyword">or</span> T.<span class="org-keyword">name</span> = <span class="org-string">'Cassandra'</span>;
</pre>
</div>

<p>
Find the name and grade of the student(s) with the greatest number of<br />
friends.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> (<span class="org-keyword">select</span> <span class="org-keyword">name</span> <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID1),
       (<span class="org-keyword">select</span> grade <span class="org-keyword">from</span> Highschooler <span class="org-keyword">where</span> ID = ID1)
<span class="org-keyword">from</span> Friend
<span class="org-keyword">group</span> <span class="org-keyword">by</span> ID1
<span class="org-keyword">having</span> <span class="org-builtin">count</span>(*) = (<span class="org-keyword">select</span> <span class="org-builtin">max</span>(num)
                   <span class="org-keyword">from</span> (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">as</span> num
                         <span class="org-keyword">from</span> Friend
                         <span class="org-keyword">group</span> <span class="org-keyword">by</span> ID1));
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd046bbe" class="outline-4">
<h4 id="orgd046bbe"><span class="section-number-4">1.2.5</span> <span class="done DONE">DONE</span> Movie-Rating <a href="https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_movie_mod/">Modification</a></h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Add the reviewer Roger Ebert to your database, with an rID of 209.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Reviewer <span class="org-keyword">values</span> (209, <span class="org-string">'Roger Ebert'</span>);
</pre>
</div>

<p>
Insert 5-star ratings by James Cameron for all movies in the database.<br />
Leave the review date as NULL.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Rating
<span class="org-keyword">select</span> (<span class="org-keyword">select</span> rID <span class="org-keyword">from</span> Reviewer <span class="org-keyword">where</span> <span class="org-keyword">name</span> = <span class="org-string">'James Cameron'</span>),
       mID, 5, <span class="org-keyword">null</span>
<span class="org-keyword">from</span> Movie;
</pre>
</div>

<p>
For all movies that have an average rating of 4 stars or higher, add<br />
25 to the release year.  (Update the existing tuples; don't insert new<br />
tuples.)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> Movie
<span class="org-keyword">set</span> <span class="org-keyword">year</span> = <span class="org-keyword">year</span> + 25
<span class="org-keyword">where</span> (<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(stars) <span class="org-keyword">from</span> Rating <span class="org-keyword">where</span> mID = Movie.mID) &gt;= 4;
</pre>
</div>

<p>
Remove all ratings where the movie's year is before 1970 or after<br />
2000, and the rating is fewer than 4 stars.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">delete</span> <span class="org-keyword">from</span> Rating
<span class="org-keyword">where</span> stars &lt; 4 <span class="org-keyword">and</span>
      ((<span class="org-keyword">select</span> <span class="org-keyword">year</span> <span class="org-keyword">from</span> Movie <span class="org-keyword">where</span> mID = Rating.mID) &lt; 1970 <span class="org-keyword">or</span>
       (<span class="org-keyword">select</span> <span class="org-keyword">year</span> <span class="org-keyword">from</span> Movie <span class="org-keyword">where</span> mID = Rating.mID) &gt; 2000)
</pre>
</div>
</div>
</div>
