notes/intro_db.org
*** DONE Social-Network [[https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_social_mod/][Modification]]
     CLOSED: [2017-06-02 Fri 02:22]
It's time for the seniors to graduate.  Remove all 12th graders from
Highschooler.

#+BEGIN_SRC sql
delete from Highschooler
where grade = 12;
#+END_SRC

If two students A and B are friends, and A likes B but not vice-versa,
remove the Likes tuple.

#+BEGIN_SRC sql
delete from Likes
where exists (select *
              from (select * from Friend
                    except
                    select ID2, ID1 from Likes
                    intersect
                    select * from Likes)
              where ID1 = Likes.ID1 and ID2 = Likes.ID2);
#+END_SRC

For all cases where A is friends with B, and B is friends with C, add
a new friendship for the pair A and C.  Do not add duplicate
friendships, friendships that already exist, or friendships with
oneself.  (This one is a bit challenging; congratulations if you get
it right.)

#+BEGIN_SRC sql
insert into Friend
select distinct R.ID1, S.ID2
from Friend R join Friend S
on R.ID2 = S.ID1 and S.ID2 <> R.ID1 and
   not exists (select * from Friend
             where ID1 = R.ID1 and
                   ID2 = S.ID2);
#+END_SRC


* DONE [[https://lagunita.stanford.edu/courses/DB/XPath/SelfPaced/courseware/ch-querying_xml/][XPath and XQuery]] mini-course
  CLOSED: [2017-06-26 Mon 07:48]
  :PROPERTIES:
  :VISIBILITY: FOLDED
  :END:
** DONE Lecture videos
   CLOSED: <2017-06-24 Sat>
*** DONE XPath Introduction
    CLOSED: [2017-06-03 Sat 00:50]
Not nearly as mature as Querying Relational
XPath - path expressions + conditions
XSLT - XPath + transformations, output
XQuery - XPath + full-featured Q.L.

Think of XML as a tree

Basic Constructs
/ root element and separator
{element name} or *
@{attribute name}
// any descendants including self
[condition] e.g. [@price < 50]
[number] nth sub-element

Built-in functions (lots of them)
contains(s1, s2)
name()

Navigation "axes" (13 of them)
parent::
following-sibling::
descendants:: (does not match self, cf. //)
self::

XPath queries operate on and return /sequence/ of elements
Sometimes result can be expressed as XML, but not always

*** DONE XPath Demo
    CLOSED: [2017-06-05 Mon 00:16]
Get the titles of books in the bookstore where the price is lower
than 90 and Jeffrey Widom is an author.

#+BEGIN_SRC xpath
doc("BookstoreQ.xml")/Bookstore/Book[@Price < 90 and
        Authors/Author[Last_name = "Widom" and
        First_Name="Jeffrey"]]/Title
#+END_SRC

Get the titles of books where "Ullman" is an author and "Widom" is not
an author.  *The below code doesn't work since there is no way using
XPath language alone to achieve the query.*

#+BEGIN_SRC xpath
doc("BookstoreQ.xml")/Bookstore/Book[
        Authors/Author/Last_Name = "Ullman" and
        Authors/Author/Last_Name != "Widom"]/Title
#+END_SRC

Get all magazines where there's a book with the same title.  (An
example of /self-join/ in XPath)

#+BEGIN_SRC xpath
doc("BookstoreQ.xml")//Magazine[
        Title = doc("BookstoreQ.xml")//Book/Title]
#+END_SRC

The equal sign in the above code is implicitly existentially
quantified.  There is a lot of implicit existential quantification in
XPath and XQuery.

All Elements whose parent is not "Bookstore" or "Book".

#+BEGIN_SRC xpath
doc("BookstoreQ.xml")/Bookstore//*[
        name(parent::*) != "Bookstore"
        and name(parent::*) != "Book"]
#+END_SRC

The above code use the navigation access =parent::=.

All books and magazines with non-unique titles.

#+BEGIN_SRC xpath
doc("BookstoreQ.xml")/Bookstore/(Book|Magazine)[
        Title = following-sibling::*/Title
        or Title = preceding-sibling::*/Title]
#+END_SRC

Books where every author's first name includes "J".  This query will
need universal quantification.

#+BEGIN_SRC xpath
doc("BookstoreQ.xml")//Book[
        count(Authors/Author[contains(First_Name, "J")]) =
        count(Authors/Author/First_Name)]
#+END_SRC

The built-in function =count= is used to simulate universal
quantification.  This technique can solve previously undoable query.

Titles of books where "Ullman" is an author and "Widom" is not
an author.

#+BEGIN_SRC xpath
doc("BookstoreQ.xml")/Bookstore/Book[
        Authors/Author/Last_Name = "Ullman"
        and count(Authors/Author[Last_Name = "Widom"]) = 0]/Title
#+END_SRC

*** DONE XQuery Introduction
    CLOSED: [2017-06-16 Fri 23:16]

1. XQuery is a expression language (compositional)
2. Each expression operates on and returns sequence of elements
3. XPath is one type of expression

XQuery: FLWOR expression

#+BEGIN_SRC xquery
For $var in expr
Let $var := expr
Where condition
Order By expr
Return expr
#+END_SRC

Mixing queries and XMl

#+BEGIN_SRC xquery
<Result> { ...query goes here... } </Result>
#+END_SRC

