notes/intro_db.html

<div id="outline-container-org6753299" class="outline-4">
<h4 id="org6753299"><span class="section-number-4">1.2.6</span> <span class="done DONE">DONE</span> Social-Network <a href="https://lagunita.stanford.edu/courses/DB/SQL/SelfPaced/courseware/ch-sql/seq-exercise-sql_social_mod/">Modification</a></h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
It's time for the seniors to graduate.  Remove all 12th graders from<br />
Highschooler.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">delete</span> <span class="org-keyword">from</span> Highschooler
<span class="org-keyword">where</span> grade = 12;
</pre>
</div>

<p>
If two students A and B are friends, and A likes B but not vice-versa,<br />
remove the Likes tuple.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">delete</span> <span class="org-keyword">from</span> Likes
<span class="org-keyword">where</span> <span class="org-keyword">exists</span> (<span class="org-keyword">select</span> *
              <span class="org-keyword">from</span> (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> Friend
                    <span class="org-keyword">except</span>
                    <span class="org-keyword">select</span> ID2, ID1 <span class="org-keyword">from</span> Likes
                    <span class="org-keyword">intersect</span>
                    <span class="org-keyword">select</span> * <span class="org-keyword">from</span> Likes)
              <span class="org-keyword">where</span> ID1 = Likes.ID1 <span class="org-keyword">and</span> ID2 = Likes.ID2);
</pre>
</div>

<p>
For all cases where A is friends with B, and B is friends with C, add<br />
a new friendship for the pair A and C.  Do not add duplicate<br />
friendships, friendships that already exist, or friendships with<br />
oneself.  (This one is a bit challenging; congratulations if you get<br />
it right.)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Friend
<span class="org-keyword">select</span> <span class="org-keyword">distinct</span> R.ID1, S.ID2
<span class="org-keyword">from</span> Friend R <span class="org-keyword">join</span> Friend S
<span class="org-keyword">on</span> R.ID2 = S.ID1 <span class="org-keyword">and</span> S.ID2 &lt;&gt; R.ID1 <span class="org-keyword">and</span>
   <span class="org-keyword">not</span> <span class="org-keyword">exists</span> (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> Friend
             <span class="org-keyword">where</span> ID1 = R.ID1 <span class="org-keyword">and</span>
                   ID2 = S.ID2);
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgb382ec8" class="outline-2">
<h2 id="orgb382ec8"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> <a href="https://lagunita.stanford.edu/courses/DB/XPath/SelfPaced/courseware/ch-querying_xml/">XPath and XQuery</a> mini-course</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcee6e23" class="outline-3">
<h3 id="orgcee6e23"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> Lecture videos</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orga1aef34" class="outline-4">
<h4 id="orga1aef34"><span class="section-number-4">2.1.1</span> <span class="done DONE">DONE</span> XPath Introduction</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Not nearly as mature as Querying Relational<br />
XPath - path expressions + conditions<br />
XSLT - XPath + transformations, output<br />
XQuery - XPath + full-featured Q.L.<br />
</p>

<p>
Think of XML as a tree<br />
</p>

<p>
Basic Constructs<br />
/ root element and separator<br />
{element name} or *<br />
@{attribute name}<br />
// any descendants including self<br />
[condition] e.g. [@price &lt; 50]<br />
[number] nth sub-element<br />
</p>

<p>
Built-in functions (lots of them)<br />
contains(s1, s2)<br />
name()<br />
</p>

<p>
Navigation "axes" (13 of them)<br />
parent::<br />
following-sibling::<br />
descendants:: (does not match self, cf. //)<br />
self::<br />
</p>

<p>
XPath queries operate on and return <i>sequence</i> of elements<br />
Sometimes result can be expressed as XML, but not always<br />
</p>
</div>
</div>

<div id="outline-container-org2fb9b89" class="outline-4">
<h4 id="org2fb9b89"><span class="section-number-4">2.1.2</span> <span class="done DONE">DONE</span> XPath Demo</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Get the titles of books in the bookstore where the price is lower<br />
than 90 and Jeffrey Widom is an author.<br />
</p>

<div class="org-src-container">
<pre class="src src-xpath">doc("BookstoreQ.xml")/Bookstore/Book[@Price &lt; 90 and
        Authors/Author[Last_name = "Widom" and
        First_Name="Jeffrey"]]/Title
</pre>
</div>

<p>
Get the titles of books where "Ullman" is an author and "Widom" is not<br />
an author.  <b>The below code doesn't work since there is no way using<br />
XPath language alone to achieve the query.</b><br />
</p>

<div class="org-src-container">
<pre class="src src-xpath">doc("BookstoreQ.xml")/Bookstore/Book[
        Authors/Author/Last_Name = "Ullman" and
        Authors/Author/Last_Name != "Widom"]/Title
</pre>
</div>

<p>
Get all magazines where there's a book with the same title.  (An<br />
example of <i>self-join</i> in XPath)<br />
</p>

<div class="org-src-container">
<pre class="src src-xpath">doc("BookstoreQ.xml")//Magazine[
        Title = doc("BookstoreQ.xml")//Book/Title]
</pre>
</div>

<p>
The equal sign in the above code is implicitly existentially<br />
quantified.  There is a lot of implicit existential quantification in<br />
XPath and XQuery.<br />
</p>

<p>
All Elements whose parent is not "Bookstore" or "Book".<br />
</p>

<div class="org-src-container">
<pre class="src src-xpath">doc("BookstoreQ.xml")/Bookstore//*[
        name(parent::*) != "Bookstore"
        and name(parent::*) != "Book"]
</pre>
</div>

<p>
The above code use the navigation access <code>parent::</code>.<br />
</p>

<p>
All books and magazines with non-unique titles.<br />
</p>

<div class="org-src-container">
<pre class="src src-xpath">doc("BookstoreQ.xml")/Bookstore/(Book|Magazine)[
        Title = following-sibling::*/Title
        or Title = preceding-sibling::*/Title]
</pre>
</div>

<p>
Books where every author's first name includes "J".  This query will<br />
need universal quantification.<br />
</p>

<div class="org-src-container">
<pre class="src src-xpath">doc("BookstoreQ.xml")//Book[
        count(Authors/Author[contains(First_Name, "J")]) =
        count(Authors/Author/First_Name)]
</pre>
</div>

<p>
The built-in function <code>count</code> is used to simulate universal<br />
quantification.  This technique can solve previously undoable query.<br />
</p>

<p>
Titles of books where "Ullman" is an author and "Widom" is not<br />
an author.<br />
</p>

<div class="org-src-container">
<pre class="src src-xpath">doc("BookstoreQ.xml")/Bookstore/Book[
        Authors/Author/Last_Name = "Ullman"
        and count(Authors/Author[Last_Name = "Widom"]) = 0]/Title
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b555f3" class="outline-4">
<h4 id="org0b555f3"><span class="section-number-4">2.1.3</span> <span class="done DONE">DONE</span> XQuery Introduction</h4>
<div class="outline-text-4" id="text-2-1-3">
<ol class="org-ol">
<li>XQuery is a expression language (compositional)<br /></li>
<li>Each expression operates on and returns sequence of elements<br /></li>
<li>XPath is one type of expression<br /></li>
</ol>

<p>
XQuery: FLWOR expression<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">For $var in expr
Let $var := expr
Where condition
Order By expr
Return expr
</pre>
</div>

<p>
Mixing queries and XMl<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">&lt;Result&gt; { ...query goes here... } &lt;/Result&gt;
</pre>
</div>
</div>
</div>
