notes/intro_db.org
*** DONE XQuery Demo
    CLOSED: [2017-06-24 Sat 16:03]

#+BEGIN_SRC xquery
for $b in doc("BookstoreQ.xml")/Bookstore/Book
where $b/@Price < 90
  and $b/Authors/Author/Last_Name = "Ullman"
return $b/Title
#+END_SRC

#+BEGIN_SRC xquery
for $b in doc("BookstoreQ.xml")/Bookstore/Book
where some $fn in $b/Authors/Author/First_Name
        satisfies contains($b/Title, $fn)
return <Book>
         { $b/Title }
         { $b/Authors/Author/First_Name }
       </Book>
#+END_SRC

#+BEGIN_SRC xquery
for $b in doc("BookstoreQ.xml")/Bookstore/Book
where some $fn in $b/Authors/Author/First_Name
        satisfies contains($b/Title, $fn)
return <Book>
         { $b/Title }
         { for $fn in $b/Authors/Authors/Author/First_Name
           where contains($b/Title, $fn) return $fn }
       </Book>
#+END_SRC

#+BEGIN_SRC xquery
<Average>
  { let $plist := doc("BookstoreQ.xml")/Bookstore/Book/@Price
    return avg($plist) }
</Average>
#+END_SRC

#+BEGIN_SRC xquery
let $a := avg(doc("BookstoreQ.xml")/Bookstore/Book/@Price)
for $b in doc("BookstoreQ.xml")/Bookstore/Book
where $b/@Price < $a
return <Book>
          { $b/Title }
          <Price> { $b/data(@Price) } </Price>
       </Book>
#+END_SRC

#+BEGIN_SRC xquery
for $b in doc("BookstoreQ.xml")/Bookstore/Book
order by xs:int($b/@Price)
return <Book>
          { $b/Title }
          <Price> { $b/data(@Price) } </Price>
       </Book>
#+END_SRC

#+BEGIN_SRC xquery
for $n in distinct-values(doc("BookstoreQ.xml")//Last_Name)
return <Last_Name> { $n } </Last_Name>
#+END_SRC

#+BEGIN_SRC xquery
for $b in doc("BookstoreQ.xml")/Bookstore/Book
where every $fn in $b/Authors/Author/First_Name
        satisfies contains($fn, "J")
return $b
#+END_SRC

#+BEGIN_SRC xquery
for $b1 in doc("BookstoreQ.xml")/Bookstore/Book
for $b2 in doc("BookstoreQ.xml")/Bookstore/Book
where $b1/Authors/Author/Last_Name = $b2/Authors/Author/Last_Name
      and $b1/Title < $b2/Title
return
    <BookPair>
        <Title1> { data($b1/Title) } </Title1>
        <Title2> { data($b2/Title) } </Title2>
    </BookPair>
#+END_SRC

Again, implicitly existential quantification.

#+BEGIN_SRC xquery
<InvertedBookstore>
    { for $ln in distinct-values(doc("BookstoreQ.xml")//Author/Last_Name)
      for $fn in distinct-values(doc("BookstoreQ.xml")//Author[
                                      Last_name=$ln]/First_Name)
      return
          <Author>
              <First_Name> { $fn } </First_name>
              <Last_Name { $ln } </Last_Name>
              { for $b in doc("BookstoreQ.xml")/Bookstore/Book[
                               Authors/Atuhor/Last_Name=$ln]
                return <Book>
                          { $b/@ISBN } { $b/@Price } { $/@Edition }
                          { $b/Title } { $b/Remark }
                       </Book>
          </Author> }
</InvertedBookstore>
#+END_SRC

** DONE Exercises
   CLOSED: [2017-06-26 Mon 07:48]
*** DONE Course-Catalog XPath and XQuery Exercises
    CLOSED: [2017-06-24 Sat 19:03]

Return all Title elements (of both departments and courses).

#+BEGIN_SRC xquery
doc("courses.xml")//Title
#+END_SRC

Return last names of all department chairs.

#+BEGIN_SRC xquery
doc("courses.xml")//Department/Chair//Last_Name
#+END_SRC

Return titles of courses with enrollment greater than 500.

#+BEGIN_SRC xquery
doc("courses.xml")//Course[@Enrollment > 500]/Title
#+END_SRC

Return titles of departments that have some course that takes "CS106B"
as a prerequisite.

#+BEGIN_SRC xquery
doc("courses.xml")//Department[Course/Prerequisites[Prereq = "CS106B"]]/Title
#+END_SRC

Return last names of all professors or lecturers who use a middle
initial.  Don't worry about eliminating duplicates.

#+BEGIN_SRC xquery
doc("courses.xml")//(Lecturer|Professor)[Middle_Initial]/Last_Name
#+END_SRC

Return the count of courses that have a cross-listed course (i.e.,
that have "Cross-listed" in their description).

#+BEGIN_SRC xquery
count(doc("courses.xml")//Course[contains(Description, "Cross-listed")])
#+END_SRC

Return the average enrollment of all courses in the CS department.

#+BEGIN_SRC xquery
avg(doc("courses.xml")//Department[@Code="CS"]/Course/@Enrollment)
#+END_SRC

Return last names of instructors teaching at least one course that has
"system" in its description and enrollment greater than 100.

#+BEGIN_SRC xquery
doc("courses.xml")//Course[@Enrollment > 100 and contains(Description, "system")]/Instructors//Last_Name
#+END_SRC

Return the title of the course with the largest enrollment.

#+BEGIN_SRC xquery
for $c in doc("courses.xml")//Course
where every $e in doc("courses.xml")//Course/@Enrollment
        satisfies xs:int($e) <= xs:int($c/@Enrollment)
return $c/Title
#+END_SRC

Only one of the function call =xs:int= shown above is necessary since
the other operand will go through type promotion.

