notes/intro_db.html

<div id="outline-container-org40fe4b7" class="outline-4">
<h4 id="org40fe4b7"><span class="section-number-4">2.1.4</span> <span class="done DONE">DONE</span> XQuery Demo</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-xquery">for $b in doc("BookstoreQ.xml")/Bookstore/Book
where $b/@Price &lt; 90
  and $b/Authors/Author/Last_Name = "Ullman"
return $b/Title
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $b in doc("BookstoreQ.xml")/Bookstore/Book
where some $fn in $b/Authors/Author/First_Name
        satisfies contains($b/Title, $fn)
return &lt;Book&gt;
         { $b/Title }
         { $b/Authors/Author/First_Name }
       &lt;/Book&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $b in doc("BookstoreQ.xml")/Bookstore/Book
where some $fn in $b/Authors/Author/First_Name
        satisfies contains($b/Title, $fn)
return &lt;Book&gt;
         { $b/Title }
         { for $fn in $b/Authors/Authors/Author/First_Name
           where contains($b/Title, $fn) return $fn }
       &lt;/Book&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">&lt;Average&gt;
  { let $plist := doc("BookstoreQ.xml")/Bookstore/Book/@Price
    return avg($plist) }
&lt;/Average&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">let $a := avg(doc("BookstoreQ.xml")/Bookstore/Book/@Price)
for $b in doc("BookstoreQ.xml")/Bookstore/Book
where $b/@Price &lt; $a
return &lt;Book&gt;
          { $b/Title }
          &lt;Price&gt; { $b/data(@Price) } &lt;/Price&gt;
       &lt;/Book&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $b in doc("BookstoreQ.xml")/Bookstore/Book
order by xs:int($b/@Price)
return &lt;Book&gt;
          { $b/Title }
          &lt;Price&gt; { $b/data(@Price) } &lt;/Price&gt;
       &lt;/Book&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $n in distinct-values(doc("BookstoreQ.xml")//Last_Name)
return &lt;Last_Name&gt; { $n } &lt;/Last_Name&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $b in doc("BookstoreQ.xml")/Bookstore/Book
where every $fn in $b/Authors/Author/First_Name
        satisfies contains($fn, "J")
return $b
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $b1 in doc("BookstoreQ.xml")/Bookstore/Book
for $b2 in doc("BookstoreQ.xml")/Bookstore/Book
where $b1/Authors/Author/Last_Name = $b2/Authors/Author/Last_Name
      and $b1/Title &lt; $b2/Title
return
    &lt;BookPair&gt;
        &lt;Title1&gt; { data($b1/Title) } &lt;/Title1&gt;
        &lt;Title2&gt; { data($b2/Title) } &lt;/Title2&gt;
    &lt;/BookPair&gt;
</pre>
</div>

<p>
Again, implicitly existential quantification.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">&lt;InvertedBookstore&gt;
    { for $ln in distinct-values(doc("BookstoreQ.xml")//Author/Last_Name)
      for $fn in distinct-values(doc("BookstoreQ.xml")//Author[
                                      Last_name=$ln]/First_Name)
      return
          &lt;Author&gt;
              &lt;First_Name&gt; { $fn } &lt;/First_name&gt;
              &lt;Last_Name { $ln } &lt;/Last_Name&gt;
              { for $b in doc("BookstoreQ.xml")/Bookstore/Book[
                               Authors/Atuhor/Last_Name=$ln]
                return &lt;Book&gt;
                          { $b/@ISBN } { $b/@Price } { $/@Edition }
                          { $b/Title } { $b/Remark }
                       &lt;/Book&gt;
          &lt;/Author&gt; }
&lt;/InvertedBookstore&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7516b91" class="outline-3">
<h3 id="org7516b91"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> Exercises</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgf3708e2" class="outline-4">
<h4 id="orgf3708e2"><span class="section-number-4">2.2.1</span> <span class="done DONE">DONE</span> Course-Catalog XPath and XQuery Exercises</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Return all Title elements (of both departments and courses).<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">doc("courses.xml")//Title
</pre>
</div>

<p>
Return last names of all department chairs.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">doc("courses.xml")//Department/Chair//Last_Name
</pre>
</div>

<p>
Return titles of courses with enrollment greater than 500.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">doc("courses.xml")//Course[@Enrollment &gt; 500]/Title
</pre>
</div>

<p>
Return titles of departments that have some course that takes "CS106B"<br />
as a prerequisite.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">doc("courses.xml")//Department[Course/Prerequisites[Prereq = "CS106B"]]/Title
</pre>
</div>

<p>
Return last names of all professors or lecturers who use a middle<br />
initial.  Don't worry about eliminating duplicates.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">doc("courses.xml")//(Lecturer|Professor)[Middle_Initial]/Last_Name
</pre>
</div>

<p>
Return the count of courses that have a cross-listed course (i.e.,<br />
that have "Cross-listed" in their description).<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">count(doc("courses.xml")//Course[contains(Description, "Cross-listed")])
</pre>
</div>

<p>
Return the average enrollment of all courses in the CS department.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">avg(doc("courses.xml")//Department[@Code="CS"]/Course/@Enrollment)
</pre>
</div>

<p>
Return last names of instructors teaching at least one course that has<br />
"system" in its description and enrollment greater than 100.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">doc("courses.xml")//Course[@Enrollment &gt; 100 and contains(Description, "system")]/Instructors//Last_Name
</pre>
</div>

<p>
Return the title of the course with the largest enrollment.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("courses.xml")//Course
where every $e in doc("courses.xml")//Course/@Enrollment
        satisfies xs:int($e) &lt;= xs:int($c/@Enrollment)
return $c/Title
</pre>
</div>

<p>
Only one of the function call <code>xs:int</code> shown above is necessary since<br />
the other operand will go through type promotion.<br />
</p>
</div>
</div>
