notes/intro_db.org
*** DONE Course-Catalog XPath and XQuery Exercises Extras
    CLOSED: [2017-06-25 Sun 19:19]

Return the course number of the course that is cross-listed as "LING180".

#+BEGIN_SRC xquery
data(doc("courses.xml")//Course[contains(Description, "Cross-listed as LING180")]/@Number)
#+END_SRC

Return course numbers of courses that have the same title as some
other course.  (Hint: You might want to use the "preceding" and
"following" navigation axes for this query, which were not covered in
the video or our demo script; they match any preceding or following
node, not just siblings.)

#+BEGIN_SRC xquery
for $c1 in doc("courses.xml")//Course
where some $c2 in doc("courses.xml")//Course
      satisfies $c1 != $c2
                and $c1/Title = $c2/Title
return data($c1/@Number)
#+END_SRC

Return course numbers of courses taught by an instructor with first
name "Daphne" or "Julie".

#+BEGIN_SRC xquery
data(doc("courses.xml")//Course[Instructors//First_Name = ("Daphne", "Julie")]/@Number)
#+END_SRC

Return the number (count) of courses that have no lecturers as
instructors.

#+BEGIN_SRC xquery
count(doc("courses.xml")//Course[not(Instructors[Lecturer])])
#+END_SRC

Return titles of courses taught by the chair of a department.  For
this question, you may assume that all professors have distinct last
names.

#+BEGIN_SRC xquery
doc("courses.xml")//Course[
    Instructors/Professor/Last_Name =
        doc("courses.xml")//Department/Chair/Professor/Last_Name
]/Title
#+END_SRC

#+BEGIN_SRC xquery
for $c in doc("courses.xml")//Course
where $c/Instructors/(Professor|Lecturer)/Last_Name
          = doc("courses.xml")//Department/Chair/(Professor|Lecturer)/Last_Name
return $c/Title
#+END_SRC

#+BEGIN_SRC xquery
for $c in doc("courses.xml")//Course
where some $t1 in $c/Instructors/(Professor|Lecturer)
      satisfies some $t2 in
                doc("courses.xml")//Department/Chair/(Professor|Lecturer)
                satisfies deep-equal($t1/*, $t2/*)
return $c/Title
#+END_SRC

Return titles of courses that have both a lecturer and a professor as
instructors.  Return each title only once.

#+BEGIN_SRC xquery
doc("courses.xml")//Course[Instructors/Lecturer and Instructors/Professor]/Title
#+END_SRC

Return titles of courses taught by a professor with the last name "Ng"
but not by a professor with the last name "Thrun".

#+BEGIN_SRC xquery
for $c in doc("courses.xml")//Course[Instructors/Professor/Last_Name = "Ng"]
where every $ln in $c/Instructors/Professor/Last_Name
      satisfies $ln != "Thrun"
return $c/Title
#+END_SRC

#+BEGIN_SRC xquery
doc("courses.xml")//Course[Instructors[
        Professor/Last_Name = "Ng" and
        count(Professor[Last_Name = "Thrun"]) = 0]]/Title
#+END_SRC

Return course numbers of courses that have a course taught by Eric
Roberts as a prerequisite.

#+BEGIN_SRC xquery
for $c in doc("courses.xml")//Course
where some $p in $c/Prerequisites/Prereq
      satisfies $p = data(
          doc("courses.xml")//Course[
              Instructors/(Professor|Lecturer)[
                  First_Name = "Eric" and
                  Last_Name = "Roberts"]]/@Number)
return data($c/@Number)
#+END_SRC

Create a summary of CS classes: List all CS department courses in
order of enrollment.  For each course include only its Enrollment (as
an attribute) and its Title (as a subelement).

#+BEGIN_SRC xquery
<Summary>
    { for $c in doc("courses.xml")//Department[@Code="CS"]/Course
      order by xs:int($c/@Enrollment)
      return <Course>
                 { $c/@Enrollment }
                 { $c/Title }
             </Course> }
</Summary>
#+END_SRC

Return a "Professors" element that contains as subelements a listing
of all professors in all departments, sorted by last name with each
professor appearing once.  The "Professor" subelements should have the
same structure as in the original data.  For this question, you may
assume that all professors have distinct last names.  Watch out -- the
presence/absence of middle initials may require some special handling.
(This problem is quite challenging; congratulations if you get it
right.)

#+BEGIN_SRC xquery
<Professors>
    { for $ln in distinct-values(doc("courses.xml")//Professor/Last_Name)
      order by $ln
      return (doc("courses.xml")//Professor[Last_Name=$ln])[1] }
</Professors>
#+END_SRC

Expanding on the previous question, create an inverted course listing:
Return an "Inverted_Course_Catalog" element that contains as
subelements professors together with the courses they teach, sorted by
last name.  You may still assume that all professors have distinct last
names.  The "Professor" subelements should have the same structure as
in the original data, with an additional single "Courses" subelement
under Professor, containing a further "Course" subelement for each
course number taught by that professor.  Professors who do not teach
any courses should have no Courses subelement at all.  (This problem is
very challenging; extra congratulations if you get it right.)

#+BEGIN_SRC xquery
<Inverted_Course_Catalog>
    { for $ln in distinct-values(doc("courses.xml")//Professor/Last_Name)
      let $prof := (doc("courses.xml")//Professor[Last_Name=$ln])[1]
      order by $ln
      return <Professor>
                 { $prof/First_Name } { $prof/Middle_Initial }
                 { $prof/Last_Name }
                 { let $cs :=
                       <Courses>
                           { for $c in doc("courses.xml")//Course[
                                 Instructors/Professor/Last_Name = $ln]
                             return <Course>
                                        { data($c/@Number) }
                                    </Course> }
                       </Courses>
                   return $cs[Course] }
             </Professor>}
</Inverted_Course_Catalog>
#+END_SRC

