notes/intro_db.html

<div id="outline-container-org97ee342" class="outline-4">
<h4 id="org97ee342"><span class="section-number-4">2.2.2</span> <span class="done DONE">DONE</span> Course-Catalog XPath and XQuery Exercises Extras</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Return the course number of the course that is cross-listed as "LING180".<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("courses.xml")//Course[contains(Description, "Cross-listed as LING180")]/@Number)
</pre>
</div>

<p>
Return course numbers of courses that have the same title as some<br />
other course.  (Hint: You might want to use the "preceding" and<br />
"following" navigation axes for this query, which were not covered in<br />
the video or our demo script; they match any preceding or following<br />
node, not just siblings.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">for $c1 in doc("courses.xml")//Course
where some $c2 in doc("courses.xml")//Course
      satisfies $c1 != $c2
                and $c1/Title = $c2/Title
return data($c1/@Number)
</pre>
</div>

<p>
Return course numbers of courses taught by an instructor with first<br />
name "Daphne" or "Julie".<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("courses.xml")//Course[Instructors//First_Name = ("Daphne", "Julie")]/@Number)
</pre>
</div>

<p>
Return the number (count) of courses that have no lecturers as<br />
instructors.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">count(doc("courses.xml")//Course[not(Instructors[Lecturer])])
</pre>
</div>

<p>
Return titles of courses taught by the chair of a department.  For<br />
this question, you may assume that all professors have distinct last<br />
names.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">doc("courses.xml")//Course[
    Instructors/Professor/Last_Name =
        doc("courses.xml")//Department/Chair/Professor/Last_Name
]/Title
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("courses.xml")//Course
where $c/Instructors/(Professor|Lecturer)/Last_Name
          = doc("courses.xml")//Department/Chair/(Professor|Lecturer)/Last_Name
return $c/Title
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("courses.xml")//Course
where some $t1 in $c/Instructors/(Professor|Lecturer)
      satisfies some $t2 in
                doc("courses.xml")//Department/Chair/(Professor|Lecturer)
                satisfies deep-equal($t1/*, $t2/*)
return $c/Title
</pre>
</div>

<p>
Return titles of courses that have both a lecturer and a professor as<br />
instructors.  Return each title only once.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">doc("courses.xml")//Course[Instructors/Lecturer and Instructors/Professor]/Title
</pre>
</div>

<p>
Return titles of courses taught by a professor with the last name "Ng"<br />
but not by a professor with the last name "Thrun".<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("courses.xml")//Course[Instructors/Professor/Last_Name = "Ng"]
where every $ln in $c/Instructors/Professor/Last_Name
      satisfies $ln != "Thrun"
return $c/Title
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">doc("courses.xml")//Course[Instructors[
        Professor/Last_Name = "Ng" and
        count(Professor[Last_Name = "Thrun"]) = 0]]/Title
</pre>
</div>

<p>
Return course numbers of courses that have a course taught by Eric<br />
Roberts as a prerequisite.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("courses.xml")//Course
where some $p in $c/Prerequisites/Prereq
      satisfies $p = data(
          doc("courses.xml")//Course[
              Instructors/(Professor|Lecturer)[
                  First_Name = "Eric" and
                  Last_Name = "Roberts"]]/@Number)
return data($c/@Number)
</pre>
</div>

<p>
Create a summary of CS classes: List all CS department courses in<br />
order of enrollment.  For each course include only its Enrollment (as<br />
an attribute) and its Title (as a subelement).<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">&lt;Summary&gt;
    { for $c in doc("courses.xml")//Department[@Code="CS"]/Course
      order by xs:int($c/@Enrollment)
      return &lt;Course&gt;
                 { $c/@Enrollment }
                 { $c/Title }
             &lt;/Course&gt; }
&lt;/Summary&gt;
</pre>
</div>

<p>
Return a "Professors" element that contains as subelements a listing<br />
of all professors in all departments, sorted by last name with each<br />
professor appearing once.  The "Professor" subelements should have the<br />
same structure as in the original data.  For this question, you may<br />
assume that all professors have distinct last names.  Watch out &#x2013; the<br />
presence/absence of middle initials may require some special handling.<br />
(This problem is quite challenging; congratulations if you get it<br />
right.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">&lt;Professors&gt;
    { for $ln in distinct-values(doc("courses.xml")//Professor/Last_Name)
      order by $ln
      return (doc("courses.xml")//Professor[Last_Name=$ln])[1] }
&lt;/Professors&gt;
</pre>
</div>

<p>
Expanding on the previous question, create an inverted course listing:<br />
Return an "Inverted_Course_Catalog" element that contains as<br />
subelements professors together with the courses they teach, sorted by<br />
last name.  You may still assume that all professors have distinct last<br />
names.  The "Professor" subelements should have the same structure as<br />
in the original data, with an additional single "Courses" subelement<br />
under Professor, containing a further "Course" subelement for each<br />
course number taught by that professor.  Professors who do not teach<br />
any courses should have no Courses subelement at all.  (This problem is<br />
very challenging; extra congratulations if you get it right.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">&lt;Inverted_Course_Catalog&gt;
    { for $ln in distinct-values(doc("courses.xml")//Professor/Last_Name)
      let $prof := (doc("courses.xml")//Professor[Last_Name=$ln])[1]
      order by $ln
      return &lt;Professor&gt;
                 { $prof/First_Name } { $prof/Middle_Initial }
                 { $prof/Last_Name }
                 { let $cs :=
                       &lt;Courses&gt;
                           { for $c in doc("courses.xml")//Course[
                                 Instructors/Professor/Last_Name = $ln]
                             return &lt;Course&gt;
                                        { data($c/@Number) }
                                    &lt;/Course&gt; }
                       &lt;/Courses&gt;
                   return $cs[Course] }
             &lt;/Professor&gt;}
&lt;/Inverted_Course_Catalog&gt;
</pre>
</div>
</div>
</div>
