notes/intro_db.org
*** DONE World-Countries XPath and XQuery Exercises
    CLOSED: [2017-06-25 Sun 10:58]

Return the area of Mongolia.

#+BEGIN_SRC xquery
data(doc("countries.xml")//country[@name="Mongolia"]/@area)
#+END_SRC

Return the names of all cities that have the same name as the country
in which they are located.

#+BEGIN_SRC xquery
for $c in doc("countries.xml")//country[@name = city/name]
return $c/city[name = $c/@name]/name
#+END_SRC

#+BEGIN_SRC xquery
for $c in doc("countries.xml")//country[@name = city/name]
return <name> { data($c/@name) } </name>
#+END_SRC

Return the average population of Russian-speaking countries.

#+BEGIN_SRC xquery
avg(data(doc("countries.xml")//country[language = "Russian"]/@population))
#+END_SRC

Return the names of all countries that have at least three cities with
population greater than 3 million.

#+BEGIN_SRC xquery
data(doc("countries.xml")//country[count(city[xs:int(population) > 3000000]) >= 3]/@name)
#+END_SRC

The function call =xs:int= in the above code is actually unnecessary
since type promotion would occur due to right-hand operand.

Create a list of French-speaking and German-speaking countries.  The
result should take the form:

#+BEGIN_SRC xml
<result>
  <French>
    <country>country-name</country>
    <country>country-name</country>
    ...
  </French>
  <German>
    <country>country-name</country>
    <country>country-name</country>
    ...
  </German>
</result>
#+END_SRC

#+BEGIN_SRC xquery
<result>
  <French>
    { for $cn in data(doc("countries.xml")//country[language = "French"]/@name)
      return <country> { $cn } </country> }
  </French>
  <German>
    { for $cn in data(doc("countries.xml")//country[language = "German"]/@name)
      return <country> { $cn } </country> }
  </German>
</result>
#+END_SRC

#+BEGIN_SRC xquery
<result>
  { let $langs := ("French", "German")
    for $lang in $langs
    return element {$lang}
    { for $cn in data(doc("countries.xml")//country[language=$lang]/@name)
          return <country> { $cn } </country> } }
</result>
#+END_SRC

Return the countries with the highest and lowest population densities.
Note that because the "/" operator has its own meaning in XPath and
XQuery, the division operator is infix "div".  To compute population
density use "(@population div @area)".  You can assume density values
are unique.  The result should take the form:

#+BEGIN_SRC xml
<result>
  <highest density="value">country-name</highest>
  <lowest density="value">country-name</lowest>
</result>
#+END_SRC

#+BEGIN_SRC xquery
<result>
  { for $c1 in doc("countries.xml")//country
    let $density := $c1/@population div $c1/@area
    where every $c2 in doc("countries.xml")//country
          satisfies $density >= $c2/@population div $c2/@area
    return <highest density="{$density}"> { data($c1/@name) } </highest> }
  { for $c1 in doc("countries.xml")//country
    let $density := $c1/@population div $c1/@area
    where every $c2 in doc("countries.xml")//country
          satisfies $density <= $c2/@population div $c2/@area
    return <lowest density="{$density}"> { data($c1/@name) } </lowest> }
</result>
#+END_SRC

