notes/intro_db.html

<div id="outline-container-org352102f" class="outline-4">
<h4 id="org352102f"><span class="section-number-4">2.2.3</span> <span class="done DONE">DONE</span> World-Countries XPath and XQuery Exercises</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Return the area of Mongolia.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("countries.xml")//country[@name="Mongolia"]/@area)
</pre>
</div>

<p>
Return the names of all cities that have the same name as the country<br />
in which they are located.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("countries.xml")//country[@name = city/name]
return $c/city[name = $c/@name]/name
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("countries.xml")//country[@name = city/name]
return &lt;name&gt; { data($c/@name) } &lt;/name&gt;
</pre>
</div>

<p>
Return the average population of Russian-speaking countries.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">avg(data(doc("countries.xml")//country[language = "Russian"]/@population))
</pre>
</div>

<p>
Return the names of all countries that have at least three cities with<br />
population greater than 3 million.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("countries.xml")//country[count(city[xs:int(population) &gt; 3000000]) &gt;= 3]/@name)
</pre>
</div>

<p>
The function call <code>xs:int</code> in the above code is actually unnecessary<br />
since type promotion would occur due to right-hand operand.<br />
</p>

<p>
Create a list of French-speaking and German-speaking countries.  The<br />
result should take the form:<br />
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">result</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">French</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">country-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">country-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    ...</span>
<span class="org-nxml-text">  </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">French</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">German</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">country-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">country-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    ...</span>
<span class="org-nxml-text">  </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">German</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">result</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">&lt;result&gt;
  &lt;French&gt;
    { for $cn in data(doc("countries.xml")//country[language = "French"]/@name)
      return &lt;country&gt; { $cn } &lt;/country&gt; }
  &lt;/French&gt;
  &lt;German&gt;
    { for $cn in data(doc("countries.xml")//country[language = "German"]/@name)
      return &lt;country&gt; { $cn } &lt;/country&gt; }
  &lt;/German&gt;
&lt;/result&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">&lt;result&gt;
  { let $langs := ("French", "German")
    for $lang in $langs
    return element {$lang}
    { for $cn in data(doc("countries.xml")//country[language=$lang]/@name)
          return &lt;country&gt; { $cn } &lt;/country&gt; } }
&lt;/result&gt;
</pre>
</div>

<p>
Return the countries with the highest and lowest population densities.<br />
Note that because the "/" operator has its own meaning in XPath and<br />
XQuery, the division operator is infix "div".  To compute population<br />
density use "(@population div @area)".  You can assume density values<br />
are unique.  The result should take the form:<br />
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">result</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">highest</span> <span class="org-nxml-attribute-local-name">density</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">value</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">country-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">highest</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">lowest</span> <span class="org-nxml-attribute-local-name">density</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">value</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">country-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">lowest</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">result</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">&lt;result&gt;
  { for $c1 in doc("countries.xml")//country
    let $density := $c1/@population div $c1/@area
    where every $c2 in doc("countries.xml")//country
          satisfies $density &gt;= $c2/@population div $c2/@area
    return &lt;highest density="{$density}"&gt; { data($c1/@name) } &lt;/highest&gt; }
  { for $c1 in doc("countries.xml")//country
    let $density := $c1/@population div $c1/@area
    where every $c2 in doc("countries.xml")//country
          satisfies $density &lt;= $c2/@population div $c2/@area
    return &lt;lowest density="{$density}"&gt; { data($c1/@name) } &lt;/lowest&gt; }
&lt;/result&gt;
</pre>
</div>
</div>
</div>
