notes/intro_db.org
*** DONE World-Countries XPath and XQuery Exercises Extras
    CLOSED: [2017-06-26 Mon 07:48]

Return the names of all countries with population greater than 100
million.

#+BEGIN_SRC xquery
data(doc("countries.xml")//country[@population > 100000000]/@name)
#+END_SRC

Return the names of all countries where over 50% of the population
speaks German.  (Hint: Depending on your solution, you may want to use
".", which refers to the "current element" within an XPath
expression.)

#+BEGIN_SRC xquery
data(doc("countries.xml")//country[language[@percentage > 50.0] = "German"]/@name)
#+END_SRC

Return the names of all countries where a city in that country
contains more than one-third of the country's population.

#+BEGIN_SRC xquery
for $c in doc("countries.xml")//country
where some $cp in $c/city/population
      satisfies $cp div $c/@population > 1 div 3
return data($c/@name)
#+END_SRC

Return the population density of Qatar.  Note: Since the "/" operator
has its own meaning in XPath and XQuery, the division operator is
"div".  To compute population density use "(@population div @area)".

#+BEGIN_SRC xquery
let $c := doc("countries.xml")//country[@name="Qatar"]
return $c/@population div $c/@area
#+END_SRC

Return the names of all countries whose population is less than one
thousandth that of some city (in any country).

#+BEGIN_SRC xquery
let $countries := doc("countries.xml")//country
for $c in $countries
where some $city in $countries/city
      satisfies $city/population * 0.001 > $c/@population
return data($c/@name)
#+END_SRC

Return all city names that appear more than once, i.e., there is more
than one city with that name in the data.  Return only one instance of
each such city name.  (Hint: You might want to use the "preceding"
and/or "following" navigation axes for this query, which were not
covered in the video or our demo script; they match any preceding or
following node, not just siblings.)

#+BEGIN_SRC xquery
let $cities := doc("countries.xml")//city
for $city in distinct-values($cities/name)
where count($cities[name = $city]) > 1
return <name>{$city}</name>
#+END_SRC

Return the names of all countries containing a city such that some
other country has a city of the same name.  (Hint: You might want to
use the "preceding" and/or "following" navigation axes for this query,
which were not covered in the video or our demo script; they match any
preceding or following node, not just siblings.)

#+BEGIN_SRC xquery
let $countries := doc("countries.xml")//country
for $c in $countries
where some $c2 in $countries
      satisfies not($c2 is $c)
                and $c/city/name = $c2/city/name
return data($c/@name)
#+END_SRC

Return the names of all countries whose name textually contains a
language spoken in that country.  For instance, Uzbek is spoken in
Uzbekistan, so return Uzbekistan.  (Hint: You may want to use ".",
which refers to the "current element" within an XPath expression.)

#+BEGIN_SRC xquery
for $c in doc("countries.xml")//country
where some $lang in $c/language
      satisfies contains($c/@name, $lang)
return data($c/@name)
#+END_SRC

Return the names of all countries in which people speak a language
whose name textually contains the name of the country.  For instance,
Japanese is spoken in Japan, so return Japan.  (Hint: You may want to
use ".", which refers to the "current element" within an XPath
expression.)

#+BEGIN_SRC xquery
data(doc("countries.xml")//country[language[contains(., ../@name)]]/@name)
#+END_SRC

Return all languages spoken in a country whose name textually contains
the language name.  For instance, German is spoken in Germany, so
return German.  (Hint: Depending on your solution, may want to use
data(.), which returns the text value of the "current element" within
an XPath expression.)

#+BEGIN_SRC xquery
data(doc("countries.xml")//country/language[contains(../@name, .)])
#+END_SRC

Return all languages whose name textually contains the name of a
country in which the language is spoken.  For instance, Icelandic is
spoken in Iceland, so return Icelandic.  (Hint: Depending on your
solution, may want to use data(.), which returns the text value of the
"current element" within an XPath expression.)

#+BEGIN_SRC xquery
data(doc("countries.xml")//country/language[contains(., ../@name)])
#+END_SRC

Return the number of countries where Russian is spoken.

#+BEGIN_SRC xquery
count(doc("countries.xml")//country[language = "Russian"])
#+END_SRC

Return the names of all countries for which the data does not include
any languages or cities, but the country has more than 10 million
people.

#+BEGIN_SRC xquery
data(doc("countries.xml")//country[not(language or city) and @population > 10000000]/@name)
#+END_SRC

Return the name of the country with the highest population.  (Hint: You
may need to explicitly cast population numbers as integers with
xs:int() to get the correct answer.)

#+BEGIN_SRC xquery
data(doc("countries.xml")//country[
    @population = max(doc("countries.xml")//country/@population)
]/@name)
#+END_SRC)

Return the name of the country that has the city with the highest
population.  (Hint: You may need to explicitly cast population numbers
as integers with xs:int() to get the correct answer.)

#+BEGIN_SRC xquery
data(doc("countries.xml")//country[
    city/population = max(doc("countries.xml")//city/population)
]/@name)
#+END_SRC

Return the average number of languages spoken in countries where
Russian is spoken.

#+BEGIN_SRC xquery
avg(for $c in doc("countries.xml")//country[language = "Russian"]
return count($c/language))
#+END_SRC

Return all country-language pairs where the language is spoken in the
country and the name of the country textually contains the language
name.  Return each pair as a country element with language attribute,
e.g.,

#+BEGIN_SRC xml
<country language="French">French Guiana</country>
#+END_SRC

#+BEGIN_SRC xquery
for $c in doc("countries.xml")//country
for $lang in $c/language
where contains($c/@name, $lang)
return <country language="{$lang}"> { data($c/@name) } </country>
#+END_SRC

Return all countries that have at least one city with population
greater than 7 million.  For each one, return the country name along
with the cities greater than 7 million, in the format:

#+BEGIN_SRC xml
<country name="country-name">
  <big>city-name</big>
  <big>city-name</big>
  ...
</country>
#+END_SRC

#+BEGIN_SRC xquery
for $country in doc("countries.xml")//country
let $c := <country>
              { $country/@name }
              { for $city in $country/city
                where $city/population > 7000000
                return <big>{data($city/name)}</big> }
          </country>
return $c[big]
#+END_SRC

Return all countries where at least one language is listed, but the
total percentage for all listed languages is less than 90%.  Return the
country element with its name attribute and its language subelements,
but no other attributes or subelements.

#+BEGIN_SRC xquery
for $country in doc("countries.xml")//country[language]
where sum($country/language/@percentage) < 90
return <country>
           { $country/@name }
           { $country/language }
       </country>
#+END_SRC

Return all countries where at least one language is listed, and every
listed language is spoken by less than 20% of the population.  Return
the country element with its name attribute and its language
subelements, but no other attributes or subelements.

#+BEGIN_SRC xquery
for $country in doc("countries.xml")//country[language]
where every $lang in $country/language
      satisfies $lang/@percentage < 20
return <country>
           { $country/@name }
           { $country/language }
       </country>
#+END_SRC

Find all situations where one country's most popular language is
another country's least popular, and both countries list more than one
language.  (Hint: You may need to explicitly cast percentages as
floating-point numbers with xs:float() to get the correct answer.)
Return the name of the language and the two countries, each in the
format:

#+BEGIN_SRC xml
<LangPair language="lang-name">
  <MostPopular>country-name</MostPopular>
  <LeastPopular>country-name</LeastPopular>
</LangPair>
#+END_SRC

#+BEGIN_SRC xquery
let $countries := doc("countries.xml")//country[count(language) > 1]
for $c in $countries
for $lang in $c/language
where every $lang2 in $c/language
      satisfies xs:float($lang/@percentage) >= $lang2/@percentage
return (<LangPair language="{$lang}">
            <MostPopular>{data($c/@name)}</MostPopular>
            { for $c2 in $countries[language = $lang]
              let $lang3 := $c2/language[. = $lang]
              where every $lang2 in $c2/language
                    satisfies xs:float($lang3/@percentage) <= $lang2/@percentage
              return <LeastPopular> {data($c2/@name)}</LeastPopular> }
        </LangPair>)[LeastPopular]
#+END_SRC

#+BEGIN_SRC xquery
let $countries :=
    for $c in doc("countries.xml")//country[count(language) > 1]
    let $most_lang :=
        for $lang in $c/language
        where every $lang2 in $c/language
              satisfies xs:float($lang/@percentage) >= $lang2/@percentage
        return <MostPopular>{data($lang)}</MostPopular>
    let $least_lang :=
        for $lang in $c/language
        where every $lang2 in $c/language
              satisfies xs:float($lang/@percentage) <= $lang2/@percentage
        return <LeastPopular>{data($lang)}</LeastPopular>
    return <country>
               {$c/@name}
               {$most_lang}
               {$least_lang}
           </country>
for $c1 in $countries
for $c2 in $countries
where $c1/MostPopular = $c2/LeastPopular
return <LangPair language="{$c1/MostPopular}">
           <MostPopular>{data($c1/@name)}</MostPopular>
           <LeastPopular>{data($c2/@name)}</LeastPopular>
       </LangPair>
#+END_SRC

For each language spoken in one or more countries, create a "language"
element with a "name" attribute and one "country" subelement for each
country in which the language is spoken.  The "country" subelements
should have two attributes: the country "name", and "speakers"
containing the number of speakers of that language (based on language
percentage and the country's population).  Order the result by
language name, and enclose the entire list in a single "languages"
element.  For example, your result might look like:

#+BEGIN_SRC xml
<languages>
  ...
  <language name="Arabic">
    <country name="Iran" speakers="660942"/>
    <country name="Saudi Arabia" speakers="19409058"/>
    <country name="Yemen" speakers="13483178"/>
  </language>
  ...
</languages>
#+END_SRC

#+BEGIN_SRC xquery
<languages>
    { for $lang in distinct-values(doc("countries.xml")//language)
      order by $lang
      return <language name="{$lang}">
                 { for $c in doc("countries.xml")//country[language = $lang]
                   return <country name="{$c/@name}"
                                   speakers="{xs:int(
                                       $c/language[. = $lang]/@percentage
                                           div 100 * $c/@population)}">
                          </country> }
             </language> }
</languages>
#+END_SRC


