notes/intro_db.html

<div id="outline-container-org8c8cc24" class="outline-4">
<h4 id="org8c8cc24"><span class="section-number-4">2.2.4</span> <span class="done DONE">DONE</span> World-Countries XPath and XQuery Exercises Extras</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Return the names of all countries with population greater than 100<br />
million.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("countries.xml")//country[@population &gt; 100000000]/@name)
</pre>
</div>

<p>
Return the names of all countries where over 50% of the population<br />
speaks German.  (Hint: Depending on your solution, you may want to use<br />
".", which refers to the "current element" within an XPath<br />
expression.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("countries.xml")//country[language[@percentage &gt; 50.0] = "German"]/@name)
</pre>
</div>

<p>
Return the names of all countries where a city in that country<br />
contains more than one-third of the country's population.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("countries.xml")//country
where some $cp in $c/city/population
      satisfies $cp div $c/@population &gt; 1 div 3
return data($c/@name)
</pre>
</div>

<p>
Return the population density of Qatar.  Note: Since the "/" operator<br />
has its own meaning in XPath and XQuery, the division operator is<br />
"div".  To compute population density use "(@population div @area)".<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">let $c := doc("countries.xml")//country[@name="Qatar"]
return $c/@population div $c/@area
</pre>
</div>

<p>
Return the names of all countries whose population is less than one<br />
thousandth that of some city (in any country).<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">let $countries := doc("countries.xml")//country
for $c in $countries
where some $city in $countries/city
      satisfies $city/population * 0.001 &gt; $c/@population
return data($c/@name)
</pre>
</div>

<p>
Return all city names that appear more than once, i.e., there is more<br />
than one city with that name in the data.  Return only one instance of<br />
each such city name.  (Hint: You might want to use the "preceding"<br />
and/or "following" navigation axes for this query, which were not<br />
covered in the video or our demo script; they match any preceding or<br />
following node, not just siblings.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">let $cities := doc("countries.xml")//city
for $city in distinct-values($cities/name)
where count($cities[name = $city]) &gt; 1
return &lt;name&gt;{$city}&lt;/name&gt;
</pre>
</div>

<p>
Return the names of all countries containing a city such that some<br />
other country has a city of the same name.  (Hint: You might want to<br />
use the "preceding" and/or "following" navigation axes for this query,<br />
which were not covered in the video or our demo script; they match any<br />
preceding or following node, not just siblings.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">let $countries := doc("countries.xml")//country
for $c in $countries
where some $c2 in $countries
      satisfies not($c2 is $c)
                and $c/city/name = $c2/city/name
return data($c/@name)
</pre>
</div>

<p>
Return the names of all countries whose name textually contains a<br />
language spoken in that country.  For instance, Uzbek is spoken in<br />
Uzbekistan, so return Uzbekistan.  (Hint: You may want to use ".",<br />
which refers to the "current element" within an XPath expression.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("countries.xml")//country
where some $lang in $c/language
      satisfies contains($c/@name, $lang)
return data($c/@name)
</pre>
</div>

<p>
Return the names of all countries in which people speak a language<br />
whose name textually contains the name of the country.  For instance,<br />
Japanese is spoken in Japan, so return Japan.  (Hint: You may want to<br />
use ".", which refers to the "current element" within an XPath<br />
expression.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("countries.xml")//country[language[contains(., ../@name)]]/@name)
</pre>
</div>

<p>
Return all languages spoken in a country whose name textually contains<br />
the language name.  For instance, German is spoken in Germany, so<br />
return German.  (Hint: Depending on your solution, may want to use<br />
data(.), which returns the text value of the "current element" within<br />
an XPath expression.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("countries.xml")//country/language[contains(../@name, .)])
</pre>
</div>

<p>
Return all languages whose name textually contains the name of a<br />
country in which the language is spoken.  For instance, Icelandic is<br />
spoken in Iceland, so return Icelandic.  (Hint: Depending on your<br />
solution, may want to use data(.), which returns the text value of the<br />
"current element" within an XPath expression.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("countries.xml")//country/language[contains(., ../@name)])
</pre>
</div>

<p>
Return the number of countries where Russian is spoken.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">count(doc("countries.xml")//country[language = "Russian"])
</pre>
</div>

<p>
Return the names of all countries for which the data does not include<br />
any languages or cities, but the country has more than 10 million<br />
people.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("countries.xml")//country[not(language or city) and @population &gt; 10000000]/@name)
</pre>
</div>

<p>
Return the name of the country with the highest population.  (Hint: You<br />
may need to explicitly cast population numbers as integers with<br />
xs:int() to get the correct answer.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">data(doc("countries.xml")//country[
    @population = max(doc("countries.xml")//country/@population)
]/@name)
#+END_SRC)

Return the name of the country that has the city with the highest
population.  (Hint: You may need to explicitly cast population numbers
as integers with xs:int() to get the correct answer.)

#+BEGIN_SRC xquery
data(doc("countries.xml")//country[
    city/population = max(doc("countries.xml")//city/population)
]/@name)
</pre>
</div>

<p>
Return the average number of languages spoken in countries where<br />
Russian is spoken.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">avg(for $c in doc("countries.xml")//country[language = "Russian"]
return count($c/language))
</pre>
</div>

<p>
Return all country-language pairs where the language is spoken in the<br />
country and the name of the country textually contains the language<br />
name.  Return each pair as a country element with language attribute,<br />
e.g.,<br />
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">country</span> <span class="org-nxml-attribute-local-name">language</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">French</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">French Guiana</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $c in doc("countries.xml")//country
for $lang in $c/language
where contains($c/@name, $lang)
return &lt;country language="{$lang}"&gt; { data($c/@name) } &lt;/country&gt;
</pre>
</div>

<p>
Return all countries that have at least one city with population<br />
greater than 7 million.  For each one, return the country name along<br />
with the cities greater than 7 million, in the format:<br />
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">country</span> <span class="org-nxml-attribute-local-name">name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">country-name</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">big</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">city-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">big</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">big</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">city-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">big</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">  ...</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">country</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">for $country in doc("countries.xml")//country
let $c := &lt;country&gt;
              { $country/@name }
              { for $city in $country/city
                where $city/population &gt; 7000000
                return &lt;big&gt;{data($city/name)}&lt;/big&gt; }
          &lt;/country&gt;
return $c[big]
</pre>
</div>

<p>
Return all countries where at least one language is listed, but the<br />
total percentage for all listed languages is less than 90%.  Return the<br />
country element with its name attribute and its language subelements,<br />
but no other attributes or subelements.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">for $country in doc("countries.xml")//country[language]
where sum($country/language/@percentage) &lt; 90
return &lt;country&gt;
           { $country/@name }
           { $country/language }
       &lt;/country&gt;
</pre>
</div>

<p>
Return all countries where at least one language is listed, and every<br />
listed language is spoken by less than 20% of the population.  Return<br />
the country element with its name attribute and its language<br />
subelements, but no other attributes or subelements.<br />
</p>

<div class="org-src-container">
<pre class="src src-xquery">for $country in doc("countries.xml")//country[language]
where every $lang in $country/language
      satisfies $lang/@percentage &lt; 20
return &lt;country&gt;
           { $country/@name }
           { $country/language }
       &lt;/country&gt;
</pre>
</div>

<p>
Find all situations where one country's most popular language is<br />
another country's least popular, and both countries list more than one<br />
language.  (Hint: You may need to explicitly cast percentages as<br />
floating-point numbers with xs:float() to get the correct answer.)<br />
Return the name of the language and the two countries, each in the<br />
format:<br />
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">LangPair</span> <span class="org-nxml-attribute-local-name">language</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">lang-name</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">MostPopular</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">country-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">MostPopular</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">LeastPopular</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">country-name</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">LeastPopular</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">LangPair</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">let $countries := doc("countries.xml")//country[count(language) &gt; 1]
for $c in $countries
for $lang in $c/language
where every $lang2 in $c/language
      satisfies xs:float($lang/@percentage) &gt;= $lang2/@percentage
return (&lt;LangPair language="{$lang}"&gt;
            &lt;MostPopular&gt;{data($c/@name)}&lt;/MostPopular&gt;
            { for $c2 in $countries[language = $lang]
              let $lang3 := $c2/language[. = $lang]
              where every $lang2 in $c2/language
                    satisfies xs:float($lang3/@percentage) &lt;= $lang2/@percentage
              return &lt;LeastPopular&gt; {data($c2/@name)}&lt;/LeastPopular&gt; }
        &lt;/LangPair&gt;)[LeastPopular]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">let $countries :=
    for $c in doc("countries.xml")//country[count(language) &gt; 1]
    let $most_lang :=
        for $lang in $c/language
        where every $lang2 in $c/language
              satisfies xs:float($lang/@percentage) &gt;= $lang2/@percentage
        return &lt;MostPopular&gt;{data($lang)}&lt;/MostPopular&gt;
    let $least_lang :=
        for $lang in $c/language
        where every $lang2 in $c/language
              satisfies xs:float($lang/@percentage) &lt;= $lang2/@percentage
        return &lt;LeastPopular&gt;{data($lang)}&lt;/LeastPopular&gt;
    return &lt;country&gt;
               {$c/@name}
               {$most_lang}
               {$least_lang}
           &lt;/country&gt;
for $c1 in $countries
for $c2 in $countries
where $c1/MostPopular = $c2/LeastPopular
return &lt;LangPair language="{$c1/MostPopular}"&gt;
           &lt;MostPopular&gt;{data($c1/@name)}&lt;/MostPopular&gt;
           &lt;LeastPopular&gt;{data($c2/@name)}&lt;/LeastPopular&gt;
       &lt;/LangPair&gt;
</pre>
</div>

<p>
For each language spoken in one or more countries, create a "language"<br />
element with a "name" attribute and one "country" subelement for each<br />
country in which the language is spoken.  The "country" subelements<br />
should have two attributes: the country "name", and "speakers"<br />
containing the number of speakers of that language (based on language<br />
percentage and the country's population).  Order the result by<br />
language name, and enclose the entire list in a single "languages"<br />
element.  For example, your result might look like:<br />
</p>

<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">languages</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">  ...</span>
<span class="org-nxml-text">  </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">language</span> <span class="org-nxml-attribute-local-name">name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">Arabic</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">country</span> <span class="org-nxml-attribute-local-name">name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">Iran</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-local-name">speakers</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">660942</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">country</span> <span class="org-nxml-attribute-local-name">name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">Saudi Arabia</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-local-name">speakers</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">19409058</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">country</span> <span class="org-nxml-attribute-local-name">name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">Yemen</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-local-name">speakers</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">13483178</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">language</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">  ...</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">languages</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xquery">&lt;languages&gt;
    { for $lang in distinct-values(doc("countries.xml")//language)
      order by $lang
      return &lt;language name="{$lang}"&gt;
                 { for $c in doc("countries.xml")//country[language = $lang]
                   return &lt;country name="{$c/@name}"
                                   speakers="{xs:int(
                                       $c/language[. = $lang]/@percentage
                                           div 100 * $c/@population)}"&gt;
                          &lt;/country&gt; }
             &lt;/language&gt; }
&lt;/languages&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
