notes/intro_db.org
* DONE [[https://lagunita.stanford.edu/courses/DB/XSLT/SelfPaced/courseware/ch-querying_xml/][XSLT]] mini-course
  CLOSED: [2017-07-02 Sun 20:06]
  :PROPERTIES:
  :VISIBILITY: FOLDED
  :END:
** DONE Lecture videos
   CLOSED: [2017-07-02 Sun 15:13]
XSL = Extensible Stylesheet Language
XSLT = XSL (with) transformations

XSLT is more widely used than XSL.

XSLT: Rule-Based Transformations

Match template and replace
Recursively match template
Extract values
Iteration (for-each)
Conditionals (if)

Strange default/whitespace behavior
Implicit template priority scheme

** DONE Exercises
   CLOSED: [2017-07-02 Sun 20:06]
*** DONE Course-Catalog XSLT
    CLOSED: [2017-07-02 Sun 16:21]

Return a list of department titles.

Your solution should fill in the following stylesheet:

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
    <xsl:template match=...>
        ... template body ...
    </xsl:template>
    ... more templates as needed ...
</xsl:stylesheet>
#+END_SRC

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
    <xsl:template match="Department/Title">
        <xsl:copy-of select="."/>
    </xsl:template>
    <xsl:template match="text()"/>
</xsl:stylesheet>
#+END_SRC

Return a list of department elements with no attributes and two
subelements each: the department title and the entire Chair subelement
structure.

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
    <xsl:template match="Department">
      <Department>
        <xsl:copy-of select="Title"/>
        <xsl:copy-of select="Chair"/>
      </Department>
    </xsl:template>
    <xsl:template match="text()"/>
</xsl:stylesheet>
#+END_SRC

*** DONE Course-Catalog XSLT Extras
    CLOSED: [2017-07-02 Sun 20:06]

Return all courses with enrollment greater than 500.  Retain the
structure of Course elements from the original data.

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:template match="Course[@Enrollment &gt; 500]">
    <xsl:copy-of select="."/>
  </xsl:template>
  <xsl:template match="text()"/>
</xsl:stylesheet>
#+END_SRC

Remove from the data all courses with enrollment greater than 60, or
with no enrollment listed.  Otherwise the structure of the data should
be the same.

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:strip-space elements="*"/>
  <xsl:template match="*|@*|text()">
    <xsl:copy>
      <xsl:apply-templates select="*|@*|text()"/>
    </xsl:copy>
  </xsl:template>
  <xsl:template match="Course[not(@Enrollment) or @Enrollment &gt; 60]"/>
</xsl:stylesheet>
#+END_SRC

Create a summarized version of the EE part of the course catalog.  For
each course in EE, return a Course element, with its Number and Title
as attributes, its Description as a subelement, and the last name of
each instructor as an Instructor subelement.  Discard all information
about department titles, chairs, enrollment, and prerequisites, as
well as all courses in departments other than EE.  (Note: To specify
quotes within an already-quoted XPath expression, use quot;.)

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:template match="Department[@Code='EE']">
    <xsl:for-each select="Course">
      <Course Number="{@Number}"
              Title="{Title}">
        <xsl:copy-of select="Description"/>
        <xsl:for-each select="Instructors//Last_Name">
          <Instructor><xsl:value-of select="."/></Instructor>
        </xsl:for-each>
      </Course>
    </xsl:for-each>
  </xsl:template>
  <xsl:template match="text()"/>
</xsl:stylesheet>
#+END_SRC

Create an HTML table with one-pixel border that lists all CS
department courses with enrollment greater than 200.  Each row should
contain three cells: the course number in italics, course title in
bold, and enrollment.  Sort the rows alphabetically by course title.
No header is needed.  (Note: For formatting, just use "table
border=1", and "<b>" and "<i>" tags for bold and italics respectively.
To specify quotes within an already-quoted XPath expression, use
quot;.)

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:template match="Department[@Code='CS']">
    <table border="1">
      <xsl:for-each select="Course[@Enrollment &gt; 200]">
        <xsl:sort select="Title"/>
        <tr>
          <td><i><xsl:value-of select="@Number"/></i></td>
          <td><b><xsl:value-of select="Title"/></b></td>
          <td><xsl:value-of select="@Enrollment"/></td>
        </tr>
      </xsl:for-each>
    </table>
  </xsl:template>
  <xsl:template match="text()"/>
</xsl:stylesheet>
#+END_SRC

