notes/intro_db.html


<div id="outline-container-org7d42edd" class="outline-2">
<h2 id="org7d42edd"><span class="section-number-2">3</span> <span class="done DONE">DONE</span> <a href="https://lagunita.stanford.edu/courses/DB/XSLT/SelfPaced/courseware/ch-querying_xml/">XSLT</a> mini-course</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgfe254ab" class="outline-3">
<h3 id="orgfe254ab"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> Lecture videos</h3>
<div class="outline-text-3" id="text-3-1">
<p>
XSL = Extensible Stylesheet Language<br />
XSLT = XSL (with) transformations<br />
</p>

<p>
XSLT is more widely used than XSL.<br />
</p>

<p>
XSLT: Rule-Based Transformations<br />
</p>

<p>
Match template and replace<br />
Recursively match template<br />
Extract values<br />
Iteration (for-each)<br />
Conditionals (if)<br />
</p>

<p>
Strange default/whitespace behavior<br />
Implicit template priority scheme<br />
</p>
</div>
</div>

<div id="outline-container-org4cde76c" class="outline-3">
<h3 id="org4cde76c"><span class="section-number-3">3.2</span> <span class="done DONE">DONE</span> Exercises</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org25a75fe" class="outline-4">
<h4 id="org25a75fe"><span class="section-number-4">3.2.1</span> <span class="done DONE">DONE</span> Course-Catalog XSLT</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Return a list of department titles.<br />
</p>

<p>
Your solution should fill in the following stylesheet:<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
    &lt;xsl:template match=...&gt;
        ... template body ...
    &lt;/xsl:template&gt;
    ... more templates as needed ...
&lt;/xsl:stylesheet&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
    &lt;xsl:template match="Department/Title"&gt;
        &lt;xsl:copy-of select="."/&gt;
    &lt;/xsl:template&gt;
    &lt;xsl:template match="text()"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>

<p>
Return a list of department elements with no attributes and two<br />
subelements each: the department title and the entire Chair subelement<br />
structure.<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
    &lt;xsl:template match="Department"&gt;
      &lt;Department&gt;
        &lt;xsl:copy-of select="Title"/&gt;
        &lt;xsl:copy-of select="Chair"/&gt;
      &lt;/Department&gt;
    &lt;/xsl:template&gt;
    &lt;xsl:template match="text()"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1be131f" class="outline-4">
<h4 id="org1be131f"><span class="section-number-4">3.2.2</span> <span class="done DONE">DONE</span> Course-Catalog XSLT Extras</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Return all courses with enrollment greater than 500.  Retain the<br />
structure of Course elements from the original data.<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
  &lt;xsl:template match="Course[@Enrollment &amp;gt; 500]"&gt;
    &lt;xsl:copy-of select="."/&gt;
  &lt;/xsl:template&gt;
  &lt;xsl:template match="text()"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>

<p>
Remove from the data all courses with enrollment greater than 60, or<br />
with no enrollment listed.  Otherwise the structure of the data should<br />
be the same.<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
  &lt;xsl:strip-space elements="*"/&gt;
  &lt;xsl:template match="*|@*|text()"&gt;
    &lt;xsl:copy&gt;
      &lt;xsl:apply-templates select="*|@*|text()"/&gt;
    &lt;/xsl:copy&gt;
  &lt;/xsl:template&gt;
  &lt;xsl:template match="Course[not(@Enrollment) or @Enrollment &amp;gt; 60]"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>

<p>
Create a summarized version of the EE part of the course catalog.  For<br />
each course in EE, return a Course element, with its Number and Title<br />
as attributes, its Description as a subelement, and the last name of<br />
each instructor as an Instructor subelement.  Discard all information<br />
about department titles, chairs, enrollment, and prerequisites, as<br />
well as all courses in departments other than EE.  (Note: To specify<br />
quotes within an already-quoted XPath expression, use quot;.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
  &lt;xsl:template match="Department[@Code='EE']"&gt;
    &lt;xsl:for-each select="Course"&gt;
      &lt;Course Number="{@Number}"
              Title="{Title}"&gt;
        &lt;xsl:copy-of select="Description"/&gt;
        &lt;xsl:for-each select="Instructors//Last_Name"&gt;
          &lt;Instructor&gt;&lt;xsl:value-of select="."/&gt;&lt;/Instructor&gt;
        &lt;/xsl:for-each&gt;
      &lt;/Course&gt;
    &lt;/xsl:for-each&gt;
  &lt;/xsl:template&gt;
  &lt;xsl:template match="text()"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>

<p>
Create an HTML table with one-pixel border that lists all CS<br />
department courses with enrollment greater than 200.  Each row should<br />
contain three cells: the course number in italics, course title in<br />
bold, and enrollment.  Sort the rows alphabetically by course title.<br />
No header is needed.  (Note: For formatting, just use "table<br />
border=1", and "&lt;b&gt;" and "&lt;i&gt;" tags for bold and italics respectively.<br />
To specify quotes within an already-quoted XPath expression, use<br />
quot;.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
  &lt;xsl:template match="Department[@Code='CS']"&gt;
    &lt;table border="1"&gt;
      &lt;xsl:for-each select="Course[@Enrollment &amp;gt; 200]"&gt;
        &lt;xsl:sort select="Title"/&gt;
        &lt;tr&gt;
          &lt;td&gt;&lt;i&gt;&lt;xsl:value-of select="@Number"/&gt;&lt;/i&gt;&lt;/td&gt;
          &lt;td&gt;&lt;b&gt;&lt;xsl:value-of select="Title"/&gt;&lt;/b&gt;&lt;/td&gt;
          &lt;td&gt;&lt;xsl:value-of select="@Enrollment"/&gt;&lt;/td&gt;
        &lt;/tr&gt;
      &lt;/xsl:for-each&gt;
    &lt;/table&gt;
  &lt;/xsl:template&gt;
  &lt;xsl:template match="text()"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>
</div>
</div>
