notes/intro_db.org
*** DONE World-Countries XSLT
    CLOSED: [2017-07-02 Sun 18:52]

Return all countries with population between 9 and 10 million.  Retain
the structure of country elements from the original data.

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:template match="country[9000000 &lt;= @population and @population &lt;= 10000000]">
    <xsl:copy-of select="."/>
  </xsl:template>
  <xsl:template match="text()"/>
</xsl:stylesheet>
#+END_SRC

Create a table using HTML constructs that lists all countries that
have more than 3 languages.  Each row should contain the country name
in bold, population, area, and number of languages.  Sort the rows in
descending order of number of languages.  No header is needed for the
table, but use <table border="1"> to make it format nicely, should you
choose to check your result in a browser.  (Hint: You may find the
data-type and order attributes of <xsl:sort> to be useful.)

#+BEGIN_SRC xlst
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:template match="countries">
    <html>
      <table border="1">
        <xsl:for-each select="country[count(language) &gt; 3]">
          <xsl:sort select="count(language)"
                    order="descending"/>
          <tr>
            <td><b><xsl:value-of select="@name"/></b></td>
            <td><xsl:value-of select="@population"/></td>
            <td><xsl:value-of select="@area"/></td>
            <td><xsl:value-of select="count(language)"/></td>
          </tr>
        </xsl:for-each>
      </table>
    </html>
  </xsl:template>
  <xsl:template match="text()"/>
</xsl:stylesheet>
#+END_SRC

Create an alternate version of the countries database: for each
country, include its name and population as sublements, and the number
of languages and number of cities as attributes (called "languages"
and "cities" respectively).

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:template match="*|@*|text()">
    <xsl:copy>
      <xsl:apply-templates select="*|@*|text()"/>
    </xsl:copy>
  </xsl:template>
  <xsl:template match="country">
    <country languages="{count(language)}"
             cities="{count(city)}">
      <name><xsl:value-of select="@name"/></name>
      <population><xsl:value-of select="@population"/></population>
    </country>
  </xsl:template>
</xsl:stylesheet>
#+END_SRC

*** DONE World-Countries XSLT Extras
    CLOSED: [2017-07-02 Sun 19:21]

Find all country names containing the string "stan"; return each one
within a "Stan" element.  (Note: To specify quotes within an
already-quoted XPath expression, use quot;.)

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:template match="country[contains(@name, 'stan')]">
    <Stan><xsl:value-of select="@name"/></Stan>
  </xsl:template>
  <xsl:template match="text()"/>
</xsl:stylesheet>
#+END_SRC

Remove from the data all countries with area greater than 40,000 and
all countries with no cities listed.  Otherwise the structure of the
data should be the same.

#+BEGIN_SRC xslt
<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:strip-space elements="*"/>
  <xsl:template match="*|@*|text()">
    <xsl:copy>
      <xsl:apply-templates select="*|@*|text()"/>
    </xsl:copy>
  </xsl:template>
  <xsl:template match="country[@area &gt; 40000 or not(city)]"/>
</xsl:stylesheet>
#+END_SRC


* DONE [[https://lagunita.stanford.edu/courses/DB/RD/SelfPaced/courseware/ch-relational_design_theory/][Relational Design Theory]] mini-course
  CLOSED: [2017-07-24 Mon 02:23]
  :PROPERTIES:
  :VISIBILITY: FOLDED
  :END:
** DONE Lecture videos
   CLOSED: [2017-07-24 Mon 02:23]
*** DONE Overview
    CLOSED: [2017-07-02 Sun 21:16]

Design "anomalies"
  Redundancy
  Update anomaly
  Deletion anomaly

Design by decomposition
  Start with "mega" relations containing everything
  Decompose into smaller, better relations with same info
  Can do decomposition automatically

Automatic decomposition
  "Mega" relations + /properties of the data/
  System decomposes based on properties
  Final set of relations satisfies /normal form/
  - No anomalies, no lost information

Properites and Normal Forms
  Functional dependencies => Boyce-Codd Normal Form
  + Multivalued dependencies => Fourth Normal Form

4NF subsets BCNF

Functional Dependencies and BCNF
  Apply(SSN, sName, cName)
    Redundancy; Update & Deletion Anomalies
    Storing _SSN-sName_ pair once for each college

  /Functional Dependency/ _SSN -> sName_
    Same _SSN_ always has same _sName_
    Should store each _SSN_'s _sName_ only once

  /Boyce-Codd Normal Form/ If _A -> B_ then _A_ is a key

  _SSN_ should be a key but not.

  Decompose: _Student(SSN, sName) Apply(SSN, cName)_
  Pull out SSN and sName into its own relation

Multivalued Dependencies and 4NF
  Apply(SSN, cName, HS)
    Redundancy; Update & Deletion Anomalies
    Multiplicative effect
      C colleges, H high school
      C * H tuples
      Should be C + H
    Not addressed by BCNF: No functional dependencies

  /Multivalued Dependency/ _SSN ->> cName  SSN ->> HS_
    Given _SSN_ has every combination of _cName_ with _HS_
    Should store each _cName_ and each _HS_ for an _SSN_ once

  /Fourth Normal Form/ If _A ->> B_ then _A_ is a key

  Decompose: _Apply(SSN, cName) HighSchool(SSN, HS)_

