notes/intro_db.html

<div id="outline-container-org780b9bd" class="outline-4">
<h4 id="org780b9bd"><span class="section-number-4">3.2.3</span> <span class="done DONE">DONE</span> World-Countries XSLT</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Return all countries with population between 9 and 10 million.  Retain<br />
the structure of country elements from the original data.<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
  &lt;xsl:template match="country[9000000 &amp;lt;= @population and @population &amp;lt;= 10000000]"&gt;
    &lt;xsl:copy-of select="."/&gt;
  &lt;/xsl:template&gt;
  &lt;xsl:template match="text()"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>

<p>
Create a table using HTML constructs that lists all countries that<br />
have more than 3 languages.  Each row should contain the country name<br />
in bold, population, area, and number of languages.  Sort the rows in<br />
descending order of number of languages.  No header is needed for the<br />
table, but use &lt;table border="1"&gt; to make it format nicely, should you<br />
choose to check your result in a browser.  (Hint: You may find the<br />
data-type and order attributes of &lt;xsl:sort&gt; to be useful.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xlst">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
  &lt;xsl:template match="countries"&gt;
    &lt;html&gt;
      &lt;table border="1"&gt;
        &lt;xsl:for-each select="country[count(language) &amp;gt; 3]"&gt;
          &lt;xsl:sort select="count(language)"
                    order="descending"/&gt;
          &lt;tr&gt;
            &lt;td&gt;&lt;b&gt;&lt;xsl:value-of select="@name"/&gt;&lt;/b&gt;&lt;/td&gt;
            &lt;td&gt;&lt;xsl:value-of select="@population"/&gt;&lt;/td&gt;
            &lt;td&gt;&lt;xsl:value-of select="@area"/&gt;&lt;/td&gt;
            &lt;td&gt;&lt;xsl:value-of select="count(language)"/&gt;&lt;/td&gt;
          &lt;/tr&gt;
        &lt;/xsl:for-each&gt;
      &lt;/table&gt;
    &lt;/html&gt;
  &lt;/xsl:template&gt;
  &lt;xsl:template match="text()"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>

<p>
Create an alternate version of the countries database: for each<br />
country, include its name and population as sublements, and the number<br />
of languages and number of cities as attributes (called "languages"<br />
and "cities" respectively).<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
  &lt;xsl:template match="*|@*|text()"&gt;
    &lt;xsl:copy&gt;
      &lt;xsl:apply-templates select="*|@*|text()"/&gt;
    &lt;/xsl:copy&gt;
  &lt;/xsl:template&gt;
  &lt;xsl:template match="country"&gt;
    &lt;country languages="{count(language)}"
             cities="{count(city)}"&gt;
      &lt;name&gt;&lt;xsl:value-of select="@name"/&gt;&lt;/name&gt;
      &lt;population&gt;&lt;xsl:value-of select="@population"/&gt;&lt;/population&gt;
    &lt;/country&gt;
  &lt;/xsl:template&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebe2682" class="outline-4">
<h4 id="orgebe2682"><span class="section-number-4">3.2.4</span> <span class="done DONE">DONE</span> World-Countries XSLT Extras</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
Find all country names containing the string "stan"; return each one<br />
within a "Stan" element.  (Note: To specify quotes within an<br />
already-quoted XPath expression, use quot;.)<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
  &lt;xsl:template match="country[contains(@name, 'stan')]"&gt;
    &lt;Stan&gt;&lt;xsl:value-of select="@name"/&gt;&lt;/Stan&gt;
  &lt;/xsl:template&gt;
  &lt;xsl:template match="text()"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>

<p>
Remove from the data all countries with area greater than 40,000 and<br />
all countries with no cities listed.  Otherwise the structure of the<br />
data should be the same.<br />
</p>

<div class="org-src-container">
<pre class="src src-xslt">&lt;?xml version="1.0" encoding="ISO-8859-1"?&gt;
&lt;xsl:stylesheet version="2.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&gt;
  &lt;xsl:strip-space elements="*"/&gt;
  &lt;xsl:template match="*|@*|text()"&gt;
    &lt;xsl:copy&gt;
      &lt;xsl:apply-templates select="*|@*|text()"/&gt;
    &lt;/xsl:copy&gt;
  &lt;/xsl:template&gt;
  &lt;xsl:template match="country[@area &amp;gt; 40000 or not(city)]"/&gt;
&lt;/xsl:stylesheet&gt;
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org622db22" class="outline-2">
<h2 id="org622db22"><span class="section-number-2">4</span> <span class="done DONE">DONE</span> <a href="https://lagunita.stanford.edu/courses/DB/RD/SelfPaced/courseware/ch-relational_design_theory/">Relational Design Theory</a> mini-course</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5d0317d" class="outline-3">
<h3 id="org5d0317d"><span class="section-number-3">4.1</span> <span class="done DONE">DONE</span> Lecture videos</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orge6a4fac" class="outline-4">
<h4 id="orge6a4fac"><span class="section-number-4">4.1.1</span> <span class="done DONE">DONE</span> Overview</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Design "anomalies"<br />
  Redundancy<br />
  Update anomaly<br />
  Deletion anomaly<br />
</p>

<p>
Design by decomposition<br />
  Start with "mega" relations containing everything<br />
  Decompose into smaller, better relations with same info<br />
  Can do decomposition automatically<br />
</p>

<p>
Automatic decomposition<br />
  "Mega" relations + <i>properties of the data</i><br />
  System decomposes based on properties<br />
  Final set of relations satisfies <i>normal form</i><br />
</p>
<ul class="org-ul">
<li>No anomalies, no lost information<br /></li>
</ul>

<p>
Properites and Normal Forms<br />
  Functional dependencies =&gt; Boyce-Codd Normal Form<br />
</p>
<ul class="org-ul">
<li>Multivalued dependencies =&gt; Fourth Normal Form<br /></li>
</ul>

<p>
4NF subsets BCNF<br />
</p>

<p>
Functional Dependencies and BCNF<br />
  Apply(SSN, sName, cName)<br />
    Redundancy; Update &amp; Deletion Anomalies<br />
    Storing <span class="underline">SSN-sName</span> pair once for each college<br />
</p>

<p>
<i>Functional Dependency</i> <span class="underline">SSN -&gt; sName</span><br />
  Same <span class="underline">SSN</span> always has same <span class="underline">sName</span><br />
  Should store each <span class="underline">SSN</span>'s <span class="underline">sName</span> only once<br />
</p>

<p>
<i>Boyce-Codd Normal Form</i> If <span class="underline">A -&gt; B</span> then <span class="underline">A</span> is a key<br />
</p>

<p>
<span class="underline">SSN</span> should be a key but not.<br />
</p>

<p>
Decompose: <span class="underline">Student(SSN, sName) Apply(SSN, cName)</span><br />
Pull out SSN and sName into its own relation<br />
</p>

<p>
Multivalued Dependencies and 4NF<br />
  Apply(SSN, cName, HS)<br />
    Redundancy; Update &amp; Deletion Anomalies<br />
    Multiplicative effect<br />
      C colleges, H high school<br />
      C * H tuples<br />
      Should be C + H<br />
    Not addressed by BCNF: No functional dependencies<br />
</p>

<p>
<i>Multivalued Dependency</i> <span class="underline">SSN -&gt;&gt; cName  SSN -&gt;&gt; HS</span><br />
  Given <span class="underline">SSN</span> has every combination of <span class="underline">cName</span> with <span class="underline">HS</span><br />
  Should store each <span class="underline">cName</span> and each <span class="underline">HS</span> for an <span class="underline">SSN</span> once<br />
</p>

<p>
<i>Fourth Normal Form</i> If <span class="underline">A -&gt;&gt; B</span> then <span class="underline">A</span> is a key<br />
</p>

<p>
Decompose: <span class="underline">Apply(SSN, cName) HighSchool(SSN, HS)</span><br />
</p>
</div>
</div>
