notes/intro_db.org
*** DONE Functional Dependencies
    CLOSED: [2017-07-16 Sun 19:51]
Functional dependencies => Boyce-Codd Normal Form
Multivalued dependencies => Fourth Normal Form

Functional dependencies are generally useful concepts
  Data storage - compression
  Reasoning about queries - optimization

Functional dependencies generalizes keys.

Student(SS, sName, address,
        HScode, HSname, HScity, GPA, priority)

Suppose priority is determined by GPA

Two tuples with same GPA have same priority

for t, u in student:
    t.GPA = u.GPA => t.priorty = u.priority

GPA -> priority

for t, u in R:
    t[A1, ..., An] = u[A1, ..., An] => t[B1, ..., Bn] = u[B1, ..., Bn]

A1, ..., An -> B1, ..., Bn

\bar{A} -> \bar{B}

SSN -> sName
SSN -> address (assume students don't work)
HScode -> HSname, HScity
HSname, HScity -> HScode (assume no schools with same name in the same city)

SSN -> GPA
GPA -> priority
SSN -> priority

transitivity

Apply(SSN, cName, state, date, major)

cName -> date
SSN, cName -> major

SSN -> state

Functional Dependencies and Keys

R(\bar{A}, \bar{B})

Trivial Functional Dependency

\bar{A} -> \bar{B},  \bar{B} subset \bar{A}

Nontrivial FD
\bar{A} -> \bar{B},  \bar{B} not subset \bar{A}

Completely nontrivial FD (most interested)
A -> B, A intersect B = empty set

Splitting rule

\bar{A} -> B1, B2, ..., Bm
=> \bar{A} -> B1, \bar{A} -> B2, ...

Combining rule

\bar{A} -> B1
\bar{A} -> B2
...
=> \bar{A} -> B1, B2, ..., Bn

Trivial-dependency rules

A -> B, then A -> A union B

A -> B, then A -> A intersect B

Transitive rule

A -> B, B -> C, then A -> C

Closure of Attributes
  Given relations, FDs, set of attributes \bar{A}
  Find all B such that \bar{A} -> B

\bar{A}^+

apply transitive rule repeatedly to get the closure

if \bar{A}^+ = all attrs, then \bar{A} is a key.

Grow algorithms can be used to find all keys given a set of FDs.

If \bar{A} is a key, then all its supersets are keys.  Hence, we are
often only interested the smallest key.

Specifying FDs for a relation
  S1 and S2 sets of FDs
  S2 "follows from" S1 if every relation instance
  satisfying S1 also satisfies S2

S2: {SSN -> priority}
S1: {SSN -> GPA, GPA -> priority}

Does A -> B follow from S?

(1) A+ based S check if B in set.
(2) Armstrong's Axioms

Want: _Minimal_ set of _completely nontrivial_ FDs such that _all FDs_ that
hold on the relation follow from the dependencies in this set

*** DONE Boyce-Codd Normal Form
    CLOSED: [2017-07-16 Sun 21:16]
Decomposition of a relational schema
R(A1, ..., An)
R1(B1, ..., Bk)
R2(C1, ..., Cm)

B union C = A

R1 natural join R2 = R

Student(SSN, sName, address, HScode, HSname, HScity, GPA, priority)

This is a decomposition.
S1(SSN, sName, address, HScode, GPA, priority)
S2(HScode, HSname, HScity)

This is not a decomposition.
S1(SSN, sName, address, HScode, HSname, HScity)
S2(sName, HSname, GPA, priority)

Good decomposition exhibits lossless join property.

BCNF
Relation R with FDs is in BCNR if:
    For each \bar{A} -> B, \bar{A} is a key.
    BCNF violation (redundancy, update/delete anomalies)

note: a key can contain another key and thus is a super key.

BCNF decomposition algorithm

Input: relation R + FDs for R
Output: decomposition of R into BCNF relations with "lossless join"

Compute keys for R
Repeat until all relations are in BCNF
    Pick any R' with A -> B that violates BCNF
    Decompose R' into R1(A, B) and R2(A, rest)
    Compute FDs for R1 and R2
    Compute keys for R1 and R2

Randomness can result in different answer.
We can extend A -> BA+

*** DONE Multivalued Dependencies and 4th Normal Form
    CLOSED: [2017-07-24 Mon 00:47]
Fourth Normal Form subsets Boyce-Codd Normal Form
R  \bar{A} ->> \bar{B}  A1, ..., An, B1, ..., Bn

for all t, u in R: t[\bar{A}] = u[\bar{A}] then
    there exists v in R: v[\bar{A}] = t[\bar{A}] and
                         v[\bar{B}] = t[\bar{B}] and
                         v[rest] = u[rest]

Tuple-generating dependencies

\bar{A} ->> \bar{B} implies \bar{A} ->> rest

Trivial Multivalued Dependency

A ->> B   B subset A or  A union B = all attrs

A -> B implies A ->> B

FD-is-an-MVD rule

4NF implies BCNF

Intersection rule
A ->> B, A ->> C then A ->> B intersect C

Transitive rule
A ->> B, B ->> C then A ->> C - B

Fourth Normal Form

Relation R with MVDs is in 4NF if:
    For each nontrivial A ->> B, A is a key

*** DONE Shortcomings of BCNF/4NF

** DONE Exercises
   CLOSED: [2017-07-24 Mon 02:23]
R(A,B)
+R(A,C,D)+
R(A,C)
R(C,D)

R(C,D)
+R(A,B,C)+
R(A,B)
R(A,C)

R(B,C)
+R(A,B,D)+
R(A,B)
R(A,D)


* DONE [[https://lagunita.stanford.edu/courses/DB/UML/SelfPaced/courseware/ch-unified_modeling_language/][Unified Modeling Language]] mini-course
  CLOSED: [2017-08-07 Mon 01:11]
  :PROPERTIES:
  :VISIBILITY: FOLDED
  :END:
** DONE Lecture Videos
   CLOSED: [2017-08-06 Sun 18:04]
