notes/intro_db.html

<div id="outline-container-orga2368fd" class="outline-4">
<h4 id="orga2368fd"><span class="section-number-4">4.1.2</span> <span class="done DONE">DONE</span> Functional Dependencies</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Functional dependencies =&gt; Boyce-Codd Normal Form<br />
Multivalued dependencies =&gt; Fourth Normal Form<br />
</p>

<p>
Functional dependencies are generally useful concepts<br />
  Data storage - compression<br />
  Reasoning about queries - optimization<br />
</p>

<p>
Functional dependencies generalizes keys.<br />
</p>

<p>
Student(SS, sName, address,<br />
        HScode, HSname, HScity, GPA, priority)<br />
</p>

<p>
Suppose priority is determined by GPA<br />
</p>

<p>
Two tuples with same GPA have same priority<br />
</p>

<p>
for t, u in student:<br />
    t.GPA = u.GPA =&gt; t.priorty = u.priority<br />
</p>

<p>
GPA -&gt; priority<br />
</p>

<p>
for t, u in R:<br />
    t[A1, &#x2026;, An] = u[A1, &#x2026;, An] =&gt; t[B1, &#x2026;, Bn] = u[B1, &#x2026;, Bn]<br />
</p>

<p>
A1, &#x2026;, An -&gt; B1, &#x2026;, Bn<br />
</p>

<p>
\bar{A} -&gt; \bar{B}<br />
</p>

<p>
SSN -&gt; sName<br />
SSN -&gt; address (assume students don't work)<br />
HScode -&gt; HSname, HScity<br />
HSname, HScity -&gt; HScode (assume no schools with same name in the same city)<br />
</p>

<p>
SSN -&gt; GPA<br />
GPA -&gt; priority<br />
SSN -&gt; priority<br />
</p>

<p>
transitivity<br />
</p>

<p>
Apply(SSN, cName, state, date, major)<br />
</p>

<p>
cName -&gt; date<br />
SSN, cName -&gt; major<br />
</p>

<p>
SSN -&gt; state<br />
</p>

<p>
Functional Dependencies and Keys<br />
</p>

<p>
R(\bar{A}, \bar{B})<br />
</p>

<p>
Trivial Functional Dependency<br />
</p>

<p>
\bar{A} -&gt; \bar{B},  \bar{B} subset \bar{A}<br />
</p>

<p>
Nontrivial FD<br />
\bar{A} -&gt; \bar{B},  \bar{B} not subset \bar{A}<br />
</p>

<p>
Completely nontrivial FD (most interested)<br />
A -&gt; B, A intersect B = empty set<br />
</p>

<p>
Splitting rule<br />
</p>

<p>
\bar{A} -&gt; B1, B2, &#x2026;, Bm<br />
=&gt; \bar{A} -&gt; B1, \bar{A} -&gt; B2, &#x2026;<br />
</p>

<p>
Combining rule<br />
</p>

<p>
\bar{A} -&gt; B1<br />
\bar{A} -&gt; B2<br />
&#x2026;<br />
=&gt; \bar{A} -&gt; B1, B2, &#x2026;, Bn<br />
</p>

<p>
Trivial-dependency rules<br />
</p>

<p>
A -&gt; B, then A -&gt; A union B<br />
</p>

<p>
A -&gt; B, then A -&gt; A intersect B<br />
</p>

<p>
Transitive rule<br />
</p>

<p>
A -&gt; B, B -&gt; C, then A -&gt; C<br />
</p>

<p>
Closure of Attributes<br />
  Given relations, FDs, set of attributes \bar{A}<br />
  Find all B such that \bar{A} -&gt; B<br />
</p>

<p>
\bar{A}^+<br />
</p>

<p>
apply transitive rule repeatedly to get the closure<br />
</p>

<p>
if \bar{A}^+ = all attrs, then \bar{A} is a key.<br />
</p>

<p>
Grow algorithms can be used to find all keys given a set of FDs.<br />
</p>

<p>
If \bar{A} is a key, then all its supersets are keys.  Hence, we are<br />
often only interested the smallest key.<br />
</p>

<p>
Specifying FDs for a relation<br />
  S1 and S2 sets of FDs<br />
  S2 "follows from" S1 if every relation instance<br />
  satisfying S1 also satisfies S2<br />
</p>

<p>
S2: {SSN -&gt; priority}<br />
S1: {SSN -&gt; GPA, GPA -&gt; priority}<br />
</p>

<p>
Does A -&gt; B follow from S?<br />
</p>

<p>
(1) A+ based S check if B in set.<br />
(2) Armstrong's Axioms<br />
</p>

<p>
Want: <span class="underline">Minimal</span> set of <span class="underline">completely nontrivial</span> FDs such that <span class="underline">all FDs</span> that<br />
hold on the relation follow from the dependencies in this set<br />
</p>
</div>
</div>

<div id="outline-container-org06acf8c" class="outline-4">
<h4 id="org06acf8c"><span class="section-number-4">4.1.3</span> <span class="done DONE">DONE</span> Boyce-Codd Normal Form</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Decomposition of a relational schema<br />
R(A1, &#x2026;, An)<br />
R1(B1, &#x2026;, Bk)<br />
R2(C1, &#x2026;, Cm)<br />
</p>

<p>
B union C = A<br />
</p>

<p>
R1 natural join R2 = R<br />
</p>

<p>
Student(SSN, sName, address, HScode, HSname, HScity, GPA, priority)<br />
</p>

<p>
This is a decomposition.<br />
S1(SSN, sName, address, HScode, GPA, priority)<br />
S2(HScode, HSname, HScity)<br />
</p>

<p>
This is not a decomposition.<br />
S1(SSN, sName, address, HScode, HSname, HScity)<br />
S2(sName, HSname, GPA, priority)<br />
</p>

<p>
Good decomposition exhibits lossless join property.<br />
</p>

<p>
BCNF<br />
Relation R with FDs is in BCNR if:<br />
    For each \bar{A} -&gt; B, \bar{A} is a key.<br />
    BCNF violation (redundancy, update/delete anomalies)<br />
</p>

<p>
note: a key can contain another key and thus is a super key.<br />
</p>

<p>
BCNF decomposition algorithm<br />
</p>

<p>
Input: relation R + FDs for R<br />
Output: decomposition of R into BCNF relations with "lossless join"<br />
</p>

<p>
Compute keys for R<br />
Repeat until all relations are in BCNF<br />
    Pick any R' with A -&gt; B that violates BCNF<br />
    Decompose R' into R1(A, B) and R2(A, rest)<br />
    Compute FDs for R1 and R2<br />
    Compute keys for R1 and R2<br />
</p>

<p>
Randomness can result in different answer.<br />
We can extend A -&gt; BA+<br />
</p>
</div>
</div>

<div id="outline-container-org4169027" class="outline-4">
<h4 id="org4169027"><span class="section-number-4">4.1.4</span> <span class="done DONE">DONE</span> Multivalued Dependencies and 4th Normal Form</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
Fourth Normal Form subsets Boyce-Codd Normal Form<br />
R  \bar{A} -&gt;&gt; \bar{B}  A1, &#x2026;, An, B1, &#x2026;, Bn<br />
</p>

<p>
for all t, u in R: t[\bar{A}] = u[\bar{A}] then<br />
    there exists v in R: v[\bar{A}] = t[\bar{A}] and<br />
                         v[\bar{B}] = t[\bar{B}] and<br />
                         v[rest] = u[rest]<br />
</p>

<p>
Tuple-generating dependencies<br />
</p>

<p>
\bar{A} -&gt;&gt; \bar{B} implies \bar{A} -&gt;&gt; rest<br />
</p>

<p>
Trivial Multivalued Dependency<br />
</p>

<p>
A -&gt;&gt; B   B subset A or  A union B = all attrs<br />
</p>

<p>
A -&gt; B implies A -&gt;&gt; B<br />
</p>

<p>
FD-is-an-MVD rule<br />
</p>

<p>
4NF implies BCNF<br />
</p>

<p>
Intersection rule<br />
A -&gt;&gt; B, A -&gt;&gt; C then A -&gt;&gt; B intersect C<br />
</p>

<p>
Transitive rule<br />
A -&gt;&gt; B, B -&gt;&gt; C then A -&gt;&gt; C - B<br />
</p>

<p>
Fourth Normal Form<br />
</p>

<p>
Relation R with MVDs is in 4NF if:<br />
    For each nontrivial A -&gt;&gt; B, A is a key<br />
</p>
</div>
</div>

<div id="outline-container-org78a54f0" class="outline-4">
<h4 id="org78a54f0"><span class="section-number-4">4.1.5</span> <span class="done DONE">DONE</span> Shortcomings of BCNF/4NF</h4>
</div>
</div>

<div id="outline-container-orga7779c2" class="outline-3">
<h3 id="orga7779c2"><span class="section-number-3">4.2</span> <span class="done DONE">DONE</span> Exercises</h3>
<div class="outline-text-3" id="text-4-2">
<p>
R(A,B)<br />
<del>R(A,C,D)</del><br />
R(A,C)<br />
R(C,D)<br />
</p>

<p>
R(C,D)<br />
<del>R(A,B,C)</del><br />
R(A,B)<br />
R(A,C)<br />
</p>

<p>
R(B,C)<br />
<del>R(A,B,D)</del><br />
R(A,B)<br />
R(A,D)<br />
</p>
</div>
</div>
</div>


<div id="outline-container-orgccfc649" class="outline-2">
<h2 id="orgccfc649"><span class="section-number-2">5</span> <span class="done DONE">DONE</span> <a href="https://lagunita.stanford.edu/courses/DB/UML/SelfPaced/courseware/ch-unified_modeling_language/">Unified Modeling Language</a> mini-course</h2>
<div class="outline-text-2" id="text-5">
</div>
