notes/intro_db.org
*** DONE UML Data Modeling
   CLOSED: [2017-08-02 Wed 01:46]
Entity-Relationship Model (E/R)
Unified Modeling Language
  Data modeling subset

Both are graphical
Both can be translated to relations automatically
  Or semi-automatically

UML Data Modeling: 5 concepts

1) Classes
2) Associations
3) Association Classes
4) Subclasses
5) Composition & Aggregation


Classes

Name, attributes, methods
  For data modeling: add "pk", drop methods

#+BEGIN_SRC uml
|-----------|
|  Student  |
|-----------|
| sID    pk |
| sName     |
| GPA       |
|-----------|
| <methods> |
|-----------|

|-----------|
| College   |
|-----------|
| cName  pk |
| state     |
|-----------|
| <methods> |
|-----------|
#+END_SRC

Relationships between objects of two classes

#+BEGIN_SRC uml
|-----------|           |-----------|
|  Student  |           | College   |
|-----------|  Applied  |-----------|
| sID    pk |-----------| cName  pk |
| sName     |          | state     |
| GPA       |           |-----------|
|-----------|           | <methods> |
| <methods> |           |-----------|
|-----------|
#+END_SRC

Multiplicity of Associations

Each object of class C1 is related to at least m and at most n objects
of class C2

#+BEGIN_SRC
|----|                |----|
| C1 |                | C2 |
|----|        m..n    |----|
|    |----------------|    |
|----|      A         |----|
#+END_SRC

m..* at least m
0..n at most n
0..* no restrictions

the default is 1..1

1..1 abbreviated as 1
0..* abbreviated as *

Students must apply somewhere and may not apply to more than 5
colleges.  No college takes more than 20,000 applications.

#+BEGIN_SRC uml
|-----------|                   |-----------|
|  Student  |                   | College   |
|-----------| 0..20000     1..5 |-----------|
| sID    pk |-------------------| cName  pk |
| sName     |      Applied      | state     |
| GPA       |                   |-----------|
|-----------|                   | <methods> |
| <methods> |                   |-----------|
|-----------|
#+END_SRC

Types of relationships

One-to-One           0..1  0..1
Many-to-One          *     0..1
Many-to-Many         *     *
Complete             1..   1..

Default is complete one-to-one


Association Classses

Relationships between objects of two classes,
with attributes on relationshps

#+BEGIN_SRC uml
|-----------|                          |-----------|
|  Student  |                          | College   |
|-----------|        Applied           |-----------|
| sID    pk |--------------------------| cName  pk |
| sName     |           |              | state     |
| GPA       |      |----------|        |-----------|
|-----------|      | AppInfo  |        | <methods> |
| <methods> |      |----------|        |-----------|
|-----------|      | date     |
                   | decision |
                   |----------|
#+END_SRC

It's hard to have more than one relationship association between the
same student and college.

Eliminating Association Classes
Unnecessary if 0..1 or 1..1 multiplicity

#+BEGIN_SRC uml
|----|                |----|
| C1 |                | C2 |
|----| *         1..1 |----|
| A3 |----------------| A4 |
|----|       |        |----|
           |----|
           | AC |
           |----|
           | A1 |
           | A2 |
           |----|
#+END_SRC

Self-Associations

Associations between a class and itself

#+BEGIN_SRC uml
|---------|
| Student |*
|---------|-----|
|         |*    | Sibling
|---------|-----|


|---------|
| College |home
|---------|------|
|         |1..1  | Branch
|         |0..10 |
|---------|------|
           Satellite
#+END_SRC

Subclasses

#+BEGIN_SRC uml
                    |---------|
                    | Student |  Superclass
                    |---------|  {complete, overlapping}
                    | sID  pk |
                    | sName   |
                    | GPA     |
                    |---------|
                          inherit
     |--------------------------------------|
     |                   |                  |
|----------|     |-----------|    |------------|                |------------|
| ForeignS |     | DomesticS |    | APStudents |                | APCourse   |
|----------|     |-----------|    |------------|     Took       |------------|
| Country  |     | State     |    |            |----------------| Course# pk |
|          |     | SSN       |    |            |1..*   |   1..10| title      |
|----------|     |-----------|    |------------|       |        | units      |
                                                       |        |------------|
                                                   |--------|
                                                   | APInfo |
                                                   |--------|
                                                   | year   |
                                                   | grade  |
                                                   |--------|
#+END_SRC

Superclass = Generalization
Subclass = Specialization

Incomplete (Partial) vs. Complete

Complete: every obj in the superclass is in at least one subclass

Disjoint (Exclusive) vs. Overlapping

Disjoint: every obj in the superclass is in at most one subclass


Composition & Aggregation

Objects of one class belong to objects of another class

#+BEGIN_SRC uml
|----------|               |------------|
| College  |               | Department |
|----------| 1..1          |------------|
| cName pk |--------------| dName      |
| state    |-------|      | building   |
|----------| 0..1   |      |------------|
                    |
               |-----------|
               | Apartment |
               |-----------|
               | addr pk   |
               | #units    |
               |-----------|
#+END_SRC

The symbol  indicates composition, implicitly specifying 1..1.
Department belongs to College.

The symbol  indicates aggregation, implicitly specifying 0..1.
Some apartments are owned by or associated with colleges, but not all
of them are.

