notes/intro_db.html
<div id="outline-container-orge5ff558" class="outline-3">
<h3 id="orge5ff558"><span class="section-number-3">5.1</span> <span class="done DONE">DONE</span> Lecture Videos</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgf45479a" class="outline-4">
<h4 id="orgf45479a"><span class="section-number-4">5.1.1</span> <span class="done DONE">DONE</span> UML Data Modeling</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Entity-Relationship Model (E/R)<br />
Unified Modeling Language<br />
  Data modeling subset<br />
</p>

<p>
Both are graphical<br />
Both can be translated to relations automatically<br />
  Or semi-automatically<br />
</p>

<p>
UML Data Modeling: 5 concepts<br />
</p>

<ol class="org-ol">
<li>Classes<br /></li>
<li>Associations<br /></li>
<li>Association Classes<br /></li>
<li>Subclasses<br /></li>
<li>Composition &amp; Aggregation<br /></li>
</ol>


<p>
Classes<br />
</p>

<p>
Name, attributes, methods<br />
  For data modeling: add "pk", drop methods<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|-----------|
|  Student  |
|-----------|
| sID    pk |
| sName     |
| GPA       |
|-----------|
| &lt;methods&gt; |
|-----------|

|-----------|
| College   |
|-----------|
| cName  pk |
| state     |
|-----------|
| &lt;methods&gt; |
|-----------|
</pre>
</div>

<p>
Relationships between objects of two classes<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|-----------|           |-----------|
|  Student  |           | College   |
|-----------|  Applied  |-----------|
| sID    pk |-----------| cName  pk |
| sName     |          | state     |
| GPA       |           |-----------|
|-----------|           | &lt;methods&gt; |
| &lt;methods&gt; |           |-----------|
|-----------|
</pre>
</div>

<p>
Multiplicity of Associations<br />
</p>

<p>
Each object of class C1 is related to at least m and at most n objects<br />
of class C2<br />
</p>

<pre class="example">
|----|                |----|
| C1 |                | C2 |
|----|        m..n    |----|
|    |----------------|    |
|----|      A         |----|
</pre>

<p>
m..* at least m<br />
0..n at most n<br />
0..* no restrictions<br />
</p>

<p>
the default is 1..1<br />
</p>

<p>
1..1 abbreviated as 1<br />
0..* abbreviated as *<br />
</p>

<p>
Students must apply somewhere and may not apply to more than 5<br />
colleges.  No college takes more than 20,000 applications.<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|-----------|                   |-----------|
|  Student  |                   | College   |
|-----------| 0..20000     1..5 |-----------|
| sID    pk |-------------------| cName  pk |
| sName     |      Applied      | state     |
| GPA       |                   |-----------|
|-----------|                   | &lt;methods&gt; |
| &lt;methods&gt; |                   |-----------|
|-----------|
</pre>
</div>

<p>
Types of relationships<br />
</p>

<p>
One-to-One           0..1  0..1<br />
Many-to-One          *     0..1<br />
Many-to-Many         *     *<br />
Complete             1..   1..<br />
</p>

<p>
Default is complete one-to-one<br />
</p>


<p>
Association Classses<br />
</p>

<p>
Relationships between objects of two classes,<br />
with attributes on relationshps<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|-----------|                          |-----------|
|  Student  |                          | College   |
|-----------|        Applied           |-----------|
| sID    pk |--------------------------| cName  pk |
| sName     |           |              | state     |
| GPA       |      |----------|        |-----------|
|-----------|      | AppInfo  |        | &lt;methods&gt; |
| &lt;methods&gt; |      |----------|        |-----------|
|-----------|      | date     |
                   | decision |
                   |----------|
</pre>
</div>

<p>
It's hard to have more than one relationship association between the<br />
same student and college.<br />
</p>

<p>
Eliminating Association Classes<br />
Unnecessary if 0..1 or 1..1 multiplicity<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|----|                |----|
| C1 |                | C2 |
|----| *         1..1 |----|
| A3 |----------------| A4 |
|----|       |        |----|
           |----|
           | AC |
           |----|
           | A1 |
           | A2 |
           |----|
</pre>
</div>

<p>
Self-Associations<br />
</p>

<p>
Associations between a class and itself<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|---------|
| Student |*
|---------|-----|
|         |*    | Sibling
|---------|-----|


|---------|
| College |home
|---------|------|
|         |1..1  | Branch
|         |0..10 |
|---------|------|
           Satellite
</pre>
</div>

<p>
Subclasses<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">                    |---------|
                    | Student |  Superclass
                    |---------|  {complete, overlapping}
                    | sID  pk |
                    | sName   |
                    | GPA     |
                    |---------|
                          inherit
     |--------------------------------------|
     |                   |                  |
|----------|     |-----------|    |------------|                |------------|
| ForeignS |     | DomesticS |    | APStudents |                | APCourse   |
|----------|     |-----------|    |------------|     Took       |------------|
| Country  |     | State     |    |            |----------------| Course# pk |
|          |     | SSN       |    |            |1..*   |   1..10| title      |
|----------|     |-----------|    |------------|       |        | units      |
                                                       |        |------------|
                                                   |--------|
                                                   | APInfo |
                                                   |--------|
                                                   | year   |
                                                   | grade  |
                                                   |--------|
</pre>
</div>

<p>
Superclass = Generalization<br />
Subclass = Specialization<br />
</p>

<p>
Incomplete (Partial) vs. Complete<br />
</p>

<p>
Complete: every obj in the superclass is in at least one subclass<br />
</p>

<p>
Disjoint (Exclusive) vs. Overlapping<br />
</p>

<p>
Disjoint: every obj in the superclass is in at most one subclass<br />
</p>


<p>
Composition &amp; Aggregation<br />
</p>

<p>
Objects of one class belong to objects of another class<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|----------|               |------------|
| College  |               | Department |
|----------| 1..1          |------------|
| cName pk |--------------| dName      |
| state    |-------|      | building   |
|----------| 0..1   |      |------------|
                    |
               |-----------|
               | Apartment |
               |-----------|
               | addr pk   |
               | #units    |
               |-----------|
</pre>
</div>

<p>
The symbol  indicates composition, implicitly specifying 1..1.<br />
Department belongs to College.<br />
</p>

<p>
The symbol  indicates aggregation, implicitly specifying 0..1.<br />
Some apartments are owned by or associated with colleges, but not all<br />
of them are.<br />
</p>
</div>
</div>
