notes/intro_db.org
*** DONE UML to Relations
    CLOSED: [2017-08-06 Sun 18:04]
High-Level Database Design Model
  User-friendly (graphical) specification language
  Translated into model of DBMS

Designs can be translated to relations automatically
  Provided every "regular" class has a key

Every class becomes a relation: pk -> primary key

Associations

Relation with key from each side

Applied(sID, cName)

Keys for association relations depends on multiplicity

#+BEGIN_SRC uml
|-------|                      |-------|
|  C1   |                      |  C2   |
|-------| 0..1               * |-------|
| K1 pk |----------------------| K2 pk |
| O1    |          A           | O2    |
|-------|                      |-------|
#+END_SRC

C1(_K1_, O1)
C2(_K2_, O2)

A(K1, _K2_)

#+BEGIN_SRC uml
|-----------|                          |-----------|
|  Student  |                          | College   |
|-----------| *      Applied     1..1  |-----------|
| sID    pk |--------------------------| cName  pk |
| sName     |           |              | state     |
| GPA       |      |----------|        |-----------|
|-----------|      | AppInfo  |        | <methods> |
| <methods> |      |----------|        |-----------|
|-----------|      | date     |
                   | decision |
                   |----------|
#+END_SRC

Applied(_sID_, cName)

C1(_K1_, O1)
C2(_K2_, O2)  <-- C2(_K2_, O2, K1)
+A(K1, _K2_)+

Student(_sID_, sName, GPA)  <-- Student(_sID_, sName, GPA, cName)
College(_cName_, state)
+Applied(_sID_, cName)+

Association Classes

Student(_sID_, sName, GPA)
College(_cName_, state)
Applied(_sID_, cName, date, decision)

Require a key for every "regular" class.

Self-Associations

#+BEGIN_SRC uml
|---------|
| Student |*
|---------|-----|
|         |*    | Sibling
|---------|-----|
#+END_SRC


Student(_sID_, sName, GPA)
Sibling(_sID1, sID2_)

#+BEGIN_SRC uml
|----------|
| College  | home
|----------|-------|
| cName pk | 1..1  | Branch
| state    |       |
| enr      | 0..10 |
|----------|-------|
             Satellite
#+END_SRC

College(_cName_, state, enr)
Branch(home, _satellite_)

College(_cName_, state, enr, home) ???


Subclasses
1) Subclass relations contain superclass key + specialized attrs.
2) Subclass relations contain all attributes.
3) One relation containing all superclass + subclass attrs.

subclasses are not regular classes.

#+BEGIN_SRC uml
                        |-------|
                        |   S   |  superclass
                        |-------|
                        | K  pk |
                        | A     |
                        |-------|
                                               Subclasses
      |---------------------+-------------------|
      |                                         |
   |----|                                     |----|
   | S1 |                                     | S2 |
   |----|                                     |----|
   | B  |                                     | C  |
   |----|                                     |----|
#+END_SRC

1) S(_K_, A), S1(_K_, B), S2(_K_, C)
2) S(_K_, A), S1(_K_, A, B), S2(_K_, A, C)
3) S(_K_, A, B, C)

Heavily overlapping => design 3

Disjoint, Complete => design 2 with S(_K_, A) discarded

#+BEGIN_SRC uml
                    |---------|
                    | Student |  Superclass
                    |---------|  {complete, overlapping}
                    | sID  pk |
                    | sName   |
                    | GPA     |
                    |---------|
                          inherit
     |--------------------------------------|
     |                   |                  |
|----------|     |-----------|    |------------|                |------------|
| ForeignS |     | DomesticS |    | APStudents |                | APCourse   |
|----------|     |-----------|    |------------|     Took       |------------|
| Country  |     | State     |    |            |----------------| Course# pk |
|          |     | SSN    pk |    |            |1..*   |   1..10| title      |
|----------|     |-----------|    |------------|       |        | units      |
                                                       |        |------------|
                                                   |--------|
                                                   | APInfo |
                                                   |--------|
                                                   | year   |
                                                   | grade  |
                                                   |--------|
#+END_SRC

Student(_sID_, sName)
ForeignS(_sID_, Country)
DomesticS(_sID_, State, _SSN_)
+APStudent(sID)+ <-- eliminated, implicated in Took
APCourse(_Course#_, title, units)
Took(_sID, Course#_, year, grade)

Composition & Aggregation

#+BEGIN_SRC uml
|----------|               |------------|
| College  |               | Department |
|----------| 1..1          |------------|
| cName pk |--------------| dName      | Not "regular"
| state    |-------|      | building   |
|----------| 0..1   |      |------------|
                    |
               |-----------|
               | Apartment |
               |-----------|
               | addr pk   |
               | #units    |
               |-----------|
#+END_SRC

College(_cName_, state)
Department(dName, building, _cName_)
Apartment(_addr_, #units, cName)
                            
                          nullable

** DONE Exercises


* DONE [[https://lagunita.stanford.edu/courses/DB/Indexes/SelfPaced/courseware/ch-indexes/][Indexes and Transactions]] mini-course
  CLOSED: [2017-08-24 Thu 01:56]
  :PROPERTIES:
  :VISIBILITY: FOLDED
  :END:
** DONE Lecture Videos
   CLOSED: [2017-08-24 Thu 01:54]
