notes/intro_db.html

<div id="outline-container-org53b0a5c" class="outline-4">
<h4 id="org53b0a5c"><span class="section-number-4">5.1.2</span> <span class="done DONE">DONE</span> UML to Relations</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
High-Level Database Design Model<br />
  User-friendly (graphical) specification language<br />
  Translated into model of DBMS<br />
</p>

<p>
Designs can be translated to relations automatically<br />
  Provided every "regular" class has a key<br />
</p>

<p>
Every class becomes a relation: pk -&gt; primary key<br />
</p>

<p>
Associations<br />
</p>

<p>
Relation with key from each side<br />
</p>

<p>
Applied(sID, cName)<br />
</p>

<p>
Keys for association relations depends on multiplicity<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|-------|                      |-------|
|  C1   |                      |  C2   |
|-------| 0..1               * |-------|
| K1 pk |----------------------| K2 pk |
| O1    |          A           | O2    |
|-------|                      |-------|
</pre>
</div>

<p>
C1(_K1_, O1)<br />
C2(_K2_, O2)<br />
</p>

<p>
A(K1, <span class="underline">K2</span>)<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|-----------|                          |-----------|
|  Student  |                          | College   |
|-----------| *      Applied     1..1  |-----------|
| sID    pk |--------------------------| cName  pk |
| sName     |           |              | state     |
| GPA       |      |----------|        |-----------|
|-----------|      | AppInfo  |        | &lt;methods&gt; |
| &lt;methods&gt; |      |----------|        |-----------|
|-----------|      | date     |
                   | decision |
                   |----------|
</pre>
</div>

<p>
Applied(_sID_, cName)<br />
</p>

<p>
C1(_K1_, O1)<br />
C2(_K2_, O2)  &lt;&#x2013; C2(_K2_, O2, K1)<br />
<del>A(K1, <span class="underline">K2</span>)</del><br />
</p>

<p>
Student(_sID_, sName, GPA)  &lt;&#x2013; Student(_sID_, sName, GPA, cName)<br />
College(_cName_, state)<br />
<del>Applied(_sID_, cName)</del><br />
</p>

<p>
Association Classes<br />
</p>

<p>
Student(_sID_, sName, GPA)<br />
College(_cName_, state)<br />
Applied(_sID_, cName, date, decision)<br />
</p>

<p>
Require a key for every "regular" class.<br />
</p>

<p>
Self-Associations<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|---------|
| Student |*
|---------|-----|
|         |*    | Sibling
|---------|-----|
</pre>
</div>


<p>
Student(_sID_, sName, GPA)<br />
Sibling(_sID1, sID2_)<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|----------|
| College  | home
|----------|-------|
| cName pk | 1..1  | Branch
| state    |       |
| enr      | 0..10 |
|----------|-------|
             Satellite
</pre>
</div>

<p>
College(_cName_, state, enr)<br />
Branch(home, <span class="underline">satellite</span>)<br />
</p>

<p>
College(_cName_, state, enr, home) ???<br />
</p>


<p>
Subclasses<br />
</p>
<ol class="org-ol">
<li>Subclass relations contain superclass key + specialized attrs.<br /></li>
<li>Subclass relations contain all attributes.<br /></li>
<li>One relation containing all superclass + subclass attrs.<br /></li>
</ol>

<p>
subclasses are not regular classes.<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">                     |-------|
                     |   S   |  superclass
                     |-------|
                     | K  pk |
                     | A     |
                     |-------|
                                            Subclasses
   |---------------------+-------------------|
   |                                         |
|----|                                     |----|
| S1 |                                     | S2 |
|----|                                     |----|
| B  |                                     | C  |
|----|                                     |----|
</pre>
</div>

<ol class="org-ol">
<li>S(_K_, A), S1(_K_, B), S2(_K_, C)<br /></li>
<li>S(_K_, A), S1(_K_, A, B), S2(_K_, A, C)<br /></li>
<li>S(_K_, A, B, C)<br /></li>
</ol>

<p>
Heavily overlapping =&gt; design 3<br />
</p>

<p>
Disjoint, Complete =&gt; design 2 with S(_K_, A) discarded<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">                    |---------|
                    | Student |  Superclass
                    |---------|  {complete, overlapping}
                    | sID  pk |
                    | sName   |
                    | GPA     |
                    |---------|
                          inherit
     |--------------------------------------|
     |                   |                  |
|----------|     |-----------|    |------------|                |------------|
| ForeignS |     | DomesticS |    | APStudents |                | APCourse   |
|----------|     |-----------|    |------------|     Took       |------------|
| Country  |     | State     |    |            |----------------| Course# pk |
|          |     | SSN    pk |    |            |1..*   |   1..10| title      |
|----------|     |-----------|    |------------|       |        | units      |
                                                       |        |------------|
                                                   |--------|
                                                   | APInfo |
                                                   |--------|
                                                   | year   |
                                                   | grade  |
                                                   |--------|
</pre>
</div>

<p>
Student(_sID_, sName)<br />
ForeignS(_sID_, Country)<br />
DomesticS(_sID_, State, <span class="underline">SSN</span>)<br />
<del>APStudent(sID)</del> &lt;&#x2013; eliminated, implicated in Took<br />
APCourse(_Course#_, title, units)<br />
Took(_sID, Course#_, year, grade)<br />
</p>

<p>
Composition &amp; Aggregation<br />
</p>

<div class="org-src-container">
<pre class="src src-uml">|----------|               |------------|
| College  |               | Department |
|----------| 1..1          |------------|
| cName pk |--------------| dName      | Not "regular"
| state    |-------|      | building   |
|----------| 0..1   |      |------------|
                    |
               |-----------|
               | Apartment |
               |-----------|
               | addr pk   |
               | #units    |
               |-----------|
</pre>
</div>

<p>
College(_cName_, state)<br />
Department(dName, building, <span class="underline">cName</span>)<br />
Apartment(_addr_, #units, cName)<br />
                            <br />
                          nullable<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgc883a97" class="outline-3">
<h3 id="orgc883a97"><span class="section-number-3">5.2</span> <span class="done DONE">DONE</span> Exercises</h3>
</div>
</div>


<div id="outline-container-orga9a75d5" class="outline-2">
<h2 id="orga9a75d5"><span class="section-number-2">6</span> <span class="done DONE">DONE</span> <a href="https://lagunita.stanford.edu/courses/DB/Indexes/SelfPaced/courseware/ch-indexes/">Indexes and Transactions</a> mini-course</h2>
<div class="outline-text-2" id="text-6">
</div>
