notes/intro_db.org
*** DONE Indexes
    CLOSED: [2017-08-20 Sun 16:12]

Indexes
  * Primary mechanism to get improved performance
  * Persistent data structure, stored in database
  * Many interesting implementation issues


             |   | A   |   B | C   |
             |---+-----+-----+-----|
             | 1 | cat |   2 | ... |
             |---+-----+-----+-----|
             | 2 | dog |   5 | ... |
             |---+-----+-----+-----|
             | 3 | cow |   1 | ... |
             |---+-----+-----+-----|
             | 4 | dog |   9 | ... |
             |---+-----+-----+-----|
             | 5 | cat |   2 | ... |
             |---+-----+-----+-----|
             | 6 | cat |   8 | ... |
             |---+-----+-----+-----|
             | 7 | cow |   6 | ... |
             |---+-----+-----+-----|
             |   | ... | ... | ... |

Index on T.A

T.A = 'cow'
T.A = 'cat'

Index on T.B

T.B = 2
T.B < 6
4 < T.B <= 8

Index on T.(A, B)

T.A = 'cat' and T.B > 5
T.A < 'd' and T.B = 1

Utility
  * Index = difference between full table scans and immediate location
    of tuples
    - Orders of magnitude performance difference

  * Underlying data structures
    - Balanced trees (B trees, B+ trees)
      + A = V, A < V, V1 <= A <= V2
      + logarithmic time
    - Hash tables
      + constant time

#+BEGIN_SRC sql
Select sName
From student
Where sID = 18942
#+END_SRC

Index on sID

Many DBMS's build indexes automatically on PRIMARY KEY (and sometimes
UNIQUE) attributes

#+BEGIN_SRC sql
Select sID
From Student
Where sName = 'Mary' And GPA > 3.9
#+END_SRC

Index on sName  hash or tree
Index on GPA  tree-based
Index on (sName, GPA)

#+BEGIN_SRC sql
Select sName, cName
From Student, Apply
Where Student.sID = Apply.sID
#+END_SRC

Index on student.sid or apply.sid or both

Query planning & optimization


Downsides of Indexes

1) Extra space - marginal
2) Index creation - medium
3) Index maintenance - can offset benefits

Picking which indexes to create

Benefits of an index depends on:
  * Size of table (and possibly layout)
  * Data distributions
  * Query vs. update load


"Physical design advisors"

Input: database (statistics) and workload
Output: recommended indexes

_Query Optimizer_ takes _Database statistics_, _Query or update_, and
_indexes_ as input and gives _best execution plan with estimated cost_
as output.

Pysical design advisor experiments different indexes through query
optimizer and gives recommended indexes, of which benefits outweigh
drawbacks.

#+BEGIN_SRC sql
Create Index IndexName on T(A)
Create Index IndexName on T(A1, A2, ..., An)
Create Unique Index IndexNae on T(A)
Drop Index IndexName
#+END_SRC

