notes/intro_db.html
<div id="outline-container-orgd8737a6" class="outline-3">
<h3 id="orgd8737a6"><span class="section-number-3">6.1</span> <span class="done DONE">DONE</span> Lecture Videos</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org54d8103" class="outline-4">
<h4 id="org54d8103"><span class="section-number-4">6.1.1</span> <span class="done DONE">DONE</span> Indexes</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
Indexes<br />
</p>
<ul class="org-ul">
<li>Primary mechanism to get improved performance<br /></li>
<li>Persistent data structure, stored in database<br /></li>
<li>Many interesting implementation issues<br /></li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-right">B</th>
<th scope="col" class="org-left">C</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">cat</td>
<td class="org-right">2</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">dog</td>
<td class="org-right">5</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-left">cow</td>
<td class="org-right">1</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-left">dog</td>
<td class="org-right">9</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">5</td>
<td class="org-left">cat</td>
<td class="org-right">2</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">6</td>
<td class="org-left">cat</td>
<td class="org-right">8</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">7</td>
<td class="org-left">cow</td>
<td class="org-right">6</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#x2026;</td>
<td class="org-right">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>

<p>
Index on T.A<br />
</p>

<p>
T.A = 'cow'<br />
T.A = 'cat'<br />
</p>

<p>
Index on T.B<br />
</p>

<p>
T.B = 2<br />
T.B &lt; 6<br />
4 &lt; T.B &lt;= 8<br />
</p>

<p>
Index on T.(A, B)<br />
</p>

<p>
T.A = 'cat' and T.B &gt; 5<br />
T.A &lt; 'd' and T.B = 1<br />
</p>

<p>
Utility<br />
</p>
<ul class="org-ul">
<li>Index = difference between full table scans and immediate location<br />
of tuples<br />
<ul class="org-ul">
<li>Orders of magnitude performance difference<br /></li>
</ul></li>

<li>Underlying data structures<br />
<ul class="org-ul">
<li>Balanced trees (B trees, B+ trees)<br />
<ul class="org-ul">
<li>A = V, A &lt; V, V1 &lt;= A &lt;= V2<br /></li>
<li>logarithmic time<br /></li>
</ul></li>
<li>Hash tables<br />
<ul class="org-ul">
<li>constant time<br /></li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Select</span> sName
<span class="org-keyword">From</span> student
<span class="org-keyword">Where</span> sID = 18942
</pre>
</div>

<p>
Index on sID<br />
</p>

<p>
Many DBMS's build indexes automatically on PRIMARY KEY (and sometimes<br />
UNIQUE) attributes<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Select</span> sID
<span class="org-keyword">From</span> Student
<span class="org-keyword">Where</span> sName = <span class="org-string">'Mary'</span> <span class="org-keyword">And</span> GPA &gt; 3.9
</pre>
</div>

<p>
Index on sName  hash or tree<br />
Index on GPA  tree-based<br />
Index on (sName, GPA)<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Select</span> sName, cName
<span class="org-keyword">From</span> Student, Apply
<span class="org-keyword">Where</span> Student.sID = Apply.sID
</pre>
</div>

<p>
Index on student.sid or apply.sid or both<br />
</p>

<p>
Query planning &amp; optimization<br />
</p>


<p>
Downsides of Indexes<br />
</p>

<ol class="org-ol">
<li>Extra space - marginal<br /></li>
<li>Index creation - medium<br /></li>
<li>Index maintenance - can offset benefits<br /></li>
</ol>

<p>
Picking which indexes to create<br />
</p>

<p>
Benefits of an index depends on:<br />
</p>
<ul class="org-ul">
<li>Size of table (and possibly layout)<br /></li>
<li>Data distributions<br /></li>
<li>Query vs. update load<br /></li>
</ul>


<p>
"Physical design advisors"<br />
</p>

<p>
Input: database (statistics) and workload<br />
Output: recommended indexes<br />
</p>

<p>
<span class="underline">Query Optimizer</span> takes <span class="underline">Database statistics</span>, <span class="underline">Query or update</span>, and<br />
<span class="underline">indexes</span> as input and gives <span class="underline">best execution plan with estimated cost</span><br />
as output.<br />
</p>

<p>
Pysical design advisor experiments different indexes through query<br />
optimizer and gives recommended indexes, of which benefits outweigh<br />
drawbacks.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Create</span> Index IndexName <span class="org-keyword">on</span> T(A)
<span class="org-keyword">Create</span> Index IndexName <span class="org-keyword">on</span> T(A1, A2, ..., An)
<span class="org-keyword">Create</span> <span class="org-keyword">Unique</span> Index IndexNae <span class="org-keyword">on</span> T(A)
<span class="org-keyword">Drop</span> Index IndexName
</pre>
</div>
</div>
</div>
