notes/intro_db.html

<div id="outline-container-orgddc7a7a" class="outline-4">
<h4 id="orgddc7a7a"><span class="section-number-4">6.1.2</span> <span class="done DONE">DONE</span> Introduction to Transactions</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Motivated by two independent requirements<br />
</p>
<ul class="org-ul">
<li>Concurrent database access<br /></li>
<li>Resilience to system failures<br /></li>
</ul>

<p>
<b>Concurrent Access</b>: Attribute-level Inconsistency <a id="org30f7a0f"></a><br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Update</span> College <span class="org-keyword">Set</span> enrollment = enrollment + 1000
<span class="org-keyword">Where</span> cName = <span class="org-string">'Stanford'</span>
</pre>
</div>
<p>
concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Update</span> College <span class="org-keyword">Set</span> enrollment = enrollment + 1500
Whre cName = <span class="org-string">'Stanford'</span>
</pre>
</div>

<p>
get; modify; put<br />
</p>

<p>
Possible outcomes<br />
</p>
\begin{align*}
  15,000 + 2500 &amp;= 17,500 \\
         + 1000 &amp;= 16,000 \\
         + 1500 &amp;= 16,500
\end{align*}

<p>
<b>Concurrent Access</b>: Tuple-level Inconsistency <a id="org680c063"></a><br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Update</span> Apply <span class="org-keyword">Set</span> major = <span class="org-string">'CS'</span> <span class="org-keyword">Where</span> sID = 123
</pre>
</div>
<p>
concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Update</span> Apply <span class="org-keyword">Set</span> decision = <span class="org-string">'Y'</span> <span class="org-keyword">Where</span> sID = 123
</pre>
</div>

<p>
get; modify; put<br />
</p>

<p>
both changes<br />
one of the two changes<br />
</p>

<p>
<b>Concurrent Access</b>: Table-level Inconsistency <a id="orge30b821"></a><br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Update</span> Apply <span class="org-keyword">Set</span> decision = <span class="org-string">'Y'</span>
<span class="org-keyword">Where</span> sID <span class="org-keyword">In</span> (<span class="org-keyword">Select</span> sID <span class="org-keyword">From</span> Student <span class="org-keyword">Where</span> GPA &gt; 3.9)
</pre>
</div>
<p>
concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql">Updaate Student <span class="org-keyword">Set</span> GPA = 1.1 * GPA <span class="org-keyword">Where</span> sizeHS &gt; 2500
</pre>
</div>

<p>
<b>Concurrent Access</b>: Multi-statement inconsistency <a id="org3370714"></a><br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Insert</span> <span class="org-keyword">Into</span> Archive
  <span class="org-keyword">Select</span> * <span class="org-keyword">From</span> Apply <span class="org-keyword">Where</span> decision = <span class="org-string">'N'</span>;
<span class="org-keyword">Delete</span> <span class="org-keyword">From</span> Apply <span class="org-keyword">Where</span> decision = <span class="org-string">'N'</span>;
</pre>
</div>
<p>
concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Select</span> <span class="org-builtin">Count</span>(*) <span class="org-keyword">From</span> Apply;
<span class="org-keyword">Select</span> <span class="org-builtin">Count</span>(*) <span class="org-keyword">From</span> Archive;
</pre>
</div>

<p>
Concurrency Goal<br />
</p>

<p>
Execute <i>sequence of SQL statements</i> so they appear to be running in<br />
isolation<br />
</p>

<ul class="org-ul">
<li>Simple solution: execute them in isolation<br /></li>
</ul>

<p>
But want to enable concurrency whenever safe to do so<br />
</p>

<ul class="org-ul">
<li>Multiprocessor<br /></li>
<li>Multithreaded<br /></li>
<li>Asynchronous I/O<br /></li>
</ul>

<p>
Resilience to System Failures<br />
</p>

<p>
Rather unpleasant inconsistent state can occur due to crashes when<br />
there bulk loading to DBMS<br />
</p>

<p>
Or<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Insert</span> <span class="org-keyword">Into</span> Archive
  <span class="org-keyword">Select</span> * <span class="org-keyword">From</span> Apply <span class="org-keyword">Where</span> decision = <span class="org-string">'N'</span>;
<span class="org-keyword">Delete</span> <span class="org-keyword">From</span> Apply <span class="org-keyword">Where</span> decision = <span class="org-string">'N'</span>;
</pre>
</div>

<p>
Crash failure<br />
</p>

<p>
Lots of updates buffered in memory<br />
</p>

<p>
System-Failure Goal<br />
</p>

<p>
Guarantee all-or-nothing execution, regardless of failures<br />
</p>

<p>
Solution for both concurrency and failures<br />
</p>

<p>
<b>Transactions</b><br />
</p>

<p>
A transaction is a sequence of one or more SQL operations treated as a<br />
unit<br />
</p>
<ul class="org-ul">
<li>Transactions appear to run in isolation<br /></li>
<li>If the system fails, each transaction's changes are reflected<br />
either entirely or not at all<br /></li>
</ul>

<p>
SQL standard:<br />
</p>
<ul class="org-ul">
<li>Transaction begins automatically on first SQL statement<br /></li>
<li>On "commit" transaction ends and new one begins<br /></li>
<li>Current transaction ends on session termination<br /></li>
<li>"Autocommit" turns each statement into transaction<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgc7211a9" class="outline-4">
<h4 id="orgc7211a9"><span class="section-number-4">6.1.3</span> <span class="done DONE">DONE</span> Transaction Properties</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
ACID Properties<br />
Atomicity, Consistency, Isolation, Durability<br />
</p>

<p>
Isolation<br />
</p>

<p>
<span class="underline">Serializability</span>  <a id="orgdf7c46f"></a><br />
Operations may be interleaved, but execution must be equivalent to<br />
<i>some</i> sequential (serial) order of all transactions<br />
</p>

<p>
locking portion of the database<br />
</p>

<p>
<a href="#org30f7a0f">Attribute-level Inconsistency</a><br />
</p>

<p>
T1; T2<br />
T2; T1<br />
</p>

<p>
15,000  17,500<br />
</p>

<p>
<a href="#org680c063">Tuple-level Inconsistency</a><br />
</p>

<p>
T1; T2<br />
T2; T1<br />
</p>

<p>
both changes<br />
</p>

<p>
<a href="#orge30b821">Table-level Inconsistency</a><br />
</p>

<p>
T1; T2<br />
T2; T1<br />
</p>

<p>
Order matters here.<br />
</p>

<p>
<a href="#org3370714">Multi-statement inconsistency</a><br />
</p>

<p>
Order also matters here.<br />
</p>

<p>
Durability<br />
</p>

<p>
If system crashes after transaction commits, all effects of<br />
transaction remain in database.<br />
</p>

<p>
T2 {S1; S2; S3; commit} crashes<br />
</p>

<p>
implemented by logging<br />
</p>

<p>
Atomicity<br />
</p>

<p>
Each transaction is "all-or-nothing," never left half done<br />
</p>

<p>
T2 { S1; S2; &#x2026; crashes &#x2026;; commit }<br />
</p>

<p>
Logging<br />
</p>

<p>
Transaction Rollback (= Abort) <br />
</p>
<ul class="org-ul">
<li>Undoes <span class="underline">partial effects</span> of transaction<br /></li>
<li>Can be <span class="underline">system</span> or <span class="underline">client initiated</span><br /></li>
</ul>

<pre class="example">
Begin Transaction;
&lt;get input from user&gt;
SQL commands based on input
&lt;confirm results with user&gt;
If ans = 'ok' Then Commit; Else Rollback;
</pre>

<p>
Rollback only undoes data itself on database, but doesn't affect<br />
variable, and cash delivery etc.<br />
</p>

<p>
Never hold a transaction for long time.  Locking<br />
</p>

<p>
Consistency<br />
</p>

<p>
Each client, each transaction:<br />
</p>
<ul class="org-ul">
<li>Can assume all constraints hold when transaction begins<br /></li>
<li>Must guarantee all constraints hold when transaction ends<br /></li>
</ul>

<p>
Serializability  constraints always hold<br />
</p>
</div>
</div>
