notes/intro_db.org
*** DONE Isolation Levels
    CLOSED: [2017-08-23 Wed 23:47]

[[def:serial][Serializability]]  Overhead, Reduction in concurrency

Weaker "Isolation Levels" (from weak to strong)
  * Read Uncommitted
  * Read Committed
  * Repeatable Read
  * Serializable

 Overhead  Concurrency
 Consistency Guarantees

Isolation Levels
  * Per transaction
  * "In the eye of the beholder"

Dirty Reads
"Dirty" data item: written by an uncommitted transaction

Example 1
#+BEGIN_SRC sql
Update College Set enrollment = enrollment + 1000
Where cName = 'Stanford'
#+END_SRC
concurrent with ...
#+BEGIN_SRC sql
Select Avg(enrollment) From College
#+END_SRC

Example 2
#+NAME: q_up_gpa
#+BEGIN_SRC sql
Update Student Set GPA = 1.1 * GPA Where sizeHS > 2500
#+END_SRC
concurrent with ...
#+BEGIN_SRC sql
Select GPA From Student Where sID = 123
#+END_SRC
concurrent with ...
#+BEGIN_SRC sql
Update Student Set sizeHS = 2600 Where sID = 234
#+END_SRC

There is no such thing as dirty read within the same transaction.

Isolation Level: Read Uncommitted
  * A transaction may perform dirty reads

[[q_up_gpa][Query]] concurrent with ...
#+BEGIN_SRC sql
Set Transaction Isolation Level Read Uncommitted;
Select Avg(GPA) From Student;
#+END_SRC

Isolation Level: Read Committed
 * A transaction may /not/ perform dirty reads

Still does not guarantee global serializability

[[q_up_gpa][Query]] concurrent with ...
#+BEGIN_SRC sql
Set Transaction Isolation Level Read Committed;
Select Avg(GPA) From Student;
Select Max(GPA) From Student;
#+END_SRC

Isolation Level: Repeatable Read
  * A transaction may not perform dirty reads
  * An item read multiple times cannot change value

Still does not guarantee global serializability

#+BEGIN_SRC sql
Update Student Set GPA = 1.1 * GPA;
Update Student Set sizeHS = 1500 where sID = 123;
#+END_SRC
concurrent with ...
#+BEGIN_SRC sql
Set Transaction Isolation Level Repeatable Read;
Select Avg(GPA) From Student;
Select Avg(sizeHS) From Student;
#+END_SRC

Neither T1; T2 Nor T2; T1

But a relation /can/ change: "phantom" tuples

#+BEGIN_SRC sql
Insert Into Student -- [100 new tuples]
#+END_SRC
concurrent with ...
#+NAME: q_avg_max
#+BEGIN_SRC sql
Set Transaction Isolation Level Repeatable Read;
Select Avg(GPA) From Student;
Select Max(GPA) From Student;
#+END_SRC

The inserted tuples are called phantom tuples

#+BEGIN_SRC sql
Delete From Student -- [100 tuples]
#+END_SRC
concurrent with [[q_avg_max][Query]]

T1 must occur either before or after T2

Read Only transactions
  * Helps system optimize performance
  * Independent of isolation level

Orthogonal to isolation level

#+BEGIN_SRC sql
Set Transaction Read Only;
Set Transaction Isolation Level Repeatable Read;
Select Avg(GPA) From Student;
Select Max(GPA) From Student;
#+END_SRC

Isolation Levels: Summary

|------------------+-------------+---------------------+----------|
|                  | dirty Reads | nonrepeatable reads | phantoms |
|------------------+-------------+---------------------+----------|
| Read Uncommitted | Y           | Y                   | Y        |
|------------------+-------------+---------------------+----------|
| Read Committed   | N           | Y                   | Y        |
|------------------+-------------+---------------------+----------|
| Repeatable Read  | N           | N                   | Y        |
|------------------+-------------+---------------------+----------|
| Serializable     | N           | N                   | N        |
|------------------+-------------+---------------------+----------|

  * Standard default: Serializable
  * Weaker isolation levels
    - Increased concurrency + decreased overhead =
      increased performance
    - Weaker consistency guarantees
    - Some systems have default Repeatable Read
  * Isolation level per transaction and "eye of the beholder"
    - Each transaction's reads must conform to its isolation level

Note: An entire workload is globally serializable only if every
transaction's isolation level is serializable.

** DONE Exercises
   CLOSED: [2017-08-24 Thu 01:55]
*** DONE Index Quiz
    CLOSED: [2017-08-24 Thu 01:55]
*** DONE Transaction Quiz
    CLOSED: [2017-08-24 Thu 01:55]


* IN-PROGRESS [[https://lagunita.stanford.edu/courses/DB/Constraints/SelfPaced/courseware/ch-constraints_and_triggers/][Constraints and Triggers]] mini-course
** DONE Lecture Videos
   CLOSED: [2017-12-03 Sun 22:19]
