notes/intro_db.html

<div id="outline-container-org3dc65fc" class="outline-4">
<h4 id="org3dc65fc"><span class="section-number-4">6.1.4</span> <span class="done DONE">DONE</span> Isolation Levels</h4>
<div class="outline-text-4" id="text-6-1-4">
<p>
<a href="#orgdf7c46f">Serializability</a>  Overhead, Reduction in concurrency<br />
</p>

<p>
Weaker "Isolation Levels" (from weak to strong)<br />
</p>
<ul class="org-ul">
<li>Read Uncommitted<br /></li>
<li>Read Committed<br /></li>
<li>Repeatable Read<br /></li>
<li>Serializable<br /></li>
</ul>

<p>
 Overhead  Concurrency<br />
 Consistency Guarantees<br />
</p>

<p>
Isolation Levels<br />
</p>
<ul class="org-ul">
<li>Per transaction<br /></li>
<li>"In the eye of the beholder"<br /></li>
</ul>

<p>
Dirty Reads<br />
"Dirty" data item: written by an uncommitted transaction<br />
</p>

<p>
Example 1<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Update</span> College <span class="org-keyword">Set</span> enrollment = enrollment + 1000
<span class="org-keyword">Where</span> cName = <span class="org-string">'Stanford'</span>
</pre>
</div>
<p>
concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Select</span> <span class="org-builtin">Avg</span>(enrollment) <span class="org-keyword">From</span> College
</pre>
</div>

<p>
Example 2<br />
</p>
<div class="org-src-container">
<pre class="src src-sql" id="orgbff5353"><span class="org-keyword">Update</span> Student <span class="org-keyword">Set</span> GPA = 1.1 * GPA <span class="org-keyword">Where</span> sizeHS &gt; 2500
</pre>
</div>
<p>
concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Select</span> GPA <span class="org-keyword">From</span> Student <span class="org-keyword">Where</span> sID = 123
</pre>
</div>
<p>
concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Update</span> Student <span class="org-keyword">Set</span> sizeHS = 2600 <span class="org-keyword">Where</span> sID = 234
</pre>
</div>

<p>
There is no such thing as dirty read within the same transaction.<br />
</p>

<p>
Isolation Level: Read Uncommitted<br />
</p>
<ul class="org-ul">
<li>A transaction may perform dirty reads<br /></li>
</ul>

<p>
<a href="#orgbff5353">Query</a> concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Set</span> <span class="org-keyword">Transaction</span> <span class="org-keyword">Isolation</span> <span class="org-keyword">Level</span> <span class="org-keyword">Read</span> <span class="org-keyword">Uncommitted</span>;
<span class="org-keyword">Select</span> <span class="org-builtin">Avg</span>(GPA) <span class="org-keyword">From</span> Student;
</pre>
</div>

<p>
Isolation Level: Read Committed<br />
</p>
<ul class="org-ul">
<li>A transaction may <i>not</i> perform dirty reads<br /></li>
</ul>

<p>
Still does not guarantee global serializability<br />
</p>

<p>
<a href="#orgbff5353">Query</a> concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Set</span> <span class="org-keyword">Transaction</span> <span class="org-keyword">Isolation</span> <span class="org-keyword">Level</span> <span class="org-keyword">Read</span> <span class="org-keyword">Committed</span>;
<span class="org-keyword">Select</span> <span class="org-builtin">Avg</span>(GPA) <span class="org-keyword">From</span> Student;
<span class="org-keyword">Select</span> <span class="org-builtin">Max</span>(GPA) <span class="org-keyword">From</span> Student;
</pre>
</div>

<p>
Isolation Level: Repeatable Read<br />
</p>
<ul class="org-ul">
<li>A transaction may not perform dirty reads<br /></li>
<li>An item read multiple times cannot change value<br /></li>
</ul>

<p>
Still does not guarantee global serializability<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Update</span> Student <span class="org-keyword">Set</span> GPA = 1.1 * GPA;
<span class="org-keyword">Update</span> Student <span class="org-keyword">Set</span> sizeHS = 1500 <span class="org-keyword">where</span> sID = 123;
</pre>
</div>
<p>
concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Set</span> <span class="org-keyword">Transaction</span> <span class="org-keyword">Isolation</span> <span class="org-keyword">Level</span> <span class="org-keyword">Repeatable</span> <span class="org-keyword">Read</span>;
<span class="org-keyword">Select</span> <span class="org-builtin">Avg</span>(GPA) <span class="org-keyword">From</span> Student;
<span class="org-keyword">Select</span> <span class="org-builtin">Avg</span>(sizeHS) <span class="org-keyword">From</span> Student;
</pre>
</div>

<p>
Neither T1; T2 Nor T2; T1<br />
</p>

<p>
But a relation <i>can</i> change: "phantom" tuples<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Insert</span> <span class="org-keyword">Into</span> Student <span class="org-comment">-- [100 new tuples]</span>
</pre>
</div>
<p>
concurrent with &#x2026;<br />
</p>
<div class="org-src-container">
<pre class="src src-sql" id="org10cdad3"><span class="org-keyword">Set</span> <span class="org-keyword">Transaction</span> <span class="org-keyword">Isolation</span> <span class="org-keyword">Level</span> <span class="org-keyword">Repeatable</span> <span class="org-keyword">Read</span>;
<span class="org-keyword">Select</span> <span class="org-builtin">Avg</span>(GPA) <span class="org-keyword">From</span> Student;
<span class="org-keyword">Select</span> <span class="org-builtin">Max</span>(GPA) <span class="org-keyword">From</span> Student;
</pre>
</div>

<p>
The inserted tuples are called phantom tuples<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Delete</span> <span class="org-keyword">From</span> Student <span class="org-comment">-- [100 tuples]</span>
</pre>
</div>
<p>
concurrent with <a href="#org10cdad3">Query</a><br />
</p>

<p>
T1 must occur either before or after T2<br />
</p>

<p>
Read Only transactions<br />
</p>
<ul class="org-ul">
<li>Helps system optimize performance<br /></li>
<li>Independent of isolation level<br /></li>
</ul>

<p>
Orthogonal to isolation level<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Set</span> <span class="org-keyword">Transaction</span> <span class="org-keyword">Read</span> <span class="org-keyword">Only</span>;
<span class="org-keyword">Set</span> <span class="org-keyword">Transaction</span> <span class="org-keyword">Isolation</span> <span class="org-keyword">Level</span> <span class="org-keyword">Repeatable</span> <span class="org-keyword">Read</span>;
<span class="org-keyword">Select</span> <span class="org-builtin">Avg</span>(GPA) <span class="org-keyword">From</span> Student;
<span class="org-keyword">Select</span> <span class="org-builtin">Max</span>(GPA) <span class="org-keyword">From</span> Student;
</pre>
</div>

<p>
Isolation Levels: Summary<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">dirty Reads</th>
<th scope="col" class="org-left">nonrepeatable reads</th>
<th scope="col" class="org-left">phantoms</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Read Uncommitted</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Read Committed</td>
<td class="org-left">N</td>
<td class="org-left">Y</td>
<td class="org-left">Y</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Repeatable Read</td>
<td class="org-left">N</td>
<td class="org-left">N</td>
<td class="org-left">Y</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Serializable</td>
<td class="org-left">N</td>
<td class="org-left">N</td>
<td class="org-left">N</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Standard default: Serializable<br /></li>
<li>Weaker isolation levels<br />
<ul class="org-ul">
<li>Increased concurrency + decreased overhead =<br />
increased performance<br /></li>
<li>Weaker consistency guarantees<br /></li>
<li>Some systems have default Repeatable Read<br /></li>
</ul></li>
<li>Isolation level per transaction and "eye of the beholder"<br />
<ul class="org-ul">
<li>Each transaction's reads must conform to its isolation level<br /></li>
</ul></li>
</ul>

<p>
Note: An entire workload is globally serializable only if every<br />
transaction's isolation level is serializable.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgaeb9f3c" class="outline-3">
<h3 id="orgaeb9f3c"><span class="section-number-3">6.2</span> <span class="done DONE">DONE</span> Exercises</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org54081d1" class="outline-4">
<h4 id="org54081d1"><span class="section-number-4">6.2.1</span> <span class="done DONE">DONE</span> Index Quiz</h4>
<div class="outline-text-4" id="text-6-2-1">
</div>
</div>
<div id="outline-container-orgc446251" class="outline-4">
<h4 id="orgc446251"><span class="section-number-4">6.2.2</span> <span class="done DONE">DONE</span> Transaction Quiz</h4>
<div class="outline-text-4" id="text-6-2-2">
</div>
</div>
</div>
</div>


<div id="outline-container-orgcaf5b6f" class="outline-2">
<h2 id="orgcaf5b6f"><span class="section-number-2">7</span> <span class="done DONE">DONE</span> <a href="https://lagunita.stanford.edu/courses/DB/Constraints/SelfPaced/courseware/ch-constraints_and_triggers/">Constraints and Triggers</a> mini-course</h2>
<div class="outline-text-2" id="text-7">
</div>
