notes/intro_db.org
*** DONE Motivation and Overview
    CLOSED: [2017-11-26 Sun 18:42]

(Integrity) Contstraints  <static>
  constrain allowable database states


Triggers <dynamic>
  monitor database changes,
  check conditions and initiate actions


Integrity Constraints
  Impose restrictions on allowable data, beyond those imposed by
  structure and types


0.0 < GPA <= 4.0
enrollment < 50,000 (75,000)


Why use them?
  Data-entry errors (inserts)
  Correctness criteria (updates)
  Enforce consistency
  Tell system about data


Classification
  Non-null
  Key
  Referential Integrity (foreign key)


Declaring and enforcing constraints

Declaration
  * With original schema - checked after bulk loading
  * Or later - checked on current DB


Enforcement
  * Check after every "dangerous" modification
  * Deferred constraint checking (transaction)


Triggers
"Event-Condition-Action Rules"
When /event/ occurs, check /condition/; if true, do action


Examples
  enrollment > 35,000 -> reject all applicants
  insert app with GPA > 3.95 -> accept automatically
  update sizeHS to be > 7,000 -> change to "wrong", raise error


Why use them?
More logic from apps into DBMS
To enforce constraints
  - expressive
  - constraint "repair" logic




#+BEGIN_SRC sql
  Create Trigger name
  Before|After|Instead Of events
  [ referencing-variables ]
  [ For Each Row ]
  When (condition)
  action
#+END_SRC

Constraints and Triggers
  - For relational databases
  - SQL standard; systems vary considerably

(Integrity) Constraints
  - constrain allowable database states

Triggers
  - monitor database changes,
  - check conditions and initiate actions

