notes/intro_db.html
<div id="outline-container-org033ce25" class="outline-3">
<h3 id="org033ce25"><span class="section-number-3">7.1</span> <span class="done DONE">DONE</span> Lecture Videos</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org8880985" class="outline-4">
<h4 id="org8880985"><span class="section-number-4">7.1.1</span> <span class="done DONE">DONE</span> Motivation and Overview</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
(Integrity) Contstraints  &lt;static&gt;<br />
  constrain allowable database states<br />
</p>


<p>
Triggers &lt;dynamic&gt;<br />
  monitor database changes,<br />
  check conditions and initiate actions<br />
</p>


<p>
Integrity Constraints<br />
  Impose restrictions on allowable data, beyond those imposed by<br />
  structure and types<br />
</p>


<p>
0.0 &lt; GPA &lt;= 4.0<br />
enrollment &lt; 50,000 (75,000)<br />
</p>


<p>
Why use them?<br />
  Data-entry errors (inserts)<br />
  Correctness criteria (updates)<br />
  Enforce consistency<br />
  Tell system about data<br />
</p>


<p>
Classification<br />
  Non-null<br />
  Key<br />
  Referential Integrity (foreign key)<br />
</p>


<p>
Declaring and enforcing constraints<br />
</p>

<p>
Declaration<br />
</p>
<ul class="org-ul">
<li>With original schema - checked after bulk loading<br /></li>
<li>Or later - checked on current DB<br /></li>
</ul>


<p>
Enforcement<br />
</p>
<ul class="org-ul">
<li>Check after every "dangerous" modification<br /></li>
<li>Deferred constraint checking (transaction)<br /></li>
</ul>


<p>
Triggers<br />
"Event-Condition-Action Rules"<br />
When <i>event</i> occurs, check <i>condition</i>; if true, do action<br />
</p>


<p>
Examples<br />
  enrollment &gt; 35,000 -&gt; reject all applicants<br />
  insert app with GPA &gt; 3.95 -&gt; accept automatically<br />
  update sizeHS to be &gt; 7,000 -&gt; change to "wrong", raise error<br />
</p>


<p>
Why use them?<br />
More logic from apps into DBMS<br />
To enforce constraints<br />
</p>
<ul class="org-ul">
<li>expressive<br /></li>
<li>constraint "repair" logic<br /></li>
</ul>




<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Create</span> <span class="org-keyword">Trigger</span> <span class="org-keyword">name</span>
<span class="org-keyword">Before</span>|<span class="org-keyword">After</span>|Instead <span class="org-keyword">Of</span> events
[ <span class="org-keyword">referencing</span>-variables ]
[ <span class="org-keyword">For</span> <span class="org-keyword">Each</span> <span class="org-type">Row</span> ]
<span class="org-keyword">When</span> (condition)
<span class="org-keyword">action</span>
</pre>
</div>

<p>
Constraints and Triggers<br />
</p>
<ul class="org-ul">
<li>For relational databases<br /></li>
<li>SQL standard; systems vary considerably<br /></li>
</ul>

<p>
(Integrity) Constraints<br />
</p>
<ul class="org-ul">
<li>constrain allowable database states<br /></li>
</ul>

<p>
Triggers<br />
</p>
<ul class="org-ul">
<li>monitor database changes,<br /></li>
<li>check conditions and initiate actions<br /></li>
</ul>
</div>
</div>
