notes/intro_db.html

<div id="outline-container-orgd71a2fb" class="outline-4">
<h4 id="orgd71a2fb"><span class="section-number-4">7.1.2</span> <span class="done DONE">DONE</span> Constraints of Several Types</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
Integrity Constraints<br />
</p>
<ul class="org-ul">
<li>Impose restrictions on allowable data, beyond those imposed by structure and types<br />
<ul class="org-ul">
<li>Non-null constraints<br /></li>
<li>Key constraints<br /></li>
<li>Attribute-based and tuple-based constraints (limits)<br /></li>
<li>General assertions (not implemented by any database)<br /></li>
</ul></li>
</ul>

<p>
Not all constraints are implemented.<br />
</p>

<p>
Constraints Demo<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Student</span>(
    sID <span class="org-type">int</span>,
    sName text,
    GPA <span class="org-type">real</span> <span class="org-keyword">not</span> <span class="org-keyword">null</span>,
    sizeHS <span class="org-type">int</span>
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (123, <span class="org-string">'Amy'</span>, 3.9, 1000);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (234, <span class="org-string">'Bob'</span>, 3.6, <span class="org-keyword">null</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (345, <span class="org-string">'Craig'</span>, <span class="org-keyword">null</span>, 500);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> Student <span class="org-keyword">set</span> GPA = <span class="org-keyword">null</span> <span class="org-keyword">where</span> sID = 123; <span class="org-comment">-- failed</span>
<span class="org-keyword">update</span> Student <span class="org-keyword">set</span> GPA = <span class="org-keyword">null</span> <span class="org-keyword">where</span> sID = 456; <span class="org-comment">-- succeed since 456 doesn't exist</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Student</span>(
    sID <span class="org-type">int</span> <span class="org-keyword">primary</span> <span class="org-keyword">key</span>,
    sName text,
    GPA <span class="org-type">real</span>,
    sizeHS <span class="org-type">int</span>
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (123, <span class="org-string">'Amy'</span>, 3.9, 1000);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (234, <span class="org-string">'Bob'</span>, 3.6, 1500);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (123, <span class="org-string">'Craig'</span>, 3.5, 500); <span class="org-comment">-- failed, key error</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> Student <span class="org-keyword">set</span> sID = 123 <span class="org-keyword">where</span> sName = <span class="org-string">'Bob'</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> Student <span class="org-keyword">set</span> sID = sID - 111; <span class="org-comment">-- succeed if query executed for sID 123 before 234</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> Student <span class="org-keyword">set</span> sID = sID + 111; <span class="org-comment">-- failed if query executed for sID 123 before 234</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Student</span>(
    sID <span class="org-type">int</span> <span class="org-keyword">primary</span> <span class="org-keyword">key</span>,
    sName text <span class="org-keyword">unique</span>,
    GPA <span class="org-type">real</span>,
    sizeHS <span class="org-type">int</span>
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (123, <span class="org-string">'Amy'</span>, 3.9, 1000);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (234, <span class="org-string">'Bob'</span>, 3.6, 1500);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (345, <span class="org-string">'Amy'</span>, 3.5, 500); <span class="org-comment">-- failed</span>
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (456, <span class="org-string">'Doris'</span>, 3.9, 1000);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (567, <span class="org-string">'Amy'</span>, 3.8, 1500); <span class="org-comment">-- failed</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">College</span>(
    cName text,
    <span class="org-keyword">state</span> text,
    enrollment <span class="org-type">int</span>,
    pimary <span class="org-keyword">key</span> (cName, <span class="org-keyword">state</span>)
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> College <span class="org-keyword">values</span> (<span class="org-string">'Mason'</span>, <span class="org-string">'CA'</span>, 10000);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> College <span class="org-keyword">values</span> (<span class="org-string">'Mason'</span>, <span class="org-string">'NY'</span>, 5000);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> College <span class="org-keyword">values</span> (<span class="org-string">'Mason'</span>, <span class="org-string">'CA'</span>, 2000);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Apply</span>(
    sID <span class="org-type">int</span>,
    cName text,
    major text,
    decision text,
    <span class="org-keyword">unique</span>(sID, cName),
    <span class="org-keyword">unique</span>(sID, major)
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-string">'Stanford'</span>, <span class="org-string">'CS'</span>, <span class="org-keyword">null</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-string">'Berkeley'</span>, <span class="org-string">'EE'</span>, <span class="org-keyword">null</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-string">'Stanford'</span>, <span class="org-string">'biology'</span>, <span class="org-keyword">null</span>); <span class="org-comment">-- failed</span>
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (234, <span class="org-string">'Stanford'</span>, <span class="org-string">'biology'</span>, <span class="org-keyword">null</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-string">'MIT'</span>, <span class="org-string">'EE'</span>, <span class="org-keyword">null</span>); <span class="org-comment">-- failed</span>
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-string">'MIT'</span>, <span class="org-string">'biology'</span>, <span class="org-keyword">null</span>);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> Apply <span class="org-keyword">set</span> major = <span class="org-string">'CS'</span> <span class="org-keyword">where</span> cName = <span class="org-string">'MIT'</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-keyword">null</span>, <span class="org-keyword">null</span>, <span class="org-string">'Y'</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-keyword">null</span>, <span class="org-keyword">null</span>, <span class="org-string">'N'</span>);
</pre>
</div>

<p>
Both queries above succeed.  SQL standard and most systems allow<br />
duplicate null values for unique key.  Most systems do not permit<br />
repeated null values for primary key.<br />
</p>


<p>
Attribute check constraint<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Student</span>(
    sID <span class="org-type">int</span>,
    sName text,
    GPA <span class="org-type">real</span> <span class="org-keyword">check</span>(GPA &lt;= 4.0 <span class="org-keyword">and</span> GPA &gt; 0.0),
    sizeHS <span class="org-type">int</span> <span class="org-keyword">check</span>(sizeHS &lt; 5000)
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (123, <span class="org-string">'Amy'</span>, 3.9, 1000);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (234, <span class="org-string">'Bob'</span>, 4.6, 1500);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Apply</span>(
    sID <span class="org-type">int</span>,
    cName text,
    major text,
    decision text,
    <span class="org-keyword">check</span>(decision = <span class="org-string">'N'</span> <span class="org-keyword">or</span> cName &lt;&gt; <span class="org-string">'Stanford'</span> <span class="org-keyword">or</span> major &lt;&gt; <span class="org-string">'CS'</span>)
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-string">'Stanford'</span>, <span class="org-string">'CS'</span>, <span class="org-string">'N'</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-string">'MIT'</span>, <span class="org-string">'CS'</span>, <span class="org-string">'Y'</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-string">'Stanford'</span>, <span class="org-string">'CS'</span>, <span class="org-string">'Y'</span>);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> Apply <span class="org-keyword">set</span> decision = <span class="org-string">'Y'</span> <span class="org-keyword">where</span> cName = <span class="org-string">'Stanford'</span>;
<span class="org-keyword">update</span> Apply <span class="org-keyword">set</span> cName = <span class="org-string">'Stanford'</span> <span class="org-keyword">where</span> cName = <span class="org-string">'MIT'</span>;
</pre>
</div>

<p>
Both queries failed on SQLite and Postgres, but not in MySQL (MySQL sucks).<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Student</span>(
    sID <span class="org-type">int</span>,
    sName text,
    GPA <span class="org-type">real</span> <span class="org-keyword">check</span>(GPA <span class="org-keyword">is</span> <span class="org-keyword">not</span> <span class="org-keyword">null</span>),
    sizeHS <span class="org-type">int</span>
);
</pre>
</div>

<p>
The above is equivalent to <code>GPA real not null</code>.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">T</span>(
    A <span class="org-type">int</span> <span class="org-keyword">check</span>(A <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> A <span class="org-keyword">from</span> T))
);
</pre>
</div>

<p>
The above check constraint implements key constraint.  It fails on<br />
SQLite for several reasons.  The order of execution and check matters.<br />
It works for at least some database system.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">T</span>(
    A <span class="org-type">int</span> <span class="org-keyword">check</span>((<span class="org-keyword">select</span> <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> A) <span class="org-keyword">from</span> T) =
                (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">from</span> T))
);
</pre>
</div>

<p>
No known database allows subquery, esp. aggregation, in check<br />
expression, so the above query also doesn't work.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Student</span>(
    sID <span class="org-type">int</span>,
    sName text,
    GPA <span class="org-type">real</span>,
    sizeHS <span class="org-type">int</span>
);

<span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Apply</span>(
    sID <span class="org-type">int</span>,
    cName text,
    major text,
    decision text,
    <span class="org-keyword">check</span>(sID <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID <span class="org-keyword">from</span> Student))
);
</pre>
</div>

<p>
The above table definitions is valid according to SQL standards but no<br />
database implements subquery in check constraint.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">College</span>(
    cName text,
    <span class="org-keyword">state</span> text,
    enrollment <span class="org-type">int</span>,
    <span class="org-keyword">check</span>(enrollment &gt; (<span class="org-keyword">select</span> <span class="org-builtin">max</span>(sizeHS) <span class="org-keyword">from</span> Student))
);
</pre>
</div>

<p>
Also valid in SQL standard but no database allows this.  Now, suppose<br />
this works for some system, it has other problems.  When student table<br />
changes, the check constraint may no longer be valid.<br />
</p>


<p>
General Assertions<br />
</p>
<ul class="org-ul">
<li>They are very powerful but unfortunately not implemented by any RDBMS.<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">assertion</span> <span class="org-keyword">Key</span>
<span class="org-keyword">check</span> ((<span class="org-keyword">select</span> <span class="org-builtin">count</span>(<span class="org-keyword">distinct</span> A) <span class="org-keyword">from</span> T) =
       (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">from</span> T));
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">assertion</span> ReferentialIntegrity
<span class="org-keyword">check</span>  (<span class="org-keyword">not</span> <span class="org-keyword">exists</span> (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> Apply
                    <span class="org-keyword">where</span> sID <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-keyword">select</span> sID <span class="org-keyword">from</span> Student)));
</pre>
</div>

<p>
It's common to write <code>not exists</code> in general assertions.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">assertion</span> AvgAccept
<span class="org-keyword">check</span> (3.0 &lt; (<span class="org-keyword">select</span> <span class="org-builtin">avg</span>(GPA) <span class="org-keyword">from</span> Student
              <span class="org-keyword">where</span> sID <span class="org-keyword">in</span>
                (<span class="org-keyword">select</span> sID <span class="org-keyword">from</span> Apply <span class="org-keyword">where</span> decision = <span class="org-string">'Y'</span>)));
</pre>
</div>
</div>
</div>
