notes/intro_db.html

<div id="outline-container-orgab1d028" class="outline-4">
<h4 id="orgab1d028"><span class="section-number-4">7.1.3</span> <span class="done DONE">DONE</span> Referential Integrity</h4>
<div class="outline-text-4" id="text-7-1-3">
<p>
Integrity Constraints<br />
</p>
<ul class="org-ul">
<li>Impose restrictions on allowable data, beyond those imposed by<br />
structure and types<br /></li>
</ul>

<p>
Referential integrity = Integrity of references = No "dangling pointers"<br />
</p>


<p>
Referential integrity from R.A to S.B<br />
</p>
<ul class="org-ul">
<li>Each value in column A of table R must appear in column B of table S<br />
<ul class="org-ul">
<li>A is called the "foreign key" (Foreign key constraints)<br /></li>
<li>B is usually required to be the <i>primary key</i> for table S or at least <i>unique</i><br /></li>
<li>Multi-attribute foreign keys are allowed<br /></li>
</ul></li>
</ul>

<p>
Referential integrity is directional<br />
</p>

<p>
Referential Integrity Enforcement (R.A to S.B)<br />
</p>
<ul class="org-ul">
<li>Potentially violating modifications:<br />
<ul class="org-ul">
<li>Insert into R<br /></li>
<li>Delete from S<br /></li>
<li>Update R.A<br /></li>
<li>Update S.B<br /></li>
</ul></li>
</ul>

<p>
Special actions:<br />
</p>
<ul class="org-ul">
<li>Delete from S<br />
<ul class="org-ul">
<li>Delete from S<br />
<ul class="org-ul">
<li><code>Restrict</code> (default), <code>Set Null</code>, <code>Cascade</code><br /></li>
</ul></li>
<li>Update S.B<br />
<ul class="org-ul">
<li><code>Restrict</code> (default), <code>Set Null</code>, <code>Cascade</code><br /></li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">College</span>(
    cName text <span class="org-keyword">primary</span> <span class="org-keyword">key</span>,
    <span class="org-keyword">state</span> text,
    enrollment <span class="org-type">int</span>
);

<span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Student</span>(
    sID <span class="org-type">int</span> <span class="org-keyword">primary</span> <span class="org-keyword">key</span>,
    sName text,
    GPA <span class="org-type">real</span>,
    sizeHS <span class="org-type">int</span>
);

<span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Apply</span>(
    sID <span class="org-type">int</span> <span class="org-keyword">references</span> Student(sID),
    cName text <span class="org-keyword">references</span> College(cName),
    major text,
    decision text
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (123, <span class="org-string">'Stanford'</span>, <span class="org-string">'CS'</span>, <span class="org-string">'Y'</span>);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (234, <span class="org-string">'Berkeley'</span>, <span class="org-string">'biology'</span>, <span class="org-string">'N'</span>);
</pre>
</div>

<p>
Both queries above failed.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (123, <span class="org-string">'Amy'</span>, 3.9, 1000);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> Student <span class="org-keyword">values</span> (234, <span class="org-string">'Bob'</span>, 3.6, 1500);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> College <span class="org-keyword">values</span> (<span class="org-string">'Stanford'</span>, <span class="org-string">'CA'</span>, 15000);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> College <span class="org-keyword">values</span> (<span class="org-string">'Berkeley'</span>, <span class="org-string">'CA'</span>, 36000);
</pre>
</div>

<p>
After executing the above queries, the previous queries succeed.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> Apply <span class="org-keyword">set</span> sID = 345 <span class="org-keyword">where</span> sID = 123; <span class="org-comment">-- failed, break referential integrity</span>
<span class="org-keyword">update</span> Apply <span class="org-keyword">set</span> sID = 234 <span class="org-keyword">where</span> sID = 123; <span class="org-comment">-- succeed</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">delete</span> <span class="org-keyword">from</span> College <span class="org-keyword">where</span> cName = <span class="org-string">'Stanford'</span>; <span class="org-comment">-- failed</span>
<span class="org-keyword">delete</span> <span class="org-keyword">from</span> College <span class="org-keyword">where</span> sID = 234;          <span class="org-comment">-- failed</span>
<span class="org-keyword">delete</span> <span class="org-keyword">from</span> College <span class="org-keyword">where</span> sID = 123;          <span class="org-comment">-- succeed</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> College <span class="org-keyword">set</span> cName = <span class="org-string">'Bezerkeley'</span> <span class="org-keyword">where</span> cName = <span class="org-string">'Berkeley'</span>; <span class="org-comment">-- failed</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">drop</span> <span class="org-keyword">table</span> <span class="org-function-name">Student</span>;             <span class="org-comment">-- failed</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">Apply</span>(
    sID <span class="org-type">int</span> <span class="org-keyword">references</span> Student(sID) <span class="org-keyword">on</span> <span class="org-keyword">delete</span> <span class="org-keyword">set</span> <span class="org-keyword">null</span>,
    cName text <span class="org-keyword">references</span> College(cName) <span class="org-keyword">on</span> <span class="org-keyword">update</span> <span class="org-keyword">cascade</span>,
    major text,
    decision text
);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">delete</span> <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> sID &gt; 200;
</pre>
</div>

<p>
The Bezerkeley query now succeeds.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">T</span> (
    A <span class="org-type">int</span>,
    B <span class="org-type">int</span>,
    C <span class="org-type">int</span>,
    <span class="org-keyword">primary</span> <span class="org-keyword">key</span> (A, B),
    <span class="org-keyword">foreign</span> <span class="org-keyword">key</span> (B, C) <span class="org-keyword">references</span> T(A, B) <span class="org-keyword">on</span> <span class="org-keyword">delete</span> <span class="org-keyword">cascade</span>
);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> T <span class="org-keyword">values</span> (1, 1, 1);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> T <span class="org-keyword">values</span> (2, 1, 1);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> T <span class="org-keyword">values</span> (3, 2, 1);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> T <span class="org-keyword">values</span> (4, 3, 2);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> T <span class="org-keyword">values</span> (5, 4, 3);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> T <span class="org-keyword">values</span> (6, 5, 4);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> T <span class="org-keyword">values</span> (7, 6, 5);
<span class="org-keyword">insert</span> <span class="org-keyword">into</span> T <span class="org-keyword">values</span> (8, 7, 6);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">delete</span> <span class="org-keyword">from</span> T <span class="org-keyword">where</span> A = 1;
</pre>
</div>

<p>
The above query will delete all the rows in T.<br />
</p>
</div>
</div>
