notes/intro_db.org
*** DONE Triggers Introduction
    CLOSED: [2017-12-02 Sat 20:54]

Triggers
- "Event-Condition-Action Rules"
- When /event/ occurs, check condition; if true, do action
  1) Move monitoring logic from apps into DBMS
  2) Enforce constraints
     * Beyond what constraint system supports
     * Automatic constraint "repair"

*Implementations vary significantly*

#+BEGIN_SRC sql
  Create Trigger name
  Before | After | Instead Of events
  [ referencing-variables ]
  [ For Each Row ]
  When (condition)
  action
#+END_SRC

Events are one of =insert on T=, =delete on T=, =update [of C1, ..., Cn] on T=.

=[For Each Row]= means that the triggers should be executed once for
each modified tuple.

When event is an insert, =referencing-variables= can only reference
the newly inserted data.  When event is a delete, =referencing-variables=
can only reference the old deleted data.  When envent is an update,
=referencing-variables= can reference both old and new data.

If a row-level trigger is concerned and the event is a delete, we can
refer both the old row and old table as different variables.  Old
table does not refer to the old state of the table in the database but
specifically refers to the rows deleted in the delete event.

If a statement-level trigger is concerned, only table can be referenced.

=(Condition)= is like SQL =where= clause.

=action= is the action to be performed when triggered.  This is where
various database systems differ.

Referential Integrity:
- R.A references S.B, cascaded delete

#+BEGIN_SRC sql
  Create Trigger Cascade
  After Delete On S
  Referencing Old Row As O
  For Each Row
  -- [ no condition ]
  Delete From R Where A = O.B
#+END_SRC

#+BEGIN_SRC sql
  Create Trigger Cascade
  After Delete On S
  Referencing Old Table As OT
  -- [ For Each Row ]
  -- [ no condition ]
  Delete From R Where A in (Select B from OT)
#+END_SRC


Tricky Issues

  * Row-level vs. Statement-level
    - New/Old Row and New/Old Table
    - Before, Instead Of

  * Multiple triggers activated at same time

  * Trigger actions activating other triggers (chaining)
    - Also self-triggering, cycles, nested invocations

  * Conditions in =When= vs. as part of =action=


SQLite supports only row-level triggers.

T(K,V) - K key, V value

#+BEGIN_SRC sql
  Create Trigger IncreaseInserts
  After Insert On T
  Referencing New Row As NR, New Table As NT
  For Each Row
  When (Select Avg(V) From T) <
       (Select Avg(V) From NT)
  Update T set V=V+10 where K=NR.K
#+END_SRC

  * No statement-level equivalent
  * Nondeterministic final state

