notes/intro_db.html

<div id="outline-container-org5bdb333" class="outline-4">
<h4 id="org5bdb333"><span class="section-number-4">7.1.4</span> <span class="done DONE">DONE</span> Triggers Introduction</h4>
<div class="outline-text-4" id="text-7-1-4">
<p>
Triggers<br />
</p>
<ul class="org-ul">
<li>"Event-Condition-Action Rules"<br /></li>
<li>When <i>event</i> occurs, check condition; if true, do action<br />
<ol class="org-ol">
<li>Move monitoring logic from apps into DBMS<br /></li>
<li>Enforce constraints<br />
<ul class="org-ul">
<li>Beyond what constraint system supports<br /></li>
<li>Automatic constraint "repair"<br /></li>
</ul></li>
</ol></li>
</ul>

<p>
<b>Implementations vary significantly</b><br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Create</span> <span class="org-keyword">Trigger</span> <span class="org-keyword">name</span>
<span class="org-keyword">Before</span> | <span class="org-keyword">After</span> | Instead <span class="org-keyword">Of</span> events
[ <span class="org-keyword">referencing</span>-variables ]
[ <span class="org-keyword">For</span> <span class="org-keyword">Each</span> <span class="org-type">Row</span> ]
<span class="org-keyword">When</span> (condition)
<span class="org-keyword">action</span>
</pre>
</div>

<p>
Events are one of <code>insert on T</code>, <code>delete on T</code>, <code>update [of C1, ..., Cn] on T</code>.<br />
</p>

<p>
<code>[For Each Row]</code> means that the triggers should be executed once for<br />
each modified tuple.<br />
</p>

<p>
When event is an insert, <code>referencing-variables</code> can only reference<br />
the newly inserted data.  When event is a delete, <code>referencing-variables</code><br />
can only reference the old deleted data.  When envent is an update,<br />
<code>referencing-variables</code> can reference both old and new data.<br />
</p>

<p>
If a row-level trigger is concerned and the event is a delete, we can<br />
refer both the old row and old table as different variables.  Old<br />
table does not refer to the old state of the table in the database but<br />
specifically refers to the rows deleted in the delete event.<br />
</p>

<p>
If a statement-level trigger is concerned, only table can be referenced.<br />
</p>

<p>
<code>(Condition)</code> is like SQL <code>where</code> clause.<br />
</p>

<p>
<code>action</code> is the action to be performed when triggered.  This is where<br />
various database systems differ.<br />
</p>

<p>
Referential Integrity:<br />
</p>
<ul class="org-ul">
<li>R.A references S.B, cascaded delete<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Create</span> <span class="org-keyword">Trigger</span> <span class="org-keyword">Cascade</span>
<span class="org-keyword">After</span> <span class="org-keyword">Delete</span> <span class="org-keyword">On</span> S
<span class="org-keyword">Referencing</span> <span class="org-keyword">Old</span> <span class="org-type">Row</span> <span class="org-keyword">As</span> O
<span class="org-keyword">For</span> <span class="org-keyword">Each</span> <span class="org-type">Row</span>
<span class="org-comment">-- [ no condition ]</span>
<span class="org-keyword">Delete</span> <span class="org-keyword">From</span> R <span class="org-keyword">Where</span> A = O.B
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Create</span> <span class="org-keyword">Trigger</span> <span class="org-keyword">Cascade</span>
<span class="org-keyword">After</span> <span class="org-keyword">Delete</span> <span class="org-keyword">On</span> S
<span class="org-keyword">Referencing</span> <span class="org-keyword">Old</span> <span class="org-keyword">Table</span> <span class="org-keyword">As</span> OT
<span class="org-comment">-- [ For Each Row ]</span>
<span class="org-comment">-- [ no condition ]</span>
<span class="org-keyword">Delete</span> <span class="org-keyword">From</span> R <span class="org-keyword">Where</span> A <span class="org-keyword">in</span> (<span class="org-keyword">Select</span> B <span class="org-keyword">from</span> OT)
</pre>
</div>


<p>
Tricky Issues<br />
</p>

<ul class="org-ul">
<li>Row-level vs. Statement-level<br />
<ul class="org-ul">
<li>New/Old Row and New/Old Table<br /></li>
<li>Before, Instead Of<br /></li>
</ul></li>

<li>Multiple triggers activated at same time<br /></li>

<li>Trigger actions activating other triggers (chaining)<br />
<ul class="org-ul">
<li>Also self-triggering, cycles, nested invocations<br /></li>
</ul></li>

<li>Conditions in <code>When</code> vs. as part of <code>action</code><br /></li>
</ul>


<p>
SQLite supports only row-level triggers.<br />
</p>

<p>
T(K,V) - K key, V value<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">Create</span> <span class="org-keyword">Trigger</span> <span class="org-function-name">IncreaseInserts</span>
<span class="org-keyword">After</span> <span class="org-keyword">Insert</span> <span class="org-keyword">On</span> T
<span class="org-keyword">Referencing</span> <span class="org-keyword">New</span> <span class="org-type">Row</span> <span class="org-keyword">As</span> NR, <span class="org-keyword">New</span> <span class="org-keyword">Table</span> <span class="org-keyword">As</span> NT
<span class="org-keyword">For</span> <span class="org-keyword">Each</span> <span class="org-type">Row</span>
<span class="org-keyword">When</span> (<span class="org-keyword">Select</span> <span class="org-builtin">Avg</span>(V) <span class="org-keyword">From</span> T) &lt;
     (<span class="org-keyword">Select</span> <span class="org-builtin">Avg</span>(V) <span class="org-keyword">From</span> NT)
<span class="org-keyword">Update</span> T <span class="org-keyword">set</span> V=V+10 <span class="org-keyword">where</span> K=NR.K
</pre>
</div>

<ul class="org-ul">
<li>No statement-level equivalent<br /></li>
<li>Nondeterministic final state<br /></li>
</ul>
</div>
</div>
