notes/intro_db.org
*** DONE Triggers Demo
    CLOSED: [2017-12-03 Sun 22:19]

  * Before and After; Insert, Delete, and Update
  * New and Old
  * Conditions and actions
  * Triggers enforcing constraints
  * Trigger chaining
  * Self-triggering, cycles
  * Conflicts
  * Nested trigger invocations

Introduction video used SQL standard
  * No DBMS implements exact standard
  * Some deviate considerably
    - In both syntax and behavior!

Postgres > SQLite >> MySQL

Postgres
  * Expressiveness/behavior = full standard
    row-level + statement-level, old/new row & table
  * Cumbersome & awkward syntax

SQLite
  * Row-level only, immediate activation => no old/new table

MySQL
  * Row-level only, immediate activation => no old/new table
  * Only one trigger per event type
  * Limited trigger chaining


SQLite - row-level triggers, immediate activation
  * =For Each Row= implicit if not specified
  * No =Old Table= or =New Table=
  * No =Referencing= clause
    - =Old= and =New= predefined for =Old Row= and =New Row=
  * Trigger action: SQL statements in =begin-end= block


#+BEGIN_SRC sql
  create trigger R1
  after insert on Student
  for each row
  when New.GPA > 3.3 and New.GPA <= 3.6
  begin
      insert into Apply values (New.sID, 'Stanford', 'geology', null);
      insert into Apply values (New.sID, 'MIT', 'biology', null);
  end;
#+END_SRC

#+BEGIN_SRC sql
  create trigger R2
  after delete on Student
  for each row
  begin
      delete from Apply where sID = Old.sID;
  end;
#+END_SRC

#+BEGIN_SRC sql
  create trigger R3
  after update of cName on College
  for each row
  begin
      update Apply
      set cName = New.cName
      where cName = Old.cName;
  end;
#+END_SRC

#+BEGIN_SRC sql
  create trigger R4
  before insert on College
  for each row
  when exists (select * from College where cName = New.cName)
  begin
      select raise(ignore);
  end;

  create trigger R5
  before update of cName on College
  for each row
  when exists (select * from College where cName = New.cName)
  begin
      select raise(ignore);
  end;
#+END_SRC

#+BEGIN_SRC sql
  create trigger R6
  after insert on Apply
  for each row
  when (select count(*) from Apply where cName = New.cName) > 10
  begin
      update College set cName = cName || '-Done'
      where cName = New.cName;
  end;
#+END_SRC

#+BEGIN_SRC sql
  create trigger R7
  before insert on Student
  for each row
  when New.sizeHS < 100 or New.sizeHS > 5000
  begin
      select raise(ignore);
  end;
#+END_SRC

#+BEGIN_SRC sql
  create trigger R7               -- alternative version using after
  after insert on Student
  for each row
  when New.sizeHS < 100 or New.sizeHS > 5000
  begin
      delete from Student where sID = New.sID;
  end;
#+END_SRC

#+BEGIN_SRC sql
  create trigger AutoAccept
  after insert on Apply
  for each row
  when (New.cName = 'Berkeley' and
        3.7 < (select GPA from Student where sID = New.sID) and
        1200 < (select sizeHS from Student where sID = New.sID))
  begin
      update Apply
      set decision = 'Y'
      where sID = New.sID
            and cName = New.cName;
  end;
#+END_SRC

#+BEGIN_SRC sql
  create trigger TooMany
  after update of enrollment on College
  for each row
  when (Old.enrollment <= 16000 and New.enrollment > 16000)
  begin
      delete from Apply
          where cName = New.cName and major = 'EE';
      update Apply
          set decision = 'U'
          where cName = New.cName
                and decision = 'Y';
  end;
#+END_SRC


self-triggering

#+BEGIN_SRC sql
  create trigger R1
  after insert on T1
  for each row
  begin
      insert into T1 values (New.A+1);
  end;
#+END_SRC

The above query won't enter infinite loop since SQLite disallow a
trigger to be triggered more than once in a trigger processing
session.  But if we like, we can turn on =recursive_triggers= on.

#+BEGIN_SRC sql
  pragma recursive_triggers = on;
  create trigger R1
  after insert on T1
  for each row
  when (select count(*) from T1) < 10
  begin
      insert into T1 values (New.A+1);
  end;
#+END_SRC

trigger each other in a cycle

#+BEGIN_SRC sql
  create trigger R1
  after insert on T1
  for each row
  begin
      insert into T2 values (New.A+1);
  end;

  create trigger R2
  after insert on T2
  for each row
  begin
      insert into T3 values (New.A+1);
  end;

  create trigger R3
  after insert on T3
  for each row
  begin
      insert into T1 values (New.A+1);
  end;
#+END_SRC

#+BEGIN_SRC sql
  pragma recursive_triggers = on;
  create trigger R3
  after insert on T3
  for each row
  when (select count(*) from T1) < 100
  begin
      insert into T1 values (New.A+1);
  end;
#+END_SRC

#+BEGIN_SRC sql
  create trigger R1
  after insert on T1
  for each row
  begin
      update T1 set A = 2;
  end;

  create trigger R2
  after insert on T1
  for each row
  when exists (select * from T1 where A = 2)
  begin
      update T1 set A = 3;
  end;
#+END_SRC

The second trigger is executed first in SQLite.


nested trigger invocation

#+BEGIN_SRC sql
  create trigger R1
  after insert on T1
  for each row
  begin
      insert into T2 values (1);
      insert into T3 values (1);
  end;

  create trigger R2
  after insert on T2
  for each row
  begin
      insert into T3 values (2);
      insert into T4 values (2);
  end;

  create trigger R3
  after insert on T3
  for each row
  begin
      insert into T4 values (3);
  end;
#+END_SRC

immediate activation semantics of SQLite for triggers

#+BEGIN_SRC sql
  create trigger R1
  after insert on T1
  for each row
  begin
      insert into T2 select avg(A) from T1;
  end;
#+END_SRC

