notes/intro_db.html

<div id="outline-container-orgabf08b4" class="outline-4">
<h4 id="orgabf08b4"><span class="section-number-4">7.1.5</span> <span class="done DONE">DONE</span> Triggers Demo</h4>
<div class="outline-text-4" id="text-7-1-5">
<ul class="org-ul">
<li>Before and After; Insert, Delete, and Update<br /></li>
<li>New and Old<br /></li>
<li>Conditions and actions<br /></li>
<li>Triggers enforcing constraints<br /></li>
<li>Trigger chaining<br /></li>
<li>Self-triggering, cycles<br /></li>
<li>Conflicts<br /></li>
<li>Nested trigger invocations<br /></li>
</ul>

<p>
Introduction video used SQL standard<br />
</p>
<ul class="org-ul">
<li>No DBMS implements exact standard<br /></li>
<li>Some deviate considerably<br />
<ul class="org-ul">
<li>In both syntax and behavior!<br /></li>
</ul></li>
</ul>

<p>
Postgres &gt; SQLite &gt;&gt; MySQL<br />
</p>

<p>
Postgres<br />
</p>
<ul class="org-ul">
<li>Expressiveness/behavior = full standard<br />
row-level + statement-level, old/new row &amp; table<br /></li>
<li>Cumbersome &amp; awkward syntax<br /></li>
</ul>

<p>
SQLite<br />
</p>
<ul class="org-ul">
<li>Row-level only, immediate activation =&gt; no old/new table<br /></li>
</ul>

<p>
MySQL<br />
</p>
<ul class="org-ul">
<li>Row-level only, immediate activation =&gt; no old/new table<br /></li>
<li>Only one trigger per event type<br /></li>
<li>Limited trigger chaining<br /></li>
</ul>


<p>
SQLite - row-level triggers, immediate activation<br />
</p>
<ul class="org-ul">
<li><code>For Each Row</code> implicit if not specified<br /></li>
<li>No <code>Old Table</code> or <code>New Table</code><br /></li>
<li>No <code>Referencing</code> clause<br />
<ul class="org-ul">
<li><code>Old</code> and <code>New</code> predefined for <code>Old Row</code> and <code>New Row</code><br /></li>
</ul></li>
<li>Trigger action: SQL statements in <code>begin-end</code> block<br /></li>
</ul>


<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R1</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> Student
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> <span class="org-keyword">New</span>.GPA &gt; 3.3 <span class="org-keyword">and</span> <span class="org-keyword">New</span>.GPA &lt;= 3.6
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (<span class="org-keyword">New</span>.sID, <span class="org-string">'Stanford'</span>, <span class="org-string">'geology'</span>, <span class="org-keyword">null</span>);
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> Apply <span class="org-keyword">values</span> (<span class="org-keyword">New</span>.sID, <span class="org-string">'MIT'</span>, <span class="org-string">'biology'</span>, <span class="org-keyword">null</span>);
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R2</span>
<span class="org-keyword">after</span> <span class="org-keyword">delete</span> <span class="org-keyword">on</span> Student
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">delete</span> <span class="org-keyword">from</span> Apply <span class="org-keyword">where</span> sID = <span class="org-keyword">Old</span>.sID;
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R3</span>
<span class="org-keyword">after</span> <span class="org-keyword">update</span> <span class="org-keyword">of</span> cName <span class="org-keyword">on</span> College
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">update</span> Apply
    <span class="org-keyword">set</span> cName = <span class="org-keyword">New</span>.cName
    <span class="org-keyword">where</span> cName = <span class="org-keyword">Old</span>.cName;
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R4</span>
<span class="org-keyword">before</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> College
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> <span class="org-keyword">exists</span> (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> College <span class="org-keyword">where</span> cName = <span class="org-keyword">New</span>.cName)
<span class="org-keyword">begin</span>
    <span class="org-keyword">select</span> raise(<span class="org-keyword">ignore</span>);
<span class="org-keyword">end</span>;

<span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R5</span>
<span class="org-keyword">before</span> <span class="org-keyword">update</span> <span class="org-keyword">of</span> cName <span class="org-keyword">on</span> College
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> <span class="org-keyword">exists</span> (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> College <span class="org-keyword">where</span> cName = <span class="org-keyword">New</span>.cName)
<span class="org-keyword">begin</span>
    <span class="org-keyword">select</span> raise(<span class="org-keyword">ignore</span>);
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R6</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> Apply
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">from</span> Apply <span class="org-keyword">where</span> cName = <span class="org-keyword">New</span>.cName) &gt; 10
<span class="org-keyword">begin</span>
    <span class="org-keyword">update</span> College <span class="org-keyword">set</span> cName = cName || <span class="org-string">'-Done'</span>
    <span class="org-keyword">where</span> cName = <span class="org-keyword">New</span>.cName;
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R7</span>
<span class="org-keyword">before</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> Student
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> <span class="org-keyword">New</span>.sizeHS &lt; 100 <span class="org-keyword">or</span> <span class="org-keyword">New</span>.sizeHS &gt; 5000
<span class="org-keyword">begin</span>
    <span class="org-keyword">select</span> raise(<span class="org-keyword">ignore</span>);
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R7</span>               <span class="org-comment">-- alternative version using after</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> Student
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> <span class="org-keyword">New</span>.sizeHS &lt; 100 <span class="org-keyword">or</span> <span class="org-keyword">New</span>.sizeHS &gt; 5000
<span class="org-keyword">begin</span>
    <span class="org-keyword">delete</span> <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> sID = <span class="org-keyword">New</span>.sID;
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">AutoAccept</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> Apply
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> (<span class="org-keyword">New</span>.cName = <span class="org-string">'Berkeley'</span> <span class="org-keyword">and</span>
      3.7 &lt; (<span class="org-keyword">select</span> GPA <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> sID = <span class="org-keyword">New</span>.sID) <span class="org-keyword">and</span>
      1200 &lt; (<span class="org-keyword">select</span> sizeHS <span class="org-keyword">from</span> Student <span class="org-keyword">where</span> sID = <span class="org-keyword">New</span>.sID))
<span class="org-keyword">begin</span>
    <span class="org-keyword">update</span> Apply
    <span class="org-keyword">set</span> decision = <span class="org-string">'Y'</span>
    <span class="org-keyword">where</span> sID = <span class="org-keyword">New</span>.sID
          <span class="org-keyword">and</span> cName = <span class="org-keyword">New</span>.cName;
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">TooMany</span>
<span class="org-keyword">after</span> <span class="org-keyword">update</span> <span class="org-keyword">of</span> enrollment <span class="org-keyword">on</span> College
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> (<span class="org-keyword">Old</span>.enrollment &lt;= 16000 <span class="org-keyword">and</span> <span class="org-keyword">New</span>.enrollment &gt; 16000)
<span class="org-keyword">begin</span>
    <span class="org-keyword">delete</span> <span class="org-keyword">from</span> Apply
        <span class="org-keyword">where</span> cName = <span class="org-keyword">New</span>.cName <span class="org-keyword">and</span> major = <span class="org-string">'EE'</span>;
    <span class="org-keyword">update</span> Apply
        <span class="org-keyword">set</span> decision = <span class="org-string">'U'</span>
        <span class="org-keyword">where</span> cName = <span class="org-keyword">New</span>.cName
              <span class="org-keyword">and</span> decision = <span class="org-string">'Y'</span>;
<span class="org-keyword">end</span>;
</pre>
</div>


<p>
self-triggering<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R1</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T1
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T1 <span class="org-keyword">values</span> (<span class="org-keyword">New</span>.A+1);
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
The above query won't enter infinite loop since SQLite disallow a<br />
trigger to be triggered more than once in a trigger processing<br />
session.  But if we like, we can turn on <code>recursive_triggers</code> on.<br />
</p>

<div class="org-src-container">
<pre class="src src-sql">pragma recursive_triggers = <span class="org-keyword">on</span>;
<span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R1</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T1
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">from</span> T1) &lt; 10
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T1 <span class="org-keyword">values</span> (<span class="org-keyword">New</span>.A+1);
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
trigger each other in a cycle<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R1</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T1
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T2 <span class="org-keyword">values</span> (<span class="org-keyword">New</span>.A+1);
<span class="org-keyword">end</span>;

<span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R2</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T2
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T3 <span class="org-keyword">values</span> (<span class="org-keyword">New</span>.A+1);
<span class="org-keyword">end</span>;

<span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R3</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T3
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T1 <span class="org-keyword">values</span> (<span class="org-keyword">New</span>.A+1);
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">pragma recursive_triggers = <span class="org-keyword">on</span>;
<span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R3</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T3
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> (<span class="org-keyword">select</span> <span class="org-builtin">count</span>(*) <span class="org-keyword">from</span> T1) &lt; 100
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T1 <span class="org-keyword">values</span> (<span class="org-keyword">New</span>.A+1);
<span class="org-keyword">end</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R1</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T1
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">update</span> T1 <span class="org-keyword">set</span> A = 2;
<span class="org-keyword">end</span>;

<span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R2</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T1
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">when</span> <span class="org-keyword">exists</span> (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> T1 <span class="org-keyword">where</span> A = 2)
<span class="org-keyword">begin</span>
    <span class="org-keyword">update</span> T1 <span class="org-keyword">set</span> A = 3;
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
The second trigger is executed first in SQLite.<br />
</p>


<p>
nested trigger invocation<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R1</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T1
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T2 <span class="org-keyword">values</span> (1);
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T3 <span class="org-keyword">values</span> (1);
<span class="org-keyword">end</span>;

<span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R2</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T2
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T3 <span class="org-keyword">values</span> (2);
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T4 <span class="org-keyword">values</span> (2);
<span class="org-keyword">end</span>;

<span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R3</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T3
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T4 <span class="org-keyword">values</span> (3);
<span class="org-keyword">end</span>;
</pre>
</div>

<p>
immediate activation semantics of SQLite for triggers<br />
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">trigger</span> <span class="org-function-name">R1</span>
<span class="org-keyword">after</span> <span class="org-keyword">insert</span> <span class="org-keyword">on</span> T1
<span class="org-keyword">for</span> <span class="org-keyword">each</span> <span class="org-type">row</span>
<span class="org-keyword">begin</span>
    <span class="org-keyword">insert</span> <span class="org-keyword">into</span> T2 <span class="org-keyword">select</span> <span class="org-builtin">avg</span>(A) <span class="org-keyword">from</span> T1;
<span class="org-keyword">end</span>;
</pre>
</div>
</div>
</div>
</div>
